#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1DF (0x2DE8 - 0x2C09)
// BlueprintGeneratedClass BP_CharPlayer_Test.BP_CharPlayer_Test_C
class ABP_CharPlayer_Test_C : public ABP_CharPlayer_C
{
public:
	uint8                                        Pad_93D[0x7];                                      // Fixing Size After Last Property  
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x2C10(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	float                                        Timeline_FadeIn_FC5E307F4CA1EF30E35E3E9875D3EB3F;  // 0x2C18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_Dissolve_FC5E307F4CA1EF30E35E3E9875D3EB3F; // 0x2C1C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline__Direction_FC5E307F4CA1EF30E35E3E9875D3EB3F; // 0x2C20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_941[0x7];                                      // Fixing Size After Last Property  
	class UTimelineComponent*                    Timeline;                                          // 0x2C28(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                        TeamNumOverride;                                   // 0x2C30(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_944[0x4];                                      // Fixing Size After Last Property  
	double                                       LaserTraceDistance;                                // 0x2C38(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                     LaserVFX;                                          // 0x2C40(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_Vector                    CachedLaserEndPoint;                               // 0x2C48(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       LaserLerpRate;                                     // 0x2C60(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DeathVFX_Size;                                     // 0x2C68(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_94E[0x4];                                      // Fixing Size After Last Property  
	class UNiagaraSystem*                        Bot_DeathVFX;                                      // 0x2C70(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                          BoneBreakList;                                     // 0x2C78(0x10)(Edit, BlueprintVisible)
	bool                                         HoldingInput;                                      // 0x2C88(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_955[0x3];                                      // Fixing Size After Last Property  
	class FName                                  TargetActorKey;                                    // 0x2C8C(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_959[0x4];                                      // Fixing Size After Last Property  
	TArray<class AActor*>                        PendingActors;                                     // 0x2C98(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UValAT_GameplayTagAddedRemoved*        InShipTagTask;                                     // 0x2CA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                  HealthCountKey;                                    // 0x2CB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  ShieldCountKey;                                    // 0x2CB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bShowWeapon;                                       // 0x2CC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_95E[0x3];                                      // Fixing Size After Last Property  
	class FName                                  GunHoldingHand;                                    // 0x2CC4(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DefaultCanPlayHitPulse;                            // 0x2CCC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_964[0x3];                                      // Fixing Size After Last Property  
	struct Valhalla_DamageData                   LastDamageData;                                    // 0x2CD0(0x100)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                       Last_Damage_Data_Hit_Direction_X;                  // 0x2DD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AttachBotDeathFX;                                  // 0x2DD8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         DebugShowFacingDirection;                          // 0x2DD9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DebugShowLocation;                                 // 0x2DDA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_96A[0x5];                                      // Fixing Size After Last Property  
	double                                       DebugNearbyDistance;                               // 0x2DE0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABP_CharPlayer_Test_C* GetDefaultObj();

	void IsHoldingInput(bool* Value);
	void GetPrimaryFireInput(enum class EValAbilityInputID* Input, uint8 CallFunc_MakeLiteralByte_ReturnValue);
	void AIReleasePrimaryFire(enum class EValAbilityInputID CallFunc_GetPrimaryFireInput_Input, int32 CallFunc_Conv_ByteToInt_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate);
	void AIHoldPrimaryFire(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, enum class EValAbilityInputID CallFunc_GetPrimaryFireInput_Input, int32 CallFunc_Conv_ByteToInt_ReturnValue);
	void RemoveUnusedComponents(bool CallFunc_IsValid_ReturnValue, class UValPingComponent* CallFunc_GetPingComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2);
	void SpawnDeathActor(double CallFunc_BreakVector_NetQuantizeNormal_X, double CallFunc_BreakVector_NetQuantizeNormal_Y, double CallFunc_BreakVector_NetQuantizeNormal_Z, const struct CoreUObject_Vector& CallFunc_MakeVector_ReturnValue, float CallFunc_GetScaledCapsuleHalfHeight_ReturnValue, const struct CoreUObject_Rotator& CallFunc_Conv_VectorToRotator_ReturnValue, const struct CoreUObject_Transform& CallFunc_GetTransform_ReturnValue, const struct CoreUObject_Rotator& CallFunc_ComposeRotators_ReturnValue, const struct CoreUObject_Vector& CallFunc_BreakTransform_Location, const struct CoreUObject_Rotator& CallFunc_BreakTransform_Rotation, const struct CoreUObject_Vector& CallFunc_BreakTransform_Scale, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, const struct CoreUObject_Rotator& CallFunc_ComposeRotators_ReturnValue_1, double CallFunc_Subtract_DoubleDouble_ReturnValue, const struct CoreUObject_Vector& CallFunc_MakeVector_ReturnValue_1, const struct CoreUObject_Transform& CallFunc_MakeTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class AActor* CallFunc_FinishSpawningActor_ReturnValue, class ABP_DeathActor_C* K2Node_DynamicCast_AsBP_Death_Actor, bool K2Node_DynamicCast_bSuccess, double CallFunc_Subtract_DoubleDouble_B_ImplicitCast);
	void PlayBonesBreak(const struct CoreUObject_Vector& CallFunc_GetLastHitDirection_ReturnValue, int32 Temp_int_Variable, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_LastIndex_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, double CallFunc_SelectFloat_ReturnValue, const struct CoreUObject_Vector& CallFunc_Conv_DoubleToVector_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct CoreUObject_Vector& CallFunc_Multiply_VectorVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_Multiply_VectorVector_ReturnValue_1, const struct CoreUObject_Vector& CallFunc_GetLastHitLocation_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct CoreUObject_Vector& CallFunc_Subtract_VectorVector_ReturnValue);
	void GetMeshMaterials(TArray<class UMaterialInterface*>* Materials, bool CallFunc_IsValid_ReturnValue, TArray<class UMaterialInterface*>& CallFunc_GetMaterials_ReturnValue);
	void GetFacingDirection(struct CoreUObject_Vector* Direction, const struct CoreUObject_Rotator& CallFunc_K2_GetActorRotation_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetForwardVector_ReturnValue);
	struct CoreUObject_Vector GetMuzzleFireLocation(bool CallFunc_HasAuthority_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetSocketLocation_ReturnValue, bool CallFunc_DoesSocketExist_ReturnValue, bool CallFunc_ShouldFireFromMesh_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetMuzzleFireLocation_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetActiveMuzzleLocation_ReturnValue);
	int32 GetTeamId(int32 CallFunc_GetTeamId_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue);
	bool HasATeam(bool CallFunc_HasATeam_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue);
	void DestroyAI(class AAIController* Controller);
	void AIHoldInteract(double Duration, uint8 CallFunc_MakeLiteralByte_ReturnValue);
	void On_Doors_Opened(class UBlackboardComponent* LocalBlackboard, enum class EBotDirective LocalDoorsOpened, class UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue, class FName CallFunc_MakeLiteralName_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void FindDropship(class ADropship_Doors_C* ClosestDropship, double ClosestDist, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class ADropship_Doors_C* CallFunc_GetActorOfClass_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void On_in_Ship_Tag_Changed(const struct GameplayTags_GameplayTag& Tag, enum class EBotDirective LocalInShip, class UBlackboardComponent* LocalBlackboard, class FName CallFunc_MakeLiteralName_ReturnValue, class UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput, bool CallFunc_HasMatchingGameplayTag_ReturnValue, bool CallFunc_IsValid_ReturnValue, class FName CallFunc_MakeLiteralName_ReturnValue_1, class FName CallFunc_MakeLiteralName_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_1);
	void AddPendingActor(class AActor* Actor, int32 CallFunc_Array_AddUnique_ReturnValue);
	void HasPendingActors(bool* _, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class AActor* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void AIPressPrimaryFire(double HoldDuration, enum class EValAbilityInputID CallFunc_GetPrimaryFireInput_Input);
	void CreateLaserVFX(bool CallFunc_HasAuthority_ReturnValue, const struct CoreUObject_Transform& Temp_struct_Variable, class UNiagaraComponent* CallFunc_AddComponent_ReturnValue, bool CallFunc_K2_AttachToComponent_ReturnValue);
	void UpdateLaserEndPoint(TArray<class AActor*>& Temp_object_Variable, bool CallFunc_EqualEqual_VectorVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_Conv_DoubleToVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetForwardVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_Multiply_VectorVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_Add_VectorVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_VLerp_ReturnValue, const struct CoreUObject_Vector& CallFunc_SelectVector_ReturnValue, const struct Engine_HitResult& CallFunc_LineTraceSingle_OutHit, bool CallFunc_LineTraceSingle_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Location, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactPoint, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Normal, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceStart, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceEnd, float CallFunc_VLerp_Alpha_ImplicitCast);
	void GetMuzzleLocation(struct CoreUObject_Vector* MuzzleLocation, const struct CoreUObject_Vector& CallFunc_GetMuzzleFireLocation_ReturnValue, bool CallFunc_HasMultipleMuzzleFireLocations_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetActiveMuzzleLocation_ReturnValue);
	void GetAIMuzzle(class USceneComponent** Muzzle);
	void GetAbilitySystem(class UAbilitySystemComponent** AbilitySystem);
	void GetThreatSystem(class UValThreatComponent** ThreatSystem);
	void UserConstructionScript();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void OnTagRemoved_97A6453A43478020664BC3A00D1086A2(const struct GameplayTags_GameplayTag& Tag);
	void OnTagAdded_97A6453A43478020664BC3A00D1086A2(const struct GameplayTags_GameplayTag& Tag);
	void ReceiveTick(float DeltaSeconds);
	void EventDied();
	void ReceiveBeginPlay();
	void UpdateLaserVisibility(bool ShouldBeVisible);
	void EventRespawned();
	void EventHoldKey(double Duration, enum class EValAbilityInputID Key);
	void OnTargetActorUpdated(class UObject* PreviousTarget, class UObject* NewTarget);
	void ClientOnTargetUpdated(class AActor* OldTarget, class AActor* NewTarget);
	void OnPendingActorDestroyed(class AActor* DestroyedActor);
	void BPEquipSlotUpdated(const struct GameplayTags_GameplayTag& EquipSlot);
	void OnHealthPackCount(int32 Value, int32 OldValue);
	void OnShieldPackCount(int32 Value, int32 OldValue);
	void SetTeamId(int32 TeamId);
	void OnDamagedEvent(const struct Valhalla_DamageData& DamageData);
	void DebugShowOrientation();
	void DebugPinpointLocation();
	void ExecuteUbergraph_BP_CharPlayer_Test(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, bool CallFunc_HasAuthority_ReturnValue, float K2Node_Event_DeltaSeconds, class AController* CallFunc_GetController_ReturnValue, class AAIController* K2Node_DynamicCast_AsAIController, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsActive_ReturnValue, bool K2Node_CustomEvent_ShouldBeVisible, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_4, double K2Node_CustomEvent_Duration, enum class EValAbilityInputID K2Node_CustomEvent_Key, int32 CallFunc_Conv_ByteToInt_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UObject* K2Node_CustomEvent_PreviousTarget, class UObject* K2Node_CustomEvent_NewTarget_1, bool CallFunc_NotEqual_ObjectObject_ReturnValue, TScriptInterface<class IBI_AI_C> K2Node_DynamicCast_AsBI_AI, bool K2Node_DynamicCast_bSuccess_1, class UValThreatComponent* CallFunc_GetThreatSystem_ThreatSystem, class AActor* K2Node_DynamicCast_AsActor, bool K2Node_DynamicCast_bSuccess_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class AActor* K2Node_CustomEvent_OldTarget, class AActor* K2Node_CustomEvent_NewTarget, bool CallFunc_IsValid_ReturnValue_5, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_IsValid_ReturnValue_6, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_HasPendingActors__, class AActor* CallFunc_Array_Get_Item, bool CallFunc_IsValid_ReturnValue_7, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class AActor* K2Node_CustomEvent_DestroyedActor, bool CallFunc_HasPendingActors___1, bool CallFunc_Array_RemoveItem_ReturnValue, class AController* CallFunc_GetController_ReturnValue_1, double CallFunc_RandomFloatInRange_ReturnValue, class AAIController* K2Node_DynamicCast_AsAIController_1, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_IsDedicatedServer_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_EquipSlot, bool CallFunc_EqualEqual_GameplayTag_ReturnValue, class UValAT_GameplayTagAddedRemoved* CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_IsValid_ReturnValue_8, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsValid_ReturnValue_9, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, const struct CoreUObject_Vector& CallFunc_Conv_DoubleToVector_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, int32 K2Node_CustomEvent_Value_1, int32 K2Node_CustomEvent_OldValue_1, int32 K2Node_CustomEvent_Value, int32 K2Node_CustomEvent_OldValue, class UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue, bool CallFunc_IsValid_ReturnValue_10, bool CallFunc_IsValid_ReturnValue_11, bool CallFunc_HasAuthority_ReturnValue_1, const struct CoreUObject_Vector& CallFunc_Conv_DoubleToVector_ReturnValue_1, bool CallFunc_IsCybrid_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_2, int32 K2Node_Event_TeamId, bool CallFunc_NotEqual_IntInt_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, const struct GameplayTags_GameplayTag& Temp_struct_Variable, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_Tag, bool CallFunc_IsValid_ReturnValue_12, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_Tag_1, TArray<class UMaterialInterface*>& CallFunc_GetMeshMaterials_Materials, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_IsCybrid_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, const struct Valhalla_DamageData& K2Node_Event_DamageData, bool CallFunc_IsDedicatedServer_ReturnValue_2, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_3, bool CallFunc_IsValidClass_ReturnValue, bool CallFunc_IsValidClass_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, bool CallFunc_IsDedicatedServer_ReturnValue_3, bool CallFunc_IsDedicatedServer_ReturnValue_4, bool CallFunc_Not_PreBool_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue_4, bool CallFunc_IsDedicatedServer_ReturnValue_5, const struct CoreUObject_Vector& CallFunc_GetSocketLocation_ReturnValue, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetActorLocation_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetActorForwardVector_ReturnValue, bool CallFunc_IsValid_ReturnValue_13, const struct CoreUObject_Vector& CallFunc_Multiply_VectorVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_Add_VectorVector_ReturnValue, bool CallFunc_IsPlayerBot_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_3, class APawn* CallFunc_GetPlayerPawn_ReturnValue, class AValCharacter* K2Node_DynamicCast_AsVal_Character, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_IsEnemyWith_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct CoreUObject_LinearColor& CallFunc_SelectColor_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetActorLocation_ReturnValue_2, double CallFunc_Vector_Distance2DSquared_ReturnValue, double CallFunc_Square_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetActorLocation_ReturnValue_3, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, double CallFunc_SafeDivide_ReturnValue, double CallFunc_FClamp_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetActorUpVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_Multiply_VectorVector_ReturnValue_1, const struct CoreUObject_Vector& CallFunc_Add_VectorVector_ReturnValue_1, float CallFunc_Delay_Duration_ImplicitCast, float CallFunc_Delay_Duration_ImplicitCast_1, float CallFunc_DrawDebugLine_Thickness_ImplicitCast);
};

}


