#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x187 (0x2C09 - 0x2A82)
// BlueprintGeneratedClass BP_CharPlayer.BP_CharPlayer_C
class ABP_CharPlayer_C : public ABP_ValChar_Master_C
{
public:
	uint8                                        Pad_3E89[0x6];                                     // Fixing Size After Last Property  
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x2A88(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PhysicalHitReact_C*                BP_PhysicalHitReact;                               // 0x2A90(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetInteractionComponent*           WidgetInteraction;                                 // 0x2A98(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UValVisibleToAIComponent*              VisibleToAIComp;                                   // 0x2AA0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UValProxyAudioThreatComponent*         ValProxyAudioThreat;                               // 0x2AA8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UValLocalAudioThreatComponent*         ValLocalAudioThreat;                               // 0x2AB0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                          Gun_AK;                                            // 0x2AB8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                          CharacterMesh_AK;                                  // 0x2AC0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        DeathDissolve_FadeIn_24DF687247F9F9803F0F9EA41CD7B849; // 0x2AC8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DeathDissolve_Dissolve_24DF687247F9F9803F0F9EA41CD7B849; // 0x2ACC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                DeathDissolve__Direction_24DF687247F9F9803F0F9EA41CD7B849; // 0x2AD0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3E97[0x7];                                     // Fixing Size After Last Property  
	class UTimelineComponent*                    DeathDissolve;                                     // 0x2AD8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                       ThreePCameraAlpha;                                 // 0x2AE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            DispatchEnterBattleRoyaleZone;                     // 0x2AE8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            DispatchExitBattleRoyaleZone;                      // 0x2AF8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCameraShakeBase*                      DriftShake;                                        // 0x2B08(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ACameraShakeSourceActor*               CachedPodShakeActor;                               // 0x2B10(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UValAT_GameplayTagAddedRemoved*        FallingTagTask;                                    // 0x2B18(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                         Backpack;                                          // 0x2B20(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                     PS_Revealed_1P;                                    // 0x2B28(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                     PS_Revealed_3P;                                    // 0x2B30(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnJumpPadLanded;                                   // 0x2B38(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnStunned;                                         // 0x2B48(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                  ExistingItem;                                      // 0x2B58(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValAT_GameplayTagAddedRemoved*        Underwater_Tag_Task;                               // 0x2B60(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UDataTable>             DefaultBoostItemsTable;                            // 0x2B68(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct GameplayAbilities_ActiveGameplayEffectHandle SkydiveJetpackGameplayEffectHandle;                // 0x2B90(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         bToggleOnJetpackLight;                             // 0x2B98(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3EA5[0x7];                                     // Fixing Size After Last Property  
	double                                       JetpackLightIntensity;                             // 0x2BA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                        DefaultDeathVFX;                                   // 0x2BA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveLinearColorAtlas*                WeaponCurveAtlas;                                  // 0x2BB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnHoveredWidgetChanged;                            // 0x2BB8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UAnimMontage*>                  DefaultHitReactMontages;                           // 0x2BC8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                     PS_Detected_1P;                                    // 0x2BD8(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UValCharacterAnimInstance*             As_Val_Character_Anim_Instance;                    // 0x2BE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         bTurn;                                             // 0x2BE8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3EAE[0x3];                                     // Fixing Size After Last Property  
	int32                                        Windfall_SFX;                                      // 0x2BEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct GameplayAbilities_ActiveGameplayEffectHandle CachedMasterySilentHandle;                         // 0x2BF0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         bStartedhighSpeedFalling;                          // 0x2BF8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bSFXDroppodEnabled;                                // 0x2BF9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3EB3[0x6];                                     // Fixing Size After Last Property  
	class UNiagaraComponent*                     PS_Targeter_3P;                                    // 0x2C00(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	enum class EPhysicalSurface                  CachedGroundSurfaceType;                           // 0x2C08(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABP_CharPlayer_C* GetDefaultObj();

	void GetFacingDirection(struct CoreUObject_Vector* Direction);
	void GetMuzzleLocation(struct CoreUObject_Vector* MuzzleLocation);
	void GetAIMuzzle(class USceneComponent** Muzzle);
	void GetAbilitySystem(class UAbilitySystemComponent** AbilitySystem);
	void GetThreatSystem(class UValThreatComponent** ThreatSystem);
	void HideNameplate(bool Hide, class AValPlayerState* K2Node_DynamicCast_AsVal_Player_State, bool K2Node_DynamicCast_bSuccess);
