#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x271 (0x531 - 0x2C0)
// BlueprintGeneratedClass BP_Flashlight.BP_Flashlight_C
class ABP_Flashlight_C : public AValFlashlightActor
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x2C0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                  SM_FlashLightCone;                                 // 0x2C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  SM_1P_FlashLightPlane;                             // 0x2D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AValCharacter*                         OwningCharacter;                                   // 0x2D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UValAbilitySystemComponent*            OwningASC;                                         // 0x2E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                        FlashlightDistance;                                // 0x2E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_34D4[0x4];                                     // Fixing Size After Last Property  
	struct GameplayAbilities_GameplayEffectSpecHandle CachedBotFlashedGE;                                // 0x2F0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct GameplayAbilities_GameplayEffectSpecHandle CachedActorXrayedGE;                               // 0x300(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class AActor*, struct GameplayAbilities_ActiveGameplayEffectHandle> CachedFlashedAI;                                   // 0x310(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class AActor*, struct GameplayAbilities_ActiveGameplayEffectHandle> CachedXrayedActors;                                // 0x360(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                        CachedLevel;                                       // 0x3B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CachedMastered;                                    // 0x3B4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_34DA[0x3];                                     // Fixing Size After Last Property  
	double                                       DefaultMinimumDistance;                            // 0x3B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CachedDetectedFlashlightDistanceSq;                // 0x3C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        DefaultMaxLevel;                                   // 0x3C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct GameplayAbilities_ActiveGameplayEffectHandle LocalActiveHandle;                                 // 0x3CC(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_34DE[0x4];                                     // Fixing Size After Last Property  
	TSet<class AActor*>                          CachedFlashedTripwire;                             // 0x3D8(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TSet<class AActor*>                          CachedFlashedPoisonTrap;                           // 0x428(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TSet<class AActor*>                          CachedFlashedActor;                                // 0x478(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TSet<class AActor*>                          CachedPendingActor;                                // 0x4C8(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                         bEnable;                                           // 0x518(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_34E7[0x7];                                     // Fixing Size After Last Property  
	double                                       CachedIntensity;                                   // 0x520(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CachedBaseAttenuationRadius;                       // 0x528(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         MasteryAchieved;                                   // 0x530(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABP_Flashlight_C* GetDefaultObj();

	void SearchForInvisibleTargets(int32 Temp_int_Array_Index_Variable, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, int32 Temp_int_Loop_Counter_Variable, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_SetDuration_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct CoreUObject_Vector& CallFunc_Conv_DoubleToVector_ReturnValue, TArray<class AActor*>& K2Node_MakeArray_Array, const struct CoreUObject_Vector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetForwardVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_Multiply_VectorVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_Add_VectorVector_ReturnValue, TArray<struct Engine_HitResult>& CallFunc_CapsuleTraceMulti_OutHits, bool CallFunc_CapsuleTraceMulti_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, const struct Engine_HitResult& CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Location, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactPoint, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Normal, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceStart, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceEnd, class AValCharacter* K2Node_DynamicCast_AsVal_Character, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsEnemyWith_ReturnValue, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_1, bool CallFunc_IsInvisible_ReturnValue, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, double CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast);
	void ApplyRangeModifiers(bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute, float CallFunc_GetFloatAttribute_ReturnValue, double CallFunc_Square_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1, double CallFunc_Square_A_ImplicitCast, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast, float CallFunc_SetAttenuationRadius_NewRadius_ImplicitCast, float CallFunc_SetIntensity_NewIntensity_ImplicitCast);
	void OnFlashlightIntensityModifierChanged(float OldValue, float NewValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast, float CallFunc_SetIntensity_NewIntensity_ImplicitCast);
	void ApplyIntensityModifier();
	void AddPendingOnRemoveDirectFlashFromTarget(class AActor* TargetActor, bool CallFunc_Set_Remove_ReturnValue, bool CallFunc_Set_Contains_ReturnValue);
	void OnViewTargetChanged(class AActor* NewViewTarget, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsLocallyViewed_ReturnValue, bool CallFunc_IsLocallyViewed_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1);
	void GetPositionByActorType(class AActor* TargetActor, struct CoreUObject_Vector* Position, class AValCharacter* K2Node_DynamicCast_AsVal_Character, bool K2Node_DynamicCast_bSuccess, class ABP_LaserTripwire_Horizontal_C* K2Node_DynamicCast_AsBP_Laser_Tripwire_Horizontal, bool K2Node_DynamicCast_bSuccess_1, const struct CoreUObject_Vector& CallFunc_GetSocketLocation_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetActorLocation_ReturnValue);
	void RemoveActiveEffect(class AActor* Actor, const struct GameplayAbilities_ActiveGameplayEffectHandle& Handle, bool* Success, class UAbilitySystemComponent* NewLocalVar, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_RemoveActiveGameplayEffect_ReturnValue);
	void CleanupUnflashedTarget(TArray<class AActor*>& FlashedTargets, TMap<class AActor*, struct GameplayAbilities_ActiveGameplayEffectHandle> LocalRemoveTarget, TArray<class AActor*>& CallFunc_Set_ToArray_Result, int32 CallFunc_Set_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, TArray<class AActor*>& CallFunc_Set_ToArray_Result_1, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, class AActor* CallFunc_Array_Get_Item, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Array_Contains_ReturnValue);
	void Try_Apply_Flashlight_To_AI(class AActor* TargetBot, double DistanceSq, bool* Success, bool LocalContainCheck, bool LocalDistanceCheck, bool CallFunc_RemoveFlashFromAI_Success, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_1, class AValCharacter* K2Node_DynamicCast_AsVal_Character, bool K2Node_DynamicCast_bSuccess, class AValPlayerState* K2Node_DynamicCast_AsVal_Player_State, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_IsABotPlayerState_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, bool CallFunc_Map_Contains_ReturnValue);
	void TryApplyXrayToActor(class AActor* TargetActor, bool* Success, const struct GameplayAbilities_ActiveGameplayEffectHandle& LocalActiveHandle, bool CallFunc_HasAuthority_ReturnValue, bool CallFunc_RemoveFlashFromAI_Success, const struct CoreUObject_Vector& CallFunc_K2_GetActorLocation_ReturnValue, TArray<class AActor*>& K2Node_MakeArray_Array, const struct CoreUObject_Vector& CallFunc_K2_GetComponentLocation_ReturnValue, bool CallFunc_ApplyXrayToActor_Success, const struct Engine_HitResult& CallFunc_LineTraceSingle_OutHit, bool CallFunc_LineTraceSingle_ReturnValue, bool CallFunc_Map_Contains_ReturnValue);
	void AddPendingOnApplyDirectFlashOnTarget(class AActor* TargetActor, bool CallFunc_Set_Contains_ReturnValue);
	void Remove_Direct_Flashlight_From_Target(class AActor* TargetActor, bool CallFunc_Set_Remove_ReturnValue, TScriptInterface<class IValXrayScannable> K2Node_DynamicCast_AsVal_Xray_Scannable, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Set_Contains_ReturnValue);
	void Apply_Direct_Flashlight_on_Target(class AActor* TargetActor, TScriptInterface<class IValXrayScannable> K2Node_DynamicCast_AsVal_Xray_Scannable, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Set_Contains_ReturnValue);
	void RemoveFlashFromAI(class AActor* TargetBot, bool* Success, class AValCharacter* K2Node_DynamicCast_AsVal_Character, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Map_Remove_ReturnValue, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_RemoveActiveEffect_Success);
	void ApplyFlashlightToAI(class AValCharacter* TargetBot, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue);
	void RemoveXrayFromActor(class AActor* TargetActor, bool CallFunc_Map_Remove_ReturnValue, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_RemoveActiveEffect_Success);
	void ApplyXrayToActor(class AActor* TargetActor, bool* Success, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, bool CallFunc_IsActiveGameplayEffectHandleValid_ReturnValue, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue);
	void Search_for_Target(const struct CoreUObject_Vector& LocalEndPos, const TArray<class AActor*>& LocalInvisibleActors, const TArray<class AActor*>& LocalActorArray, const struct CoreUObject_Vector& CallFunc_GetForwardVector_ReturnValue, TArray<class AActor*>& K2Node_MakeArray_Array, const struct CoreUObject_Vector& CallFunc_K2_GetComponentLocation_ReturnValue, bool CallFunc_CacheParent_Success, const struct CoreUObject_Vector& CallFunc_Conv_DoubleToVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_Multiply_VectorVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_Add_VectorVector_ReturnValue, bool CallFunc_IsValid_ReturnValue, TArray<struct Engine_HitResult>& CallFunc_CapsuleTraceMulti_OutHits, bool CallFunc_CapsuleTraceMulti_ReturnValue, TScriptInterface<class IValDamageable> CallFunc_IsAlive_self_CastInput, bool CallFunc_IsAlive_ReturnValue, class APawn* CallFunc_GetPlayerPawn_ReturnValue, class AActor* CallFunc_GetAttachParentActor_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, double CallFunc_Conv_DoubleToVector_InDouble_ImplicitCast);
	void CacheParent(bool* Success, bool CallFunc_IsValid_ReturnValue, const struct GameplayAbilities_GameplayEffectContextHandle& CallFunc_GetEffectContext_ReturnValue, const struct GameplayAbilities_GameplayEffectContextHandle& CallFunc_GetEffectContext_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsLocallyViewed_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsLocallyViewed_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_1, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue_1, class AActor* CallFunc_GetAttachParentActor_ReturnValue, class AValCharacter* K2Node_DynamicCast_AsVal_Character, bool K2Node_DynamicCast_bSuccess);
	void UserConstructionScript(double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast);
	void OnTagRemoved_3C1E0C154CADD436E0ADDDB1C1C8E4A0(const struct GameplayTags_GameplayTag& Tag);
	void OnTagAdded_3C1E0C154CADD436E0ADDDB1C1C8E4A0(const struct GameplayTags_GameplayTag& Tag);
	void ReceiveTick(float DeltaSeconds);
	void BP_OnDisable();
	void BP_OnUpdateFlashlightLevel(int32 Level);
	void OnSetEnabledUpdated();
	void ReceiveBeginPlay();
	void BP_OnApplyDirectFlashlightToTargets(TArray<class AActor*>& Targets);
	void BP_OnRemoveDirectFlashlightFromTargets(TArray<class AActor*>& Targets);
	void BP_OnUpdateOwner();
	void ExecuteUbergraph_BP_Flashlight(int32 EntryPoint, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_Tag, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct GameplayTags_GameplayTag& Temp_struct_Variable, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_Tag_1, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsLocallyViewed_ReturnValue, class AActor* CallFunc_GetAttachParentActor_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, class APawn* CallFunc_GetPlayerPawn_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, float K2Node_Event_DeltaSeconds, bool CallFunc_IsVisible_ReturnValue, TArray<class AActor*>& K2Node_MakeArray_Array, int32 K2Node_Event_Level, double CallFunc_Subtract_DoubleDouble_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, double CallFunc_Conv_IntToDouble_ReturnValue, bool CallFunc_IsLocallyViewed_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_1, double CallFunc_Conv_IntToDouble_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_2, double CallFunc_Multiply_DoubleDouble_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_2, double CallFunc_Add_DoubleDouble_ReturnValue, int32 CallFunc_Clamp_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, class APlayerController* CallFunc_GetPlayerController_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class AValPlayerController* K2Node_DynamicCast_AsVal_Player_Controller, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsServer_ReturnValue, TArray<class AActor*>& K2Node_Event_Targets_1, TArray<class AActor*>& K2Node_Event_Targets, class AActor* CallFunc_Array_Get_Item, class AActor* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_CacheParent_Success, bool CallFunc_IsVisible_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute, float CallFunc_GetFloatAttribute_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_3, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, class UValAT_GameplayTagAddedRemoved* CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput, bool CallFunc_HasMatchingGameplayTag_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_EqualEqual_DoubleDouble_ReturnValue, double CallFunc_Subtract_DoubleDouble_A_ImplicitCast, double K2Node_VariableSet_CachedIntensity_ImplicitCast, double K2Node_VariableSet_CachedIntensity_ImplicitCast_1);
};

}


