#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xC8 (0x368 - 0x2A0)
// BlueprintGeneratedClass BP_GrenadeIndicatorActor.BP_GrenadeIndicatorActor_C
class ABP_GrenadeIndicatorActor_C : public AValGrenadeIndicatorActor
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x2A0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialBillboardComponent*           MaterialBillboard;                                 // 0x2A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Plane;                                             // 0x2B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       Animation;                                         // 0x2B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       LocalRotation;                                     // 0x2C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       Scale;                                             // 0x2C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       Offset;                                            // 0x2D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       CenterAxis;                                        // 0x2D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x2E0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                           PitchBankAmount;                                   // 0x2E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_Vector                    BaseRelativeLocation;                              // 0x2F0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_Vector                    AlignedRelativeLocationOffset;                     // 0x308(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AlignedPitchOffset;                                // 0x320(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_Vector                    PitchDownRelativeOffset;                           // 0x328(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              GrenadeIconMID;                                    // 0x340(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         IsOnlyWarning;                                     // 0x348(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C6[0x7];                                      // Fixing Size After Last Property  
	class UCurveFloat*                           AnimationGrenadeIconPulse;                         // 0x350(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       GrenadeIconBaseSize;                               // 0x358(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentGrenadeIconSize;                            // 0x360(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABP_GrenadeIndicatorActor_C* GetDefaultObj();

	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UpdateTarget();
	void UpdateAnimation(double DeltaTime);
	void OnViewTargetChanged_Event_0(class AActor* NewViewTarget);
	void ExecuteUbergraph_BP_GrenadeIndicatorActor(int32 EntryPoint, enum class EGrenadeIndicatorIconType Temp_byte_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UMaterialInterface* Temp_object_Variable, class UMaterialInterface* Temp_object_Variable_1, int32 Temp_int_Array_Index_Variable, class ABP_Projectile_Grenade_Master_C* K2Node_DynamicCast_AsBP_Projectile_Grenade_Master, bool K2Node_DynamicCast_bSuccess, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UMaterialInterface* K2Node_Select_Default, class ABP_Projectile_Grenade_Master_C* K2Node_DynamicCast_AsBP_Projectile_Grenade_Master_1, bool K2Node_DynamicCast_bSuccess_1, float K2Node_Event_DeltaSeconds, bool CallFunc_EqualEqual_ByteByte_ReturnValue, double K2Node_CustomEvent_DeltaTime, class APlayerController* CallFunc_GetPlayerController_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetPlayerViewPoint_Location, const struct CoreUObject_Rotator& CallFunc_GetPlayerViewPoint_Rotation, const struct Engine_HitResult& CallFunc_K2_SetActorLocationAndRotation_SweepHitResult, bool CallFunc_K2_SetActorLocationAndRotation_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetActorLocation_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct CoreUObject_Transform& CallFunc_GetTransform_ReturnValue, const struct CoreUObject_Rotator& CallFunc_FindLookAtRotation_ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, const struct CoreUObject_Vector& CallFunc_K2_GetActorLocation_ReturnValue_2, const struct CoreUObject_Rotator& CallFunc_MakeRotator_ReturnValue, const struct CoreUObject_Rotator& CallFunc_FindRelativeLookAtRotation_ReturnValue, const struct Engine_HitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult, float CallFunc_BreakRotator_Roll_1, float CallFunc_BreakRotator_Pitch_1, float CallFunc_BreakRotator_Yaw_1, const struct CoreUObject_LinearColor& Temp_struct_Variable, float CallFunc_GetFloatValue_ReturnValue, const struct CoreUObject_Rotator& CallFunc_MakeRotator_ReturnValue_1, const struct Engine_HitResult& CallFunc_K2_SetRelativeRotation_SweepHitResult_1, bool Temp_bool_Variable, const struct CoreUObject_LinearColor& Temp_struct_Variable_1, const struct CoreUObject_Rotator& CallFunc_K2_GetActorRotation_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetUpVector_ReturnValue, const struct CoreUObject_Rotator& CallFunc_K2_GetComponentRotation_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetForwardVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetForwardVector_ReturnValue_1, double CallFunc_Dot_VectorVector_ReturnValue, class ABP_Projectile_Grenade_Master_C* K2Node_DynamicCast_AsBP_Projectile_Grenade_Master_2, bool K2Node_DynamicCast_bSuccess_2, double CallFunc_MapRangeClamped_ReturnValue, double CallFunc_Dot_VectorVector_ReturnValue_1, const struct CoreUObject_Vector& CallFunc_Conv_DoubleToVector_ReturnValue, double CallFunc_MapRangeClamped_ReturnValue_1, const struct CoreUObject_Vector& CallFunc_Multiply_VectorVector_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, const struct Engine_HitResult& CallFunc_K2_AddRelativeLocation_SweepHitResult, const struct CoreUObject_Rotator& CallFunc_MakeRotator_ReturnValue_2, double CallFunc_MapRangeClamped_ReturnValue_2, const struct Engine_HitResult& CallFunc_K2_AddRelativeRotation_SweepHitResult, const struct CoreUObject_Vector& CallFunc_Conv_DoubleToVector_ReturnValue_1, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, const struct CoreUObject_Vector& CallFunc_Multiply_VectorVector_ReturnValue_1, class AActor* CallFunc_GetViewTarget_ReturnValue, const struct CoreUObject_Vector& CallFunc_Add_VectorVector_ReturnValue, bool CallFunc_ShouldShowIndicator_bShouldShowIndicator, bool CallFunc_ShouldShowIndicator_IsOnlyWithinWarningRange, const struct Engine_HitResult& CallFunc_K2_SetRelativeLocation_SweepHitResult, const struct CoreUObject_LinearColor& K2Node_Select_Default_1, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, bool CallFunc_IsValid_ReturnValue, float CallFunc_GetGameTimeSinceCreation_ReturnValue, const struct Engine_MaterialSpriteElement& CallFunc_Array_Get_Item, float CallFunc_GetFloatValue_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, double CallFunc_FInterpTo_ReturnValue, const struct Engine_MaterialSpriteElement& K2Node_SetFieldsInStruct_StructOut, TArray<struct Engine_MaterialSpriteElement>& K2Node_MakeArray_Array, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, class AActor* CallFunc_GetOwner_ReturnValue, class ABP_ValPlayerController_C* K2Node_DynamicCast_AsBP_Val_Player_Controller, bool K2Node_DynamicCast_bSuccess_3, class AActor* K2Node_CustomEvent_NewViewTarget, class AActor* CallFunc_GetOwner_ReturnValue_1, class ABP_ValPlayerController_C* K2Node_DynamicCast_AsBP_Val_Player_Controller_1, bool K2Node_DynamicCast_bSuccess_4, double CallFunc_UpdateAnimation_DeltaTime_ImplicitCast, float CallFunc_MakeRotator_Pitch_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, float K2Node_SetFieldsInStruct_BaseSizeX_ImplicitCast, float K2Node_SetFieldsInStruct_BaseSizeY_ImplicitCast);
};

}


