#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x11E (0x2BA0 - 0x2A82)
// BlueprintGeneratedClass BP_ValChar_Turret_Master.BP_ValChar_Turret_Master_C
class ABP_ValChar_Turret_Master_C : public ABP_ValChar_Master_C
{
public:
	uint8                                        Pad_36D2[0x6];                                     // Fixing Size After Last Property  
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x2A88(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UValVisibleToAIComponent*              VisibleToAIComponent;                              // 0x2A90(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       TPMuzzleLocation_L;                                // 0x2A98(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       TPMuzzleLocation_R;                                // 0x2AA0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       ArmingTime;                                        // 0x2AA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         IsArmed;                                           // 0x2AB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_36D4[0x7];                                     // Fixing Size After Last Property  
	double                                       TurnSpeed;                                         // 0x2AB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_ValChar_Master_C*>          Targets;                                           // 0x2AC0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                         Wait;                                              // 0x2AD0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_36E0[0x7];                                     // Fixing Size After Last Property  
	TArray<class UClass*>                        AdditionalEffects;                                 // 0x2AD8(0x10)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UValDeployableAudioVisual*             AudioVisual;                                       // 0x2AE8(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct CoreUObject_Rotator                   AimArrayVector;                                    // 0x2AF0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	enum class EValOwnedSpawnType                SpawnType;                                         // 0x2B08(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         PendingDeath;                                      // 0x2B09(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_36E8[0x6];                                     // Fixing Size After Last Property  
	double                                       DeathRadius;                                       // 0x2B10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         HasTargets;                                        // 0x2B18(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_36EA[0x7];                                     // Fixing Size After Last Property  
	struct CoreUObject_Vector                    HitDirection;                                      // 0x2B20(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AValCharacter*                         ActiveTarget;                                      // 0x2B38(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        CachedTeamNum;                                     // 0x2B40(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_36EC[0x4];                                     // Fixing Size After Last Property  
	double                                       LockOnTime;                                        // 0x2B48(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         LockedOn;                                          // 0x2B50(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PendingLock;                                       // 0x2B51(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldRevealTarget;                                // 0x2B52(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         IsDisabled;                                        // 0x2B53(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ScannersActive;                                    // 0x2B54(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ExtraBotDamage;                                    // 0x2B58(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_36F0[0x3];                                     // Fixing Size After Last Property  
	struct GameplayAbilities_ActiveGameplayEffectHandle Robot_Damage_Handle;                               // 0x2B5C(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_36F1[0x4];                                     // Fixing Size After Last Property  
	double                                       SelfDestructRadius;                                // 0x2B68(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ExtraDamageUpgrade;                                // 0x2B70(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         SelfDestructed;                                    // 0x2B71(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PowerShotUpgrade;                                  // 0x2B72(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_36FD[0x1];                                     // Fixing Size After Last Property  
	int32                                        ShotsTaken;                                        // 0x2B74(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct GameplayAbilities_ActiveGameplayEffectHandle PowerShotHandle;                                   // 0x2B78(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct Valhalla_ValGameplayEffectContainerSpec SelfDestructSpec;                                  // 0x2B80(0x10)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                         AlternateFireSockets;                              // 0x2B90(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IgnorePlayers;                                     // 0x2B91(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IgnoreCybrids;                                     // 0x2B92(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3700[0x5];                                     // Fixing Size After Last Property  
	class UClass*                                Weapon_Class;                                      // 0x2B98(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABP_ValChar_Turret_Master_C* GetDefaultObj();

	class UAbilitySystemComponent* GetASC();
	int32 GetTeamId(int32 Temp_int_Variable, TScriptInterface<class IWithTeamInterface> K2Node_DynamicCast_AsWith_Team_Interface, bool K2Node_DynamicCast_bSuccess, bool CallFunc_DoesImplementInterface_ReturnValue, int32 CallFunc_GetTeamId_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, int32 CallFunc_GetTeamId_ReturnValue_1);
	bool HasATeam(bool Temp_bool_Variable, bool CallFunc_NotEqual_ObjectObject_ReturnValue, TScriptInterface<class IWithTeamInterface> K2Node_DynamicCast_AsWith_Team_Interface, bool K2Node_DynamicCast_bSuccess, bool CallFunc_HasATeam_ReturnValue, bool CallFunc_DoesImplementInterface_ReturnValue, bool CallFunc_HasATeam_ReturnValue_1, bool CallFunc_NotEqual_IntInt_ReturnValue);
	void CreateExplosion(class UNiagaraSystem* SystemTemplate, const struct CoreUObject_Vector& Explosion_Scale, const struct CoreUObject_Vector& ExplosionLocation, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct CoreUObject_Vector& CallFunc_Add_VectorVector_ReturnValue);
	void RevealTarget(class AValCharacter* K2Node_DynamicCast_AsVal_Character, bool K2Node_DynamicCast_bSuccess, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_SetDuration_ReturnValue, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	bool IsBlocked(class AActor* Actor, const struct CoreUObject_Vector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetActorLocation_ReturnValue_1, TArray<class AActor*>& K2Node_MakeArray_Array, const struct Engine_HitResult& CallFunc_LineTraceSingle_OutHit, bool CallFunc_LineTraceSingle_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Location, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactPoint, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Normal, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceStart, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceEnd, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_NotEqual_ObjectObject_ReturnValue);
	void Set_Locked_On();
	void Setup_from_Owner(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, TScriptInterface<class IWithTeamInterface> K2Node_DynamicCast_AsWith_Team_Interface, bool K2Node_DynamicCast_bSuccess, class AValCharacter* K2Node_DynamicCast_AsVal_Character, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute, float CallFunc_GetFloatAttribute_ReturnValue, bool CallFunc_GetTeamFromObject_bHasATeam, int32 CallFunc_GetTeamFromObject_TeamId, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_AssignTagSetByCallerMagnitude_ReturnValue, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue, double CallFunc_Subtract_DoubleDouble_A_ImplicitCast, float CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast);
	void UpdateTargeted(class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, bool CallFunc_RemoveActiveGameplayEffect_ReturnValue, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_AssignTagSetByCallerMagnitude_ReturnValue, bool CallFunc_IsCybrid_ReturnValue, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue_1, class ABP_ValChar_Master_C* CallFunc_Array_Get_Item, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1, bool CallFunc_NotEqual_ObjectObject_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue);
	void AddDetectionCue(const struct GameplayAbilities_GameplayCueParameters& CallFunc_MakeGameplayCueParameters_ReturnValue);
	struct CoreUObject_Vector GetMuzzleFireLocation(const struct CoreUObject_Vector& CallFunc_GetSocketLocation_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetSocketLocation_ReturnValue_1);
	void HasTarget(bool* HasTarget);
	void Set_Pitch(double Delta, const struct CoreUObject_Vector& CallFunc_K2_GetComponentLocation_ReturnValue, class ABP_ValChar_Master_C* CallFunc_Array_Get_Item, const struct CoreUObject_Vector& CallFunc_MakeVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetAITargetPoint_ReturnValue, const struct CoreUObject_Vector& CallFunc_Subtract_VectorVector_ReturnValue, const struct CoreUObject_Rotator& CallFunc_MakeRotFromYX_ReturnValue, const struct CoreUObject_Rotator& CallFunc_RInterpTo_ReturnValue, float CallFunc_RInterpTo_DeltaTime_ImplicitCast);
	void Set_Yaw(double Delta, const struct CoreUObject_Rotator& CallFunc_K2_GetActorRotation_ReturnValue, const struct CoreUObject_Vector& CallFunc_MakeVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetComponentLocation_ReturnValue, class ABP_ValChar_Master_C* CallFunc_Array_Get_Item, const struct CoreUObject_Vector& CallFunc_GetAITargetPoint_ReturnValue, const struct CoreUObject_Vector& CallFunc_Subtract_VectorVector_ReturnValue, const struct CoreUObject_Rotator& CallFunc_MakeRotFromZX_ReturnValue, const struct CoreUObject_Rotator& CallFunc_RInterpTo_ReturnValue, bool CallFunc_K2_SetActorRotation_ReturnValue, float CallFunc_RInterpTo_DeltaTime_ImplicitCast, float CallFunc_RInterpTo_InterpSpeed_ImplicitCast);
	void ApplyEffects(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue, class UClass* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1);
	void SearchForTargets(const TArray<class ABP_ValChar_Master_C*>& NewTargets, bool CallFunc_HasAuthority_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<enum class EObjectTypeQuery>& K2Node_MakeArray_Array, int32 Temp_int_Array_Index_Variable, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute, float CallFunc_GetFloatAttribute_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, TArray<class AActor*>& K2Node_MakeArray_Array_1, const struct CoreUObject_Vector& CallFunc_K2_GetComponentLocation_ReturnValue, TArray<class AActor*>& CallFunc_SphereOverlapActors_OutActors, bool CallFunc_SphereOverlapActors_ReturnValue, bool CallFunc_Array_Identical_ReturnValue, class AActor* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue_1, class ABP_ValChar_Master_C* K2Node_DynamicCast_AsBP_Val_Char_Master, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsCybrid_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput, bool CallFunc_HasMatchingGameplayTag_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_IsBlocked_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, class ABP_ValChar_Turret_Master_C* K2Node_DynamicCast_AsBP_Val_Char_Turret_Master, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsEnemyWith_ReturnValue, bool CallFunc_ObjectHasTeam_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast, float CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast);
	bool GetAimForTargetData(struct CoreUObject_Vector* AimValue, const struct CoreUObject_Vector& CallFunc_GetMuzzleFireLocation_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class ABP_ValChar_Master_C* CallFunc_Array_Get_Item, const struct CoreUObject_Vector& CallFunc_GetAITargetPoint_ReturnValue, const struct CoreUObject_Vector& CallFunc_Subtract_VectorVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetForwardVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_Normal_ReturnValue);
	void Set_Wait();
	void OnArmed();
	void UpdateMesh(class USkeletalMesh* InMesh, class UClass* ABPClass, bool CallFunc_IsValidClass_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void OnTagRemoved_054197AD4EA4646C223C278052496FB0(const struct GameplayTags_GameplayTag& Tag);
	void OnTagAdded_054197AD4EA4646C223C278052496FB0(const struct GameplayTags_GameplayTag& Tag);
	void OnTagRemoved_CF500B9741F98D09DF1110A018360FE1(const struct GameplayTags_GameplayTag& Tag);
	void OnTagAdded_CF500B9741F98D09DF1110A018360FE1(const struct GameplayTags_GameplayTag& Tag);
	void ReceiveBeginPlay();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveTick(float DeltaSeconds);
	void EventDied();
	void ReceiveDestroyed();
	void OnOwnerTeamChanged(int32 OldTeamId, int32 NewTeamId);
	void RevealStatusChanged3P(bool bValue);
	void AddScanner(int32 Amount);
	void SelfDestruct();
	void AddOnTeamChangedDelegate(FDelegateProperty_& Delegate);
	void RemoveAllOnTeamChangedDelegates();
	void RemoveOnTeamChangedDelegate(FDelegateProperty_& Delegate);
	void OnPlayerStateUpdatedEvent();
	void ExecuteUbergraph_BP_ValChar_Turret_Master(int32 EntryPoint, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, bool CallFunc_HasAuthority_ReturnValue, class AActor* K2Node_Event_OtherActor, float K2Node_Event_DeltaSeconds, const struct Engine_TimerHandle& CallFunc_K2_SetTimer_ReturnValue, const struct Engine_TimerHandle& CallFunc_K2_SetTimer_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class ABP_ValChar_Master_C* CallFunc_Array_Get_Item, bool CallFunc_IsAlive_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class UValAttributeSet* CallFunc_GetAttributes_ReturnValue, int32 K2Node_CustomEvent_OldTeamId, int32 K2Node_CustomEvent_NewTeamId, const struct Engine_TimerHandle& CallFunc_K2_SetTimer_ReturnValue_2, bool CallFunc_NotEqual_IntInt_ReturnValue, const struct Engine_TimerHandle& CallFunc_K2_SetTimer_ReturnValue_3, const struct GameplayTags_GameplayTag& CallFunc_MakeLiteralGameplayTag_ReturnValue, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_Tag_3, bool CallFunc_Not_PreBool_ReturnValue_1, class UValAT_GameplayTagAddedRemoved* CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, const struct GameplayTags_GameplayTag& Temp_struct_Variable, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_Tag, class UValAT_GameplayTagAddedRemoved* CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue_1, float CallFunc_ApplyDamage_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, bool K2Node_Event_bValue, int32 K2Node_Event_Amount, int32 CallFunc_Add_IntInt_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, int32 CallFunc_Clamp_ReturnValue, const struct CoreUObject_Vector& CallFunc_K2_GetActorLocation_ReturnValue, TArray<enum class EObjectTypeQuery>& K2Node_MakeArray_Array, TArray<class AActor*>& K2Node_MakeArray_Array_1, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Variable, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_Tag_1, int32 CallFunc_Percent_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue_2, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_AssignTagSetByCallerMagnitude_ReturnValue, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_RemoveActiveGameplayEffect_ReturnValue, bool CallFunc_GetTeamFromObject_bHasATeam, int32 CallFunc_GetTeamFromObject_TeamId, bool CallFunc_GetTeamFromObject_bHasATeam_1, int32 CallFunc_GetTeamFromObject_TeamId_1, FDelegateProperty_ K2Node_Event_Delegate_1, FDelegateProperty_ K2Node_Event_Delegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, const struct GameplayTags_GameplayTag& Temp_struct_Variable_1, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_Tag_2, class APawn* CallFunc_GetInstigator_ReturnValue, class AValCharacter* K2Node_DynamicCast_AsVal_Character, bool K2Node_DynamicCast_bSuccess, TScriptInterface<class IWithTeamInterface> CallFunc_GetTeamId_self_CastInput, int32 CallFunc_GetTeamId_ReturnValue, class AValPlayerState* K2Node_DynamicCast_AsVal_Player_State, bool K2Node_DynamicCast_bSuccess_1, TScriptInterface<class IWithTeamInterface> CallFunc_SetTeamId_self_CastInput, TScriptInterface<class IWithTeamInterface> K2Node_DynamicCast_AsWith_Team_Interface, bool K2Node_DynamicCast_bSuccess_2, TScriptInterface<class IWithTeamInterface> K2Node_DynamicCast_AsWith_Team_Interface_1, bool K2Node_DynamicCast_bSuccess_3, TScriptInterface<class IWithTeamInterface> K2Node_DynamicCast_AsWith_Team_Interface_2, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute, float CallFunc_GetFloatAttribute_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, TArray<class AActor*>& CallFunc_SphereOverlapActors_OutActors, bool CallFunc_SphereOverlapActors_ReturnValue, TScriptInterface<class IWithTeamInterface> K2Node_DynamicCast_AsWith_Team_Interface_3, bool K2Node_DynamicCast_bSuccess_5, class AActor* CallFunc_Array_Get_Item_1, const struct GameplayAbilities_GameplayAbilityTargetDataHandle& CallFunc_AbilityTargetDataFromActor_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, TArray<struct GameplayAbilities_ActiveGameplayEffectHandle>& CallFunc_ApplyExternalEffectSpec_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, class ABP_ValChar_Master_C* K2Node_DynamicCast_AsBP_Val_Char_Master, bool K2Node_DynamicCast_bSuccess_6, bool CallFunc_TryActivateAbilityByClass_ReturnValue, double CallFunc_Set_Yaw_Delta_ImplicitCast, double CallFunc_Set_Pitch_Delta_ImplicitCast, float CallFunc_K2_SetTimer_Time_ImplicitCast, float CallFunc_K2_SetTimer_Time_ImplicitCast_1, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast, float CallFunc_SphereOverlapActors_SphereRadius_ImplicitCast);
};

}


