#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x158 (0x780 - 0x628)
// BlueprintGeneratedClass GA_Deployable.GA_Deployable_C
class UGA_Deployable_C : public UValAbilitySwappable
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x628(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class APlacement_Visual_C*                   PreviewActor;                                      // 0x630(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UValDeployableAudioVisual*             DeployableAudioVisual;                             // 0x638(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitConfirmCancel*        ConfirmTask;                                       // 0x640(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       SlowdownPercent;                                   // 0x648(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       PlaceTime;                                         // 0x650(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SpawnTimeOffset;                                   // 0x658(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                        EffectsToApply;                                    // 0x660(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	enum class EValOwnedSpawnType                SpawnType;                                         // 0x670(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_9FC[0x7];                                      // Fixing Size After Last Property  
	double                                       Range;                                             // 0x678(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       PlaceableDistance;                                 // 0x680(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          SuccessfulThrowMontage1P;                          // 0x688(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                AsyncTask;                                         // 0x690(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct GameplayAbilities_GameplayEffectSpecHandle> EffectsToApplyToObjects;                           // 0x698(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        ApplyCooldownDelay;                                // 0x6A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A02[0x4];                                      // Fixing Size After Last Property  
	class UAbilityTask_WaitDelay*                AsyncTask_ApplyCooldownDelay;                      // 0x6B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         CanUsePreview;                                     // 0x6B8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A06[0x7];                                      // Fixing Size After Last Property  
	struct CoreUObject_Transform                 PreviewTransform;                                  // 0x6C0(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValAT_ServerWaitForClientTargetData*  WaitForTargetDataTask;                             // 0x720(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_Vector                    PlacementVisualScale;                              // 0x728(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MinPlacementDistanceOverride;                      // 0x740(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MaxVerticalPlacementDistance;                      // 0x748(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AllowDestructionDelay;                             // 0x750(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CachedLastDeployTime;                              // 0x758(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsUsingPreview;                                    // 0x760(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NoPlacementValidation;                             // 0x761(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AlwaysUsePreview;                                  // 0x762(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A11[0x5];                                      // Fixing Size After Last Property  
	struct CoreUObject_Vector                    CachedStartPoint;                                  // 0x768(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UGA_Deployable_C* GetDefaultObj();

	float GetAbilityProjectileSpeed(float Value);
	float GetAbilityCastTime();
	float GetAbilityCooldownModifier();
	float GetAbilityDeployTime(float K2Node_FunctionResult_ReturnValue_ImplicitCast);
	float GetAbilityDuration();
	TArray<TSubclassOf<class UGameplayEffect>> GetAbilityEffectsToApply();
	float GetAbilityRange(float K2Node_FunctionResult_ReturnValue_ImplicitCast);
	void GetDeploySpawnTime(double* Time, double CallFunc_Add_DoubleDouble_ReturnValue);
	void GetDeployAnimationTime(double* Time);
	void ValActivationFailed(const struct GameplayAbilities_GameplayAbilitySpecHandle& Handle, struct GameplayTags_GameplayTagContainer& FailureReason, bool CallFunc_HasTag_ReturnValue, double CallFunc_GetGameTimeInSeconds_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void SpawnDeployable(bool UsePreviewTransform, const struct CoreUObject_Transform& PreviewTransform, class AActor** Spawned);
	void GetMeshSphereRadius(double* SphereRadius, bool CallFunc_IsValid_ReturnValue, const struct CoreUObject_BoxSphereBounds& CallFunc_GetBounds_ReturnValue, const struct CoreUObject_Vector& CallFunc_BreakBoxSphereBounds_Origin, const struct CoreUObject_Vector& CallFunc_BreakBoxSphereBounds_BoxExtent, float CallFunc_BreakBoxSphereBounds_SphereRadius, double K2Node_FunctionResult_SphereRadius_ImplicitCast);
	void OnFinish_F326A9964C907A33A1B4C6B38BB727ED();
	void OnFinish_E1B3CCCF4110A616AB32C9AD13AFA948();
	void OnFinish_51E92FF44496AE7D22C6669067945FD4();
	void OnCancel_4BDDF3654349A15B72836EBE3E4499BD();
	void OnConfirm_4BDDF3654349A15B72836EBE3E4499BD();
	void ValidData_4E129F58445E7CD787F23F8484D65419(struct GameplayAbilities_GameplayAbilityTargetDataHandle& Data);
	void SetAbilityCastTime(float Value);
	void SetAbilityDuration(float Value);
	void SetAbilityProjectileSpeed(float Value);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled, bool bWasRetriggered);
	void SetAbilityDeployTime(float Value);
	void AddAbilityEffectToApply(TSubclassOf<class UGameplayEffect> Value);
	void SetAbilityRange(float Value);
	void ExecuteUbergraph_GA_Deployable(int32 EntryPoint, class UValAT_ServerWaitForClientTargetData* CallFunc_ServerWaitForClientTargetData_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, TArray<struct Engine_HitResult>& K2Node_MakeArray_Array, const struct GameplayAbilities_GameplayAbilityTargetDataHandle& CallFunc_MakeGameplayAbilityTargetDataHandleFromHitResults_ReturnValue, const struct GameplayAbilities_GameplayAbilityTargetDataHandle& Temp_struct_Variable, const struct Engine_HitResult& CallFunc_GetHitResultFromTargetData_ReturnValue, const struct GameplayAbilities_GameplayAbilityTargetDataHandle& K2Node_CustomEvent_Data, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Location, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactPoint, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Normal, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceStart, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceEnd, bool CallFunc_IsValid_ReturnValue_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, double CallFunc_GetMeshSphereRadius_SphereRadius, const struct CoreUObject_Vector& CallFunc_GetActorEyesViewPoint_OutLocation, const struct CoreUObject_Rotator& CallFunc_GetActorEyesViewPoint_OutRotation, double CallFunc_Multiply_DoubleDouble_ReturnValue, const struct CoreUObject_Vector& CallFunc_MakeVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_GetForwardVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct CoreUObject_Vector& CallFunc_Add_VectorVector_ReturnValue, const struct CoreUObject_Vector& CallFunc_Add_VectorVector_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_4, const struct CoreUObject_Vector& CallFunc_GetActorEyesViewPoint_OutLocation_1, const struct CoreUObject_Rotator& CallFunc_GetActorEyesViewPoint_OutRotation_1, const struct CoreUObject_Vector& CallFunc_BreakTransform_Location, const struct CoreUObject_Rotator& CallFunc_BreakTransform_Rotation, const struct CoreUObject_Vector& CallFunc_BreakTransform_Scale, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_IsValid_ReturnValue_5, bool CallFunc_IsValid_ReturnValue_6, bool CallFunc_IsValid_ReturnValue_7, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct CoreUObject_Vector& CallFunc_GetMuzzleFireLocation_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, const struct CoreUObject_Transform& CallFunc_MakeTransform_ReturnValue, class APawn* CallFunc_K2_GetPawn_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class APlacement_Visual_C* CallFunc_FinishSpawningActor_ReturnValue, class UAbilityTask_WaitConfirmCancel* CallFunc_WaitConfirmCancel_ReturnValue, bool CallFunc_IsValid_ReturnValue_8, bool CallFunc_Greater_DoubleDouble_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, bool CallFunc_K2_HasAuthority_ReturnValue, class AValCharacter* K2Node_DynamicCast_AsVal_Character, bool K2Node_DynamicCast_bSuccess, class UValAttributeSet* CallFunc_GetAttributes_ReturnValue, int32 Temp_int_Array_Index_Variable, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_AssignTagSetByCallerMagnitude_ReturnValue, bool CallFunc_IsStandalone_ReturnValue, bool CallFunc_IsValid_ReturnValue_9, class AActor* CallFunc_SpawnDeployable_Spawned, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue, bool CallFunc_IsValid_ReturnValue_10, TScriptInterface<class IValDeployable> K2Node_DynamicCast_AsVal_Deployable, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue_11, class UAbilitySystemComponent* CallFunc_GetASC_ReturnValue, bool CallFunc_IsValid_ReturnValue_12, double CallFunc_GetDeployAnimationTime_Time, class UAbilityTask_WaitDelay* CallFunc_WaitDelay_ReturnValue, bool CallFunc_IsValid_ReturnValue_13, double CallFunc_GetDeployAnimationTime_Time_1, double CallFunc_GetDeploySpawnTime_Time, class UAbilityTask_WaitDelay* CallFunc_WaitDelay_ReturnValue_1, double CallFunc_GetDeploySpawnTime_Time_1, class UAbilityTask_WaitDelay* CallFunc_WaitDelay_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_14, bool CallFunc_IsValid_ReturnValue_15, float K2Node_Event_Value_5, float K2Node_Event_Value_4, float K2Node_Event_Value_3, bool K2Node_Event_bWasCancelled, bool K2Node_Event_bWasRetriggered, bool CallFunc_IsValid_ReturnValue_16, bool CallFunc_K2_CommitAbility_ReturnValue, float K2Node_Event_Value_2, TSubclassOf<class UGameplayEffect> K2Node_Event_Value_1, float K2Node_Event_Value, int32 CallFunc_Array_AddUnique_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class AActor*>& Temp_object_Variable, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_Array_Get_Item, const struct Engine_HitResult& CallFunc_LineTraceSingleByProfile_OutHit, bool CallFunc_LineTraceSingleByProfile_ReturnValue, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue_1, bool CallFunc_BreakHitResult_bBlockingHit_1, bool CallFunc_BreakHitResult_bInitialOverlap_1, float CallFunc_BreakHitResult_Time_1, float CallFunc_BreakHitResult_Distance_1, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Location_1, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactPoint_1, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Normal_1, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactNormal_1, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_1, class AActor* CallFunc_BreakHitResult_HitActor_1, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_1, class FName CallFunc_BreakHitResult_HitBoneName_1, class FName CallFunc_BreakHitResult_BoneName_1, int32 CallFunc_BreakHitResult_HitItem_1, int32 CallFunc_BreakHitResult_ElementIndex_1, int32 CallFunc_BreakHitResult_FaceIndex_1, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceStart_1, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceEnd_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_LessEqual_DoubleDouble_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, TArray<class AActor*>& Temp_object_Variable_1, const struct Engine_HitResult& CallFunc_SphereTraceSingleByProfile_OutHit, bool CallFunc_SphereTraceSingleByProfile_ReturnValue, const struct CoreUObject_Rotator& CallFunc_K2_GetActorRotation_ReturnValue, TArray<struct Engine_HitResult>& K2Node_MakeArray_Array_1, const struct CoreUObject_Transform& CallFunc_MakeTransform_ReturnValue_1, const struct GameplayAbilities_GameplayAbilityTargetDataHandle& CallFunc_MakeGameplayAbilityTargetDataHandleFromHitResults_ReturnValue_1, bool CallFunc_BreakHitResult_bBlockingHit_2, bool CallFunc_BreakHitResult_bInitialOverlap_2, float CallFunc_BreakHitResult_Time_2, float CallFunc_BreakHitResult_Distance_2, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Location_2, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactPoint_2, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Normal_2, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactNormal_2, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_2, class AActor* CallFunc_BreakHitResult_HitActor_2, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_2, class FName CallFunc_BreakHitResult_HitBoneName_2, class FName CallFunc_BreakHitResult_BoneName_2, int32 CallFunc_BreakHitResult_HitItem_2, int32 CallFunc_BreakHitResult_ElementIndex_2, int32 CallFunc_BreakHitResult_FaceIndex_2, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceStart_2, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceEnd_2, enum class ECollisionChannel CallFunc_GetCollisionObjectType_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, TArray<class AActor*>& Temp_object_Variable_2, const struct Engine_HitResult& CallFunc_SphereTraceSingleByProfile_OutHit_1, bool CallFunc_SphereTraceSingleByProfile_ReturnValue_1, TArray<struct Engine_HitResult>& K2Node_MakeArray_Array_2, const struct GameplayAbilities_GameplayAbilityTargetDataHandle& CallFunc_MakeGameplayAbilityTargetDataHandleFromHitResults_ReturnValue_2, TArray<struct Engine_HitResult>& K2Node_MakeArray_Array_3, const struct GameplayAbilities_GameplayAbilityTargetDataHandle& CallFunc_MakeGameplayAbilityTargetDataHandleFromHitResults_ReturnValue_3, bool CallFunc_BreakHitResult_bBlockingHit_3, bool CallFunc_BreakHitResult_bInitialOverlap_3, float CallFunc_BreakHitResult_Time_3, float CallFunc_BreakHitResult_Distance_3, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Location_3, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactPoint_3, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Normal_3, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactNormal_3, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_3, class AActor* CallFunc_BreakHitResult_HitActor_3, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_3, class FName CallFunc_BreakHitResult_HitBoneName_3, class FName CallFunc_BreakHitResult_BoneName_3, int32 CallFunc_BreakHitResult_HitItem_3, int32 CallFunc_BreakHitResult_ElementIndex_3, int32 CallFunc_BreakHitResult_FaceIndex_3, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceStart_3, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceEnd_3, enum class ECollisionChannel CallFunc_GetCollisionObjectType_ReturnValue_1, double CallFunc_Dot_VectorVector_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue_1, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_IsDedicatedServer_ReturnValue_1, const struct CoreUObject_Rotator& CallFunc_K2_GetActorRotation_ReturnValue_1, bool CallFunc_BreakHitResult_bBlockingHit_4, bool CallFunc_BreakHitResult_bInitialOverlap_4, float CallFunc_BreakHitResult_Time_4, float CallFunc_BreakHitResult_Distance_4, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Location_4, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactPoint_4, const struct CoreUObject_Vector& CallFunc_BreakHitResult_Normal_4, const struct CoreUObject_Vector& CallFunc_BreakHitResult_ImpactNormal_4, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_4, class AActor* CallFunc_BreakHitResult_HitActor_4, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_4, class FName CallFunc_BreakHitResult_HitBoneName_4, class FName CallFunc_BreakHitResult_BoneName_4, int32 CallFunc_BreakHitResult_HitItem_4, int32 CallFunc_BreakHitResult_ElementIndex_4, int32 CallFunc_BreakHitResult_FaceIndex_4, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceStart_4, const struct CoreUObject_Vector& CallFunc_BreakHitResult_TraceEnd_4, bool CallFunc_IsStandalone_ReturnValue_1, const struct CoreUObject_Transform& CallFunc_MakeTransform_ReturnValue_2, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_K2_HasAuthority_ReturnValue_1, class ABP_CharPlayer_C* K2Node_DynamicCast_AsBP_Char_Player, bool K2Node_DynamicCast_bSuccess_2, double CallFunc_GetGameTimeInSeconds_ReturnValue, class AValPlayerController* CallFunc_GetValPlayerController_ReturnValue, bool CallFunc_GetDeployablePreview_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue, float CallFunc_SphereTraceSingleByProfile_Radius_ImplicitCast, float CallFunc_PlayMontage_Duration_ImplicitCast, float CallFunc_WaitDelay_Time_ImplicitCast, float CallFunc_PlayMontage_Duration_ImplicitCast_1, float CallFunc_WaitDelay_Time_ImplicitCast_1, float CallFunc_WaitDelay_Time_ImplicitCast_2, double K2Node_VariableSet_PlaceTime_ImplicitCast, double K2Node_VariableSet_Range_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast, double CallFunc_LessEqual_DoubleDouble_A_ImplicitCast);
};

}


