#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x88 (0x6B0 - 0x628)
// BlueprintGeneratedClass GA_Gun_Master_Interact.GA_Gun_Master_Interact_C
class UGA_Gun_Master_Interact_C : public UValAbilitySwappable
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x628(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_ValChar_Master_C*                  CachedOwningChar;                                  // 0x630(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UValGameplayAbility*                   CachedSwappedFromAbility;                          // 0x638(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       CachedHolsterSpeed;                                // 0x640(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CachedDrawSpeed;                                   // 0x648(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValDevice*                            CachedSwappedToDevice;                             // 0x650(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         bSwappableInteract;                                // 0x658(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3140[0x7];                                     // Fixing Size After Last Property  
	double                                       ChannelTime;                                       // 0x660(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputRelease*         ChannelAsyncTask;                                  // 0x668(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct Engine_TimerHandle                    ChannelTimerHandle;                                // 0x670(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct GameplayAbilities_ActiveGameplayEffectHandle EffectHandle;                                      // 0x678(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct GameplayTags_GameplayTag              DefaultGameplayCueTag;                             // 0x680(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                CachedInteractable;                                // 0x688(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          Default1PAnim;                                     // 0x690(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct GameplayTags_GameplayTag              DefaultUnarmedTag;                                 // 0x698(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	enum class EInteractableTargetType           CachedInteractableType;                            // 0x6A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CachedInteractableCratePartiallyLooted;            // 0x6A1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3146[0x6];                                     // Fixing Size After Last Property  
	class UAbilityTask_WaitInputPress*           CancelInteractTask;                                // 0x6A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UGA_Gun_Master_Interact_C* GetDefaultObj();

	void CreateEffectSpec(struct GameplayAbilities_GameplayEffectSpecHandle* Spec_Handle, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_AddGrantedTag_ReturnValue);
	void Update_Channel_Time(double* Channel_Time, float Temp_real_Variable, TScriptInterface<class IValInteractable> K2Node_DynamicCast_AsVal_Interactable, bool K2Node_DynamicCast_bSuccess, float CallFunc_GetChannelTime_ReturnValue, double K2Node_FunctionResult_Channel_Time_ImplicitCast);
	bool K2_CanActivateAbility(const struct GameplayAbilities_GameplayAbilityActorInfo& ActorInfo, const struct GameplayAbilities_GameplayAbilitySpecHandle& Handle, struct GameplayTags_GameplayTagContainer* RelevantTags, class AValCharacter* K2Node_DynamicCast_AsVal_Character, bool K2Node_DynamicCast_bSuccess, class AActor* CallFunc_GetBestInteraction_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void PlayHolsterAnim(class USkeletalMeshComponent* CallFunc_GetGunMesh1P_ReturnValue, class USkeletalMeshComponent* CallFunc_GetMesh3P_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue_1, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance, bool K2Node_DynamicCast_bSuccess, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsDedicatedServer_ReturnValue, float CallFunc_PlayHolster_HolsterDuration_ImplicitCast, float CallFunc_PlayHolster_HolsterDuration_ImplicitCast_1);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled, bool bWasRetriggered);
	void StartInteract();
	void OnBestInteractionChanged(class AActor* Interactable);
	void ModifySwappable(class AValCharacter* Character);
	void ExecuteUbergraph_GA_Gun_Master_Interact(int32 EntryPoint, bool CallFunc_K2_HasAuthority_ReturnValue, bool CallFunc_IsValid_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, float CallFunc_GetNextDrawTime_ReturnValue, class UValDevice* CallFunc_GetPredictedInteractableAbility_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, float CallFunc_GetCurrentHolsterTime_ReturnValue, const struct GameplayAbilities_GameplayAbilitySpecHandle& CallFunc_GetActiveEquippedAbility_ReturnValue, class UValGameplayAbility* CallFunc_GetPrimaryAbilityInstanceFromHandle_ReturnValue, const struct Engine_TimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsPlayerBanned_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, const struct GameplayTags_GameplayTagContainer& Temp_struct_Variable, const struct GameplayTags_GameplayTagContainer& Temp_struct_Variable_1, bool Temp_bool_Variable, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class ABP_ValChar_Master_C* K2Node_DynamicCast_AsBP_Val_Char_Master, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue_4, TScriptInterface<class IValInteractable> K2Node_DynamicCast_AsVal_Interactable, bool K2Node_DynamicCast_bSuccess_1, enum class EInteractionFailureType CallFunc_GetBlockInteractReason_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class UValDeviceAudioVisual* CallFunc_GetAudioVisual_ReturnValue, const struct GameplayTags_GameplayTagContainer& Temp_struct_Variable_2, bool K2Node_Event_bWasCancelled, bool K2Node_Event_bWasRetriggered, const struct GameplayTags_GameplayTagContainer& Temp_struct_Variable_3, const struct GameplayTags_GameplayTagContainer& Temp_struct_Variable_4, bool CallFunc_BooleanAND_ReturnValue_1, const struct GameplayTags_GameplayTagContainer& Temp_struct_Variable_5, const struct GameplayTags_GameplayTagContainer& Temp_struct_Variable_6, class AActor* K2Node_CustomEvent_Interactable, const class FString& CallFunc_GetDisplayName_ReturnValue, bool CallFunc_IsAbilityActive_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, TScriptInterface<class IValInteractable> K2Node_DynamicCast_AsVal_Interactable_1, bool K2Node_DynamicCast_bSuccess_2, TScriptInterface<class IValInteractable> K2Node_DynamicCast_AsVal_Interactable_2, bool K2Node_DynamicCast_bSuccess_3, TScriptInterface<class IValInteractable> K2Node_DynamicCast_AsVal_Interactable_3, bool K2Node_DynamicCast_bSuccess_4, TScriptInterface<class IValInteractable> K2Node_DynamicCast_AsVal_Interactable_4, bool K2Node_DynamicCast_bSuccess_5, bool CallFunc_IsValid_ReturnValue_5, class ABP_DestructibleDoor_C* K2Node_DynamicCast_AsBP_Destructible_Door, bool K2Node_DynamicCast_bSuccess_6, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, enum class EInteractableTargetType Temp_byte_Variable, class AValBaseCrate* K2Node_DynamicCast_AsVal_Base_Crate, bool K2Node_DynamicCast_bSuccess_7, class UClass* CallFunc_GetObjectClass_ReturnValue, enum class ECrateState CallFunc_GetCurrentState_ReturnValue, bool CallFunc_ClassIsChildOf_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_ClassIsChildOf_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_ClassIsChildOf_ReturnValue_2, bool CallFunc_ClassIsChildOf_ReturnValue_3, bool CallFunc_ClassIsChildOf_ReturnValue_4, TScriptInterface<class IValInteractable> K2Node_DynamicCast_AsVal_Interactable_5, bool K2Node_DynamicCast_bSuccess_8, bool CallFunc_IsValid_ReturnValue_6, class AActor* CallFunc_GetBestInteraction_ReturnValue, bool CallFunc_IsValid_ReturnValue_7, TScriptInterface<class IValInteractable> K2Node_DynamicCast_AsVal_Interactable_6, bool K2Node_DynamicCast_bSuccess_9, bool CallFunc_ShowDeviceAudioVisual_ReturnValue, class USkeletalMeshComponent* CallFunc_GetGunMesh1P_ReturnValue, bool CallFunc_IsValid_ReturnValue_8, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, const struct GameplayAbilities_GameplayAbilitySpecHandle& CallFunc_GetActiveEquippedAbility_ReturnValue_1, class UValGameplayAbility* CallFunc_GetPrimaryAbilityInstanceFromHandle_ReturnValue_1, class UValDevice* K2Node_DynamicCast_AsVal_Device, bool K2Node_DynamicCast_bSuccess_10, bool CallFunc_IsValid_ReturnValue_9, class UValDeviceAudioVisual* CallFunc_GetAudioVisual_ReturnValue_1, bool CallFunc_ShowDeviceAudioVisual_ReturnValue_1, class AValCharacter* K2Node_Event_Character, bool CallFunc_IsValid_ReturnValue_10, float CallFunc_GetChannelTime_ReturnValue, float Temp_real_Variable, double CallFunc_GetTotalChannelTimeWithChanneler_ChannelTime, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, double CallFunc_Update_Channel_Time_Channel_Time, const struct GameplayAbilities_GameplayEffectSpecHandle& CallFunc_CreateEffectSpec_Spec_Handle, bool CallFunc_Greater_DoubleDouble_ReturnValue_2, const struct GameplayAbilities_ActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToSelfWithPrediction_ReturnValue, const struct GameplayTags_GameplayTagContainer& K2Node_Select_Default, bool CallFunc_K2_HasAuthority_ReturnValue_1, const struct GameplayTags_GameplayTagContainer& K2Node_Select_Default_1, const struct GameplayAbilities_GameplayCueParameters& CallFunc_MakeGameplayCueParameters_ReturnValue, bool CallFunc_K2_HasAuthority_ReturnValue_2, bool CallFunc_K2_HasAuthority_ReturnValue_3, double K2Node_VariableSet_CachedDrawSpeed_ImplicitCast, double K2Node_VariableSet_CachedHolsterSpeed_ImplicitCast, float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast, float CallFunc_Delay_Duration_ImplicitCast, float CallFunc_Delay_Duration_ImplicitCast_1, float CallFunc_MakeGameplayCueParameters_RawMagnitude_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast);
};

}


