#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xE0 (0x6E0 - 0x600)
// BlueprintGeneratedClass GA_Gun_Master_Swap.GA_Gun_Master_Swap_C
class UGA_Gun_Master_Swap_C : public UValGameplayAbility
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x600(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_ValChar_Master_C*                  OwningCharacter;                                   // 0x608(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UValGameplayAbility*                   SwappedFromAbility;                                // 0x610(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UValGameplayAbility*                   SwappedToAbility;                                  // 0x618(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       CurrHolsterSpeed;                                  // 0x620(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       NextDrawSpeed;                                     // 0x628(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_DateTime                  HolsterTimeStamp;                                  // 0x630(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       AdjustedHolster;                                   // 0x638(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsHolstering;                                     // 0x640(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_34DD[0x7];                                     // Fixing Size After Last Property  
	struct CoreUObject_DateTime                  DrawTimeStamp;                                     // 0x648(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       AdjustedDraw;                                      // 0x650(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsDrawing;                                        // 0x658(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_34E2[0x3];                                     // Fixing Size After Last Property  
	float                                        Latency;                                           // 0x65C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       NextHolsterSpeed;                                  // 0x660(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentDrawSpeed;                                  // 0x668(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct GameplayTags_GameplayTag              Holding;                                           // 0x670(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldCancelAnim;                                  // 0x678(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_34E8[0x7];                                     // Fixing Size After Last Property  
	double                                       ActiveAnimHolsterSpeed;                            // 0x680(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ActiveAnimDrawSpeed;                               // 0x688(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct GameplayTags_GameplayTag              Pending_Equip_Slot;                                // 0x690(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_DateTime                  PendingSwapTime;                                   // 0x698(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       InterruptTime;                                     // 0x6A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_NetworkSyncPoint*         PredictionTask;                                    // 0x6A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        RetriggerCount;                                    // 0x6B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_34F3[0x4];                                     // Fixing Size After Last Property  
	struct GameplayTags_GameplayTagContainer     SwapCancelSlotsToBind;                             // 0x6B8(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UValAT_GameplayTagAddedRemoved*        CachedListenAbilitiesTask;                         // 0x6D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UGA_Gun_Master_Swap_C* GetDefaultObj();

	void BindToAbilitiesActive(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UValAT_GameplayTagAddedRemoved* CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue);
	void Get_Draw_Time_Modifiers(double* OutPercentModifier, double* OutFlatModifier, double FlatModifier, double PercentModifier, bool CallFunc_IsValid_ReturnValue, const struct GameplayTags_GameplayTag& CallFunc_GetSwapEquipSlot_EquipSlot, float CallFunc_GetSwapTimeModifier_OutFlatModifier_ImplicitCast, float CallFunc_GetSwapTimeModifier_OutPercentModifier_ImplicitCast);
	void PlayDrawAnim(double TimeRemaining, class USkeletalMeshComponent* CallFunc_GetMesh3P_ReturnValue, bool CallFunc_IsValid_ReturnValue, class USkeletalMeshComponent* CallFunc_GetGunMesh1P_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance, bool K2Node_DynamicCast_bSuccess, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue_1, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance_1, bool K2Node_DynamicCast_bSuccess_1, float CallFunc_PlayDraw_DrawDuration_ImplicitCast, float CallFunc_PlayDraw_DrawDuration_ImplicitCast_1);
	void Get_Draw_Active_Time(double* ActiveTime, bool Temp_bool_Variable, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_NotEqual_DateTimeDateTime_ReturnValue, double K2Node_Select_Default, float CallFunc_GetTimeSinceDate_ReturnValue, double K2Node_FunctionResult_ActiveTime_ImplicitCast);
	void Get_Holster_Active_Time(double* ActiveTime, bool Temp_bool_Variable, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_NotEqual_DateTimeDateTime_ReturnValue, double K2Node_Select_Default, float CallFunc_GetTimeSinceDate_ReturnValue, double K2Node_FunctionResult_ActiveTime_ImplicitCast);
	void CancelAnims(const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue, class USkeletalMeshComponent* CallFunc_GetGunMesh1P_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance, bool K2Node_DynamicCast_bSuccess);
	void PlayConditionalDrawAnim(double TimeRemaining, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool Temp_bool_Variable, class USkeletalMeshComponent* CallFunc_GetMesh3P_ReturnValue, float K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance, bool K2Node_DynamicCast_bSuccess, class USkeletalMeshComponent* CallFunc_GetGunMesh1P_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance_1, bool K2Node_DynamicCast_bSuccess_1, float K2Node_Select_Option_1_ImplicitCast, float K2Node_Select_Option_0_ImplicitCast);
	void GetDrawTimeRemaining(double ElapsedTime, double* TimeRemaining, const struct CoreUObject_DateTime& CallFunc_UtcNow_ReturnValue, float CallFunc_GetTimeSinceDate_ReturnValue, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue, bool Temp_bool_Variable, bool CallFunc_NotEqual_DateTimeDateTime_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_LessEqual_DoubleDouble_ReturnValue, double K2Node_Select_Default, double K2Node_VariableSet_AdjustedDraw_ImplicitCast);
	void PlayConditionalHolsterAnim(double TimeRemaining, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool Temp_bool_Variable, class USkeletalMeshComponent* CallFunc_GetMesh3P_ReturnValue, float K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance, bool K2Node_DynamicCast_bSuccess, class USkeletalMeshComponent* CallFunc_GetGunMesh1P_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance_1, bool K2Node_DynamicCast_bSuccess_1, float K2Node_Select_Option_1_ImplicitCast, float K2Node_Select_Option_0_ImplicitCast);
	void PlayCancelDrawAnim(double TimeRemaning, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool Temp_bool_Variable, class USkeletalMeshComponent* CallFunc_GetMesh3P_ReturnValue, float K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance, bool K2Node_DynamicCast_bSuccess, class USkeletalMeshComponent* CallFunc_GetGunMesh1P_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance_1, bool K2Node_DynamicCast_bSuccess_1, float K2Node_Select_Option_1_ImplicitCast, float K2Node_Select_Option_0_ImplicitCast);
	bool HasSwapChainLooped(const struct GameplayTags_GameplayTag& CallFunc_GetSwapEquipSlot_EquipSlot, bool CallFunc_EqualEqual_GameplayTag_ReturnValue);
	void Get_Holster_Time_Remaining(double* TimeRemaining, const struct CoreUObject_DateTime& CallFunc_UtcNow_ReturnValue, float CallFunc_GetTimeSinceDate_ReturnValue, bool Temp_bool_Variable, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue, bool Temp_bool_Variable_1, bool CallFunc_NotEqual_DateTimeDateTime_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, double K2Node_Select_Default, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, double K2Node_Select_Default_1, double K2Node_VariableSet_AdjustedHolster_ImplicitCast);
	void PlayCancelHolsterAnim(double TimeRemaining, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool Temp_bool_Variable, class USkeletalMeshComponent* CallFunc_GetMesh3P_ReturnValue, float K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance, bool K2Node_DynamicCast_bSuccess, class USkeletalMeshComponent* CallFunc_GetGunMesh1P_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance_1, bool K2Node_DynamicCast_bSuccess_1, float K2Node_Select_Option_1_ImplicitCast, float K2Node_Select_Option_0_ImplicitCast);
	void PlayHolsterAnim(double TimeRemaining, class USkeletalMeshComponent* CallFunc_GetMesh3P_ReturnValue, bool CallFunc_IsValid_ReturnValue, class USkeletalMeshComponent* CallFunc_GetGunMesh1P_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance, bool K2Node_DynamicCast_bSuccess, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue_1, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance_1, bool K2Node_DynamicCast_bSuccess_1, float CallFunc_PlayHolster_HolsterDuration_ImplicitCast, float CallFunc_PlayHolster_HolsterDuration_ImplicitCast_1);
	void OnSync_8DE92E474564667F350D97BBADD3440F();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled, bool bWasRetriggered);
	void OnSlotRequested(struct GameplayTags_GameplayTag& SwapEquipSlot);
	void BeginPlay();
	void OnPendingDeviceRequested(struct GameplayTags_GameplayTag& PendingEquipSlot);
	void OnTagAdded(const struct GameplayTags_GameplayTag& Tag);
	void ExecuteUbergraph_GA_Gun_Master_Swap(int32 EntryPoint, bool CallFunc_HasSwapChainLooped_ReturnValue, const struct CoreUObject_DateTime& CallFunc_UtcNow_ReturnValue, const struct CoreUObject_DateTime& CallFunc_UtcNow_ReturnValue_1, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue, const struct CoreUObject_DateTime& CallFunc_UtcNow_ReturnValue_2, const struct CoreUObject_DateTime& CallFunc_UtcNow_ReturnValue_3, double CallFunc_Get_Draw_Active_Time_ActiveTime, float CallFunc_GetCurrentDrawTime_ReturnValue, float CallFunc_GetNextDrawTime_ReturnValue, const struct GameplayAbilities_GameplayAbilitySpecHandle& CallFunc_GetPredictedSwappedToAbility_ReturnValue, float CallFunc_GetNextHolsterTime_ReturnValue, float CallFunc_GetCurrentHolsterTime_ReturnValue, const struct GameplayAbilities_GameplayAbilitySpecHandle& CallFunc_GetActiveEquippedAbility_ReturnValue, double CallFunc_Get_Holster_Active_Time_ActiveTime, double CallFunc_Get_Draw_Active_Time_ActiveTime_1, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue_1, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue, class ABP_ValChar_Master_C* K2Node_DynamicCast_AsBP_Val_Char_Master, bool K2Node_DynamicCast_bSuccess, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue_2, class UValDevice* K2Node_DynamicCast_AsVal_Device, bool K2Node_DynamicCast_bSuccess_1, class UValDeviceAudioVisual* CallFunc_GetAudioVisual_ReturnValue, bool CallFunc_ShowDeviceAudioVisual_ReturnValue, const struct GameplayTags_GameplayTag& CallFunc_GetSwapEquipSlot_EquipSlot, bool K2Node_Event_bWasCancelled, bool K2Node_Event_bWasRetriggered, class USkeletalMeshComponent* CallFunc_GetGunMesh1P_ReturnValue, const struct GameplayAbilities_GameplayAbilitySpecHandle& CallFunc_GetActiveEquippedAbility_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, class UValGameplayAbility* CallFunc_GetPrimaryAbilityInstanceFromHandle_ReturnValue, class UValDevice* K2Node_DynamicCast_AsVal_Device_1, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_IsValid_ReturnValue_1, class UValDeviceAudioVisual* CallFunc_GetAudioVisual_ReturnValue_1, bool CallFunc_ShowDeviceAudioVisual_ReturnValue_1, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue_3, const struct CoreUObject_DateTime& CallFunc_UtcNow_ReturnValue_4, const struct CoreUObject_DateTime& CallFunc_UtcNow_ReturnValue_5, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_HasSwapChainLooped_ReturnValue_1, int32 Temp_int_Variable, bool CallFunc_IsDedicatedServer_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_SwapEquipSlot, const struct GameplayTags_GameplayTag& CallFunc_GetActiveEquipSlotTag_ReturnValue, const struct CoreUObject_DateTime& CallFunc_UtcNow_ReturnValue_6, const struct CoreUObject_DateTime& CallFunc_UtcNow_ReturnValue_7, double CallFunc_Get_Holster_Time_Remaining_TimeRemaining, double CallFunc_Get_Holster_Time_Remaining_TimeRemaining_1, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue_4, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue_5, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue_6, bool CallFunc_IsGameplayTagValid_ReturnValue, const struct GameplayTags_GameplayTag& CallFunc_GetActiveEquipSlotTag_ReturnValue_1, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue_7, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue_8, bool CallFunc_IsDedicatedServer_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_PendingEquipSlot, class AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1, class AValCharacter* K2Node_DynamicCast_AsVal_Character, bool K2Node_DynamicCast_bSuccess_3, const struct CoreUObject_DateTime& CallFunc_UtcNow_ReturnValue_8, bool CallFunc_EqualEqual_GameplayTag_ReturnValue, float CallFunc_GetTimeSinceDate_ReturnValue, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue_9, bool CallFunc_SwapDevice_ReturnValue, bool CallFunc_NotEqual_DateTimeDateTime_ReturnValue, float CallFunc_GetCurrentHolsterTime_ReturnValue_1, class AValPlayerController* CallFunc_GetValPlayerController_ReturnValue, float CallFunc_GetPredictionTime_ReturnValue, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute, float CallFunc_GetFloatAttribute_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, double CallFunc_SelectFloat_ReturnValue, float CallFunc_GetTimeSinceDate_ReturnValue_1, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1, float CallFunc_GetFloatAttribute_ReturnValue_1, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue_10, double CallFunc_SelectFloat_ReturnValue_1, bool CallFunc_NotEqual_DateTimeDateTime_ReturnValue_1, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2, float CallFunc_GetFloatAttribute_ReturnValue_2, double CallFunc_SelectFloat_ReturnValue_2, double CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue_1, double CallFunc_Add_DoubleDouble_ReturnValue_2, const struct CoreUObject_DateTime& CallFunc_DateTimeMinValue_ReturnValue_11, double CallFunc_Get_Draw_Time_Modifiers_OutPercentModifier, double CallFunc_Get_Draw_Time_Modifiers_OutFlatModifier, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3, float CallFunc_GetFloatAttribute_ReturnValue_3, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_SelectFloat_ReturnValue_3, double CallFunc_Add_DoubleDouble_ReturnValue_3, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue_4, double CallFunc_Divide_DoubleDouble_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, double CallFunc_Add_DoubleDouble_ReturnValue_5, double CallFunc_Multiply_DoubleDouble_ReturnValue_3, double CallFunc_Divide_DoubleDouble_ReturnValue_2, double CallFunc_Add_DoubleDouble_ReturnValue_6, double CallFunc_Divide_DoubleDouble_ReturnValue_3, bool CallFunc_LessEqual_DoubleDouble_ReturnValue, bool CallFunc_LessEqual_DoubleDouble_ReturnValue_1, bool CallFunc_IsStandalone_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, double CallFunc_Get_Draw_Time_Modifiers_OutPercentModifier_1, double CallFunc_Get_Draw_Time_Modifiers_OutFlatModifier_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_4, double CallFunc_Add_DoubleDouble_ReturnValue_7, class UValGameplayAbility* CallFunc_GetPrimaryAbilityInstanceFromHandle_ReturnValue_1, bool CallFunc_LessEqual_DoubleDouble_ReturnValue_2, class UValGameplayAbility* CallFunc_GetPrimaryAbilityInstanceFromHandle_ReturnValue_2, class UAbilityTask_NetworkSyncPoint* CallFunc_WaitNetSync_ReturnValue, bool CallFunc_IsValid_ReturnValue_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_IsValid_ReturnValue_5, bool CallFunc_IsValid_ReturnValue_6, bool CallFunc_IsValid_ReturnValue_7, const struct GameplayTags_GameplayTag& CallFunc_MakeLiteralGameplayTag_ReturnValue, const struct GameplayTags_GameplayTag& CallFunc_MakeLiteralGameplayTag_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, const struct GameplayTags_GameplayTag& CallFunc_MakeLiteralGameplayTag_ReturnValue_2, int32 CallFunc_GetGameplayTagCount_ReturnValue, bool CallFunc_IsGameplayTagValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_8, class UGameplayAbility* CallFunc_GetActiveSwappedAbility_ReturnValue, bool CallFunc_IsValid_ReturnValue_9, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_Tag, bool CallFunc_IsValid_ReturnValue_10, float CallFunc_ServerSetSwappingInfo_DrawTime_ImplicitCast, float CallFunc_RetriggerableDelay_Duration_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3, float CallFunc_RetriggerableDelay_Duration_ImplicitCast_1, float CallFunc_RetriggerableDelay_Duration_ImplicitCast_2, float CallFunc_RetriggerableDelay_Duration_ImplicitCast_3, float CallFunc_RetriggerableDelay_Duration_ImplicitCast_4, double CallFunc_Add_DoubleDouble_A_ImplicitCast, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast, double CallFunc_Add_DoubleDouble_B_ImplicitCast, double CallFunc_SelectFloat_A_ImplicitCast, double CallFunc_Add_DoubleDouble_A_ImplicitCast_1, double CallFunc_SelectFloat_A_ImplicitCast_1, double CallFunc_SelectFloat_A_ImplicitCast_2, double CallFunc_SelectFloat_A_ImplicitCast_3, float CallFunc_RetriggerableDelay_Duration_ImplicitCast_5, float CallFunc_ServerSetSwappingInfo_HolsterTime_ImplicitCast);
};

}


