#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x12D (0x77D - 0x650)
// BlueprintGeneratedClass GA_Gun_Master.GA_Gun_Master_C
class UGA_Gun_Master_C : public UValDevice
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x650(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_ValChar_Master_C*                  SourceCharacter;                                   // 0x658(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGA_Gun_Master_Instant_C*              InstantAbility;                                    // 0x660(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct GameplayAbilities_GameplayAbilitySpecHandle InstantAbilityHandle;                              // 0x668(0x4)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A68[0x4];                                     // Fixing Size After Last Property  
	class UClass*                                InstantAbilityClass;                               // 0x670(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        BurstCount;                                        // 0x678(0x4)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A6B[0x4];                                     // Fixing Size After Last Property  
	double                                       TimeBetweenShots;                                  // 0x680(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct GameplayTags_GameplayTag              FireMode;                                          // 0x688(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       TimeOfLastBurst;                                   // 0x690(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       StartTime;                                         // 0x698(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MagEmptyingSoundStart;                             // 0x6A0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct GameplayTags_GameplayTag              WeaponType;                                        // 0x6A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       MeleeStrikeTimePercentage;                         // 0x6B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnProjectileMiss_Delegate;                         // 0x6B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         bPendingReload;                                    // 0x6C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A73[0x7];                                     // Fixing Size After Last Property  
	struct Engine_TimerHandle                    AIShootTimerHandle;                                // 0x6D0(0x8)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       TimeBetweenBursts;                                 // 0x6D8(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct GameplayTags_GameplayTagContainer     BlockSwapTag;                                      // 0x6E0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	double                                       InputBufferTime;                                   // 0x700(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ListeningForInput;                                 // 0x708(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A79[0x7];                                     // Fixing Size After Last Property  
	struct Engine_TimerHandle                    BufferDelayTimer;                                  // 0x710(0x8)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         InputBuffered;                                     // 0x718(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bRemoveADSWhenShoot;                               // 0x719(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A7D[0x6];                                     // Fixing Size After Last Property  
	struct GameplayTags_GameplayTagContainer     AimRemovalTag;                                     // 0x720(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                         bUseBuildUp;                                       // 0x740(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A7F[0x7];                                     // Fixing Size After Last Property  
	double                                       BuildUpTime;                                       // 0x748(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       BuildUpTick;                                       // 0x750(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bBuildUpResets;                                    // 0x758(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bBuildUpIncrease;                                  // 0x759(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A82[0x6];                                     // Fixing Size After Last Property  
	double                                       CurrentBuildUp;                                    // 0x760(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       PrefireTime;                                       // 0x768(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bAutoFire;                                         // 0x770(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bAggroSkip;                                        // 0x771(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bBuildUpGameQueueActive;                           // 0x772(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bAimCompletesBuildUp;                              // 0x773(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsPrefiring;                                      // 0x774(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A87[0x3];                                     // Fixing Size After Last Property  
	int32                                        CurrentBurstCount;                                 // 0x778(0x4)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bShouldAutoReload;                                 // 0x77C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UGA_Gun_Master_C* GetDefaultObj();

	void OnThirdPerson(bool Value);
	void SetPendingReload(bool Value);
	double GetRemainingBuildUp(double CallFunc_Subtract_DoubleDouble_ReturnValue);
	int32 GetMirrorShotCount(bool CallFunc_IsValid_ReturnValue, int32 CallFunc_GetMuzzleSocketCount_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue);
	void BindTargetUpdated(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, bool CallFunc_IsBotControlled_ReturnValue);
	void GetBurstCount(int32* BurstCount);
	void GetTimeBetweenBursts(double* TimeBetweenBursts);
	void ResetSprint();
