#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x94 (0x748 - 0x6B4)
// BlueprintGeneratedClass GA_Reload_Progressive.GA_Reload_Progressive_C
class UGA_Reload_Progressive_C : public UGA_Gun_Master_Reload_C
{
public:
	uint8                                        Pad_426C[0x4];                                     // Fixing Size After Last Property  
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x6B8(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                        NumBulletsNeeded;                                  // 0x6C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_426F[0x4];                                     // Fixing Size After Last Property  
	class USkeletalMeshComponent*                OnePGunMesh;                                       // 0x6C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                ThreePGun_Mesh;                                    // 0x6D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UValDeviceAudioVisual*                 AV_Gun;                                            // 0x6D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UValAT_GameplayTagAddedRemoved*        ListenAsyncTask;                                   // 0x6E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        SoundHandle;                                       // 0x6E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_427D[0x4];                                     // Fixing Size After Last Property  
	double                                       UnadjustedOneBulletTime;                           // 0x6F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AnimRate;                                          // 0x6F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  EndSectionName;                                    // 0x700(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValAT_PlayMontageForMeshAndWait*      Montage3PTask;                                     // 0x708(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UValAT_PlayMontageForMeshAndWait*      Montage1PTask;                                     // 0x710(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct Engine_TimerHandle                    BulletTimer;                                       // 0x718(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct GameplayTags_GameplayTagContainer     DefaultSlotsToBind;                                // 0x720(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UValAT_GameplayTagAddedRemoved*        CachedListenAbilitiesTask;                         // 0x740(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UGA_Reload_Progressive_C* GetDefaultObj();

	void BindToAbilitiesActive(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue, class UValAT_GameplayTagAddedRemoved* CallFunc_ListenForGameplayTagAddedOrRemoved_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void AddBullet(bool LocalMasteryActivated, bool CallFunc_LessEqual_IntInt_ReturnValue, bool CallFunc_TryActivateMastery_Activate, double CallFunc_SelectFloat_ReturnValue, class USkeletalMeshComponent* CallFunc_GetMesh3P_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, float CallFunc_AddClipAndReserveAmmo_ReserveAmount_ImplicitCast);
	void EventReceived_390090B640ED8DEEF0E727A52330A668(const struct GameplayTags_GameplayTag& EventTag, const struct GameplayAbilities_GameplayEventData& EventData);
	void OnCancelled_390090B640ED8DEEF0E727A52330A668(const struct GameplayTags_GameplayTag& EventTag, const struct GameplayAbilities_GameplayEventData& EventData);
	void OnInterrupted_390090B640ED8DEEF0E727A52330A668(const struct GameplayTags_GameplayTag& EventTag, const struct GameplayAbilities_GameplayEventData& EventData);
	void OnBlendOut_390090B640ED8DEEF0E727A52330A668(const struct GameplayTags_GameplayTag& EventTag, const struct GameplayAbilities_GameplayEventData& EventData);
	void OnCompleted_390090B640ED8DEEF0E727A52330A668(const struct GameplayTags_GameplayTag& EventTag, const struct GameplayAbilities_GameplayEventData& EventData);
	void EventReceived_981CF2C14EBEB67D691489BC10F62E46(const struct GameplayTags_GameplayTag& EventTag, const struct GameplayAbilities_GameplayEventData& EventData);
	void OnCancelled_981CF2C14EBEB67D691489BC10F62E46(const struct GameplayTags_GameplayTag& EventTag, const struct GameplayAbilities_GameplayEventData& EventData);
	void OnInterrupted_981CF2C14EBEB67D691489BC10F62E46(const struct GameplayTags_GameplayTag& EventTag, const struct GameplayAbilities_GameplayEventData& EventData);
	void OnBlendOut_981CF2C14EBEB67D691489BC10F62E46(const struct GameplayTags_GameplayTag& EventTag, const struct GameplayAbilities_GameplayEventData& EventData);
	void OnCompleted_981CF2C14EBEB67D691489BC10F62E46(const struct GameplayTags_GameplayTag& EventTag, const struct GameplayAbilities_GameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled, bool bWasRetriggered);
	void K2_ActivateAbility();
	void OnTagAdded(const struct GameplayTags_GameplayTag& Tag);
	void ExecuteUbergraph_GA_Reload_Progressive(int32 EntryPoint, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_EventTag_5, const struct GameplayAbilities_GameplayEventData& K2Node_CustomEvent_EventData_5, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct GameplayAbilities_GameplayEventData& Temp_struct_Variable, const struct GameplayTags_GameplayTag& Temp_struct_Variable_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_EventTag_4, const struct GameplayAbilities_GameplayEventData& K2Node_CustomEvent_EventData_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_EventTag_3, const struct GameplayAbilities_GameplayEventData& K2Node_CustomEvent_EventData_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_EventTag_2, const struct GameplayAbilities_GameplayEventData& K2Node_CustomEvent_EventData_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_EventTag_1, const struct GameplayAbilities_GameplayEventData& K2Node_CustomEvent_EventData_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_EventTag, const struct GameplayAbilities_GameplayEventData& K2Node_CustomEvent_EventData, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, const struct GameplayAbilities_GameplayEventData& Temp_struct_Variable_2, const struct GameplayTags_GameplayTag& Temp_struct_Variable_3, bool CallFunc_IsValid_ReturnValue_2, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance, bool K2Node_DynamicCast_bSuccess, const struct Valhalla_ValAmmoData& CallFunc_GetCurrentAmmo_ReturnValue, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute, float CallFunc_GetFloatAttribute_ReturnValue, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_EventTag_6, const struct GameplayAbilities_GameplayEventData& K2Node_CustomEvent_EventData_6, bool CallFunc_NotEqual_DoubleDouble_ReturnValue, bool K2Node_Event_bWasCancelled, bool K2Node_Event_bWasRetriggered, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1, float CallFunc_GetFloatAttribute_ReturnValue_1, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2, float CallFunc_GetFloatAttribute_ReturnValue_2, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3, float CallFunc_GetFloatAttribute_ReturnValue_3, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_CacheData_IsValid, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, const struct Valhalla_ValAmmoData& CallFunc_GetCurrentAmmo_ReturnValue_1, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_4, float CallFunc_GetFloatAttribute_ReturnValue_4, bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_5, float CallFunc_GetFloatAttribute_ReturnValue_5, int32 CallFunc_Round_ReturnValue, int32 CallFunc_Round_ReturnValue_1, int32 CallFunc_Round_ReturnValue_2, bool CallFunc_IsGameplayTagValid_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, int32 CallFunc_Min_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_3, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_EventTag_7, const struct GameplayAbilities_GameplayEventData& K2Node_CustomEvent_EventData_7, bool CallFunc_IsValid_ReturnValue_3, class USkeletalMeshComponent* CallFunc_GetGunMesh1P_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, class UValDeviceAudioVisual* CallFunc_GetAudioVisual_ReturnValue, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_5, bool CallFunc_IsValid_ReturnValue_6, bool CallFunc_IsValid_ReturnValue_7, bool CallFunc_IsValid_ReturnValue_8, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_EventTag_8, const struct GameplayAbilities_GameplayEventData& K2Node_CustomEvent_EventData_8, double CallFunc_Add_DoubleDouble_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, class USkeletalMeshComponent* CallFunc_GetMesh3P_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_EventTag_9, const struct GameplayAbilities_GameplayEventData& K2Node_CustomEvent_EventData_9, bool CallFunc_IsValid_ReturnValue_9, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, const struct GameplayTags_GameplayTag& K2Node_CustomEvent_Tag, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue_1, class UValAnimInstance* K2Node_DynamicCast_AsVal_Anim_Instance_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsLocallyControlled_ReturnValue_1, const struct Engine_TimerHandle& CallFunc_K2_SetTimer_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_1, double CallFunc_SafeDivide_ReturnValue, class UValAT_PlayMontageForMeshAndWait* CallFunc_PlayMontageForMeshAndWait_ReturnValue, bool CallFunc_IsValid_ReturnValue_10, class UValAT_PlayMontageForMeshAndWait* CallFunc_PlayMontageForMeshAndWait_ReturnValue_1, double CallFunc_SafeDivide_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_11, double CallFunc_NotEqual_DoubleDouble_A_ImplicitCast, double CallFunc_NotEqual_DoubleDouble_B_ImplicitCast, double CallFunc_Divide_DoubleDouble_B_ImplicitCast, double CallFunc_Divide_DoubleDouble_B_ImplicitCast_1, double CallFunc_Divide_DoubleDouble_A_ImplicitCast, double CallFunc_Divide_DoubleDouble_A_ImplicitCast_1, double CallFunc_Round_A_ImplicitCast, double CallFunc_Round_A_ImplicitCast_1, double CallFunc_Round_A_ImplicitCast_2, double CallFunc_Add_DoubleDouble_B_ImplicitCast, double CallFunc_Add_DoubleDouble_A_ImplicitCast, float CallFunc_K2_SetTimer_Time_ImplicitCast, double CallFunc_SafeDivide_A_ImplicitCast, float CallFunc_PlayMontageForMeshAndWait_Rate_ImplicitCast, float CallFunc_PlayMontageForMeshAndWait_Rate_ImplicitCast_1, float CallFunc_Delay_Duration_ImplicitCast);
};

}


