#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x291 (0x7E1 - 0x550)
// WidgetBlueprintGeneratedClass UI_Loadout_Ability.UI_Loadout_Ability_C
class UUI_Loadout_Ability_C : public URHWidget
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x550(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      AnimCascadeIn;                                     // 0x558(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      AnimateHovered;                                    // 0x560(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                Background;                                        // 0x568(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               BackgroundGroup;                                   // 0x570(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               Button;                                            // 0x578(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              ClassIncompatible;                                 // 0x580(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          Content;                                           // 0x588(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Desc;                                              // 0x590(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              DetailsGroup;                                      // 0x598(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              DisplayGroup;                                      // 0x5A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              EquippedGroup;                                     // 0x5A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Foreground;                                        // 0x5B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               ForegroundGroup;                                   // 0x5B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                HoverBorder;                                       // 0x5C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              HoverGroup;                                        // 0x5C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                         Icon;                                              // 0x5D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                IconStroke;                                        // 0x5D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_116;                                         // 0x5E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_201;                                         // 0x5E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shared_Key_C*                      Key;                                               // 0x5F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              LoadingGroup;                                      // 0x5F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       LoadingSwitcher;                                   // 0x600(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                LockIcon;                                          // 0x608(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             LockIconGroup;                                     // 0x610(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                MasteryBorder;                                     // 0x618(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                MasteryOverlay;                                    // 0x620(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Name;                                              // 0x628(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Pressed;                                           // 0x630(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                RedX;                                              // 0x638(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            RequiredLevelText;                                 // 0x640(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CallToAction_C*                   WBP_CallToAction;                                  // 0x648(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Throbber_C*                       WBP_Throbber;                                      // 0x650(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct Valhalla_InventorySlot                DefaultSlot;                                       // 0x658(0xD0)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UValItemAsset*                         DefaultAbility;                                    // 0x728(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                  DefaultKeybind;                                    // 0x730(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct GameplayTags_GameplayTag              DefaultEquipSlot;                                  // 0x738(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnClicked;                                         // 0x740(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnSelected;                                        // 0x750(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         Cached_Selected;                                   // 0x760(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DisableOnSelected;                                 // 0x761(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CachedSelected;                                    // 0x762(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CachedPressed;                                     // 0x763(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CachedHovered;                                     // 0x764(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4179[0x3];                                     // Fixing Size After Last Property  
	class UValItemAsset*                         DefaultNoneAsset;                                  // 0x768(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       Height;                                            // 0x770(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                       Width;                                             // 0x778(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnItemHovered;                                     // 0x780(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnItemUnhovered;                                   // 0x790(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         IsEnabled;                                         // 0x7A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DefaultSelector;                                   // 0x7A1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4182[0x2];                                     // Fixing Size After Last Property  
	int32                                        RequiredLevel;                                     // 0x7A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bCachedIsAbility;                                  // 0x7A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4183[0x7];                                     // Fixing Size After Last Property  
	class AValInventoryManager*                  CachedInventoryManager;                            // 0x7B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         ShowDetails;                                       // 0x7B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         CachedIsLocked;                                    // 0x7B9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseItemIdForCTA;                                   // 0x7BA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4186[0x5];                                     // Fixing Size After Last Property  
	class AValCallToActionManager*               CachedCTAManager;                                  // 0x7C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UValEquipmentAsset*                    RequiredOwnershipItem;                             // 0x7C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValExperienceTrackAsset*              AccountExperienceTrack;                            // 0x7D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        DefaultAbilityID_01;                               // 0x7D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        DefaultAbilityID_02;                               // 0x7DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IgnoreClassCompatibility;                          // 0x7E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UUI_Loadout_Ability_C* GetDefaultObj();

	void UpdateEquipped(bool Value, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	bool NavigateConfirm(bool CallFunc_NavigateConfirm_ReturnValue, enum class ERH_INPUT_STATE CallFunc_GetCurrentInputState_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void UpdateClassCompatible(bool* Compatible, bool LocalIsCompatible, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsValid_ReturnValue, class AValInventoryManager* CallFunc_GetInventoryManager_InventoryManager, bool CallFunc_IsItemClassCompatible_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);
	void UpdateMastery(const struct Valhalla_ValAbilityAffectingPassiveInfo& LocalCurrentInfo, const TArray<struct Valhalla_ValAbilityAffectingPassiveInfo>& LocalAbilityPassiveInfos, bool LocalIsMastered, int32 LocalHighestMasteryRequirement, int32 Temp_int_Array_Index_Variable, bool CallFunc_IsValid_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class AValInventoryManager* CallFunc_GetInventoryManager_ReturnValue, int32 CallFunc_GetPlayerPropertyLevel_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, const struct Valhalla_ValAbilityAffectingPassiveInfo& CallFunc_Array_Get_Item, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class AValGameState_Lobby* K2Node_DynamicCast_AsVal_Game_State_Lobby, bool K2Node_DynamicCast_bSuccess, TArray<struct Valhalla_ValAbilityAffectingPassiveInfo>& CallFunc_GetPassivesAffectingAbilityByID_AffectingPassivesArray);
	void OnCallToActionRemoved(int32 ItemId, class UValItemAsset* LocalItemAsset, class UValItemAsset* CallFunc_GetItemAssetById_ItemAsset, bool CallFunc_GetItemAssetById_ReturnValue, bool CallFunc_MatchesTag_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue);
	void SetCallToActionActive(bool Active, class AValGameState* CallFunc_GetGameState_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class AValGameState_Lobby* K2Node_DynamicCast_AsVal_Game_State_Lobby, bool K2Node_DynamicCast_bSuccess, class AValCallToActionManager* CallFunc_GetCallToActionManager_ReturnValue, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_NotEqual_BoolBool_ReturnValue);
	class UWidget* Get_Button_ToolTipWidget(class UUI_Tooltip_Ability_C* CallFunc_Create_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue);
	void UpdateIconExplicit(TSoftObjectPtr<class UTexture2D> SoftTexture, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor);
	void OnPlayerPropertiesReady(class UObject* NewLocalVar, bool CallFunc_CheckIsAbilityLocked_IsLocked);
	void Check_Property_Requirements(class UValItemAsset* ItemAsset, bool* HasRequirements, bool* RequirementsMet, class UValItemAsset* LocalValEquipment, bool LocalRequirementsMet, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, TArray<enum class EPlayerProperty>& CallFunc_Map_Keys_Keys, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, class AValInventoryManager* CallFunc_GetInventoryManager_ReturnValue, TArray<struct Valhalla_PlayerPropertyData>& CallFunc_GetPlayerPropertyLevels_OutData, bool CallFunc_IsValid_ReturnValue_1, const struct Valhalla_PlayerPropertyData& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue);
	void GetInventoryManager(class AValInventoryManager** InventoryManager, class AValInventoryManager* CallFunc_GetInventoryManager_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void UpdateRequiredLevelText(int32 NewLocalVar_0, class FText CallFunc_GetEmptyText_ReturnValue, int64 CallFunc_Conv_IntToInt64_ReturnValue, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct Engine_FormatArgumentData>& K2Node_MakeArray_Array, bool CallFunc_Greater_IntInt_ReturnValue, class FText CallFunc_Format_ReturnValue);
	void IsSelectorWidget(bool* IsSelector);
	void Is_Ability_Locked(class UValItemAsset* ItemAsset, bool* IsLocked, class UValPlayerInventory* CallFunc_GetLocalPlayerInventory_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsInventoryOwned_ReturnValue, bool CallFunc_Is_Owned_by_Default_IsOwnedByDefault, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_Check_Property_Requirements_HasRequirements, bool CallFunc_Check_Property_Requirements_RequirementsMet, bool CallFunc_Not_PreBool_ReturnValue_2);
	void Is_Owned_by_Default(class UValItemAsset* ItemAsset, bool* IsOwnedByDefault, const TArray<struct Valhalla_AbilityConfig>& LocalConfigAbilities, class AValGameState_Lobby* LocalGameState, bool CallFunc_IsValid_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, bool CallFunc_MatchesTag_ReturnValue, bool CallFunc_MatchesTag_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, TArray<struct Valhalla_AbilityConfig>& CallFunc_GetLoadoutPassives_LoadoutPassives, int32 Temp_int_Array_Index_Variable_1, const struct Valhalla_AbilityConfig& CallFunc_Array_Get_Item, TArray<struct Valhalla_AbilityConfig>& CallFunc_GetLoadoutAbilities_LoadoutAbilities, class UObject* CallFunc_LoadAsset_Blocking_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UValItemAsset* K2Node_DynamicCast_AsVal_Item_Asset, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AValGameState_Lobby* K2Node_DynamicCast_AsVal_Game_State_Lobby, bool K2Node_DynamicCast_bSuccess_1, const struct Valhalla_AbilityConfig& CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, class UObject* CallFunc_LoadAsset_Blocking_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, class UValItemAsset* K2Node_DynamicCast_AsVal_Item_Asset_1, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_1);
	void CheckIsAbilityLocked(bool* IsLocked, bool LocalIsLocked, class AValInventoryManager* CallFunc_GetInventoryManager_ReturnValue, class UValItemAsset* CallFunc_GetItemAssetById_ItemAsset, bool CallFunc_GetItemAssetById_ReturnValue, class AValInventoryManager* CallFunc_GetInventoryManager_ReturnValue_1, class AValInventoryManager* CallFunc_GetInventoryManager_InventoryManager, class UValItemAsset* CallFunc_GetItemAssetById_ItemAsset_1, bool CallFunc_GetItemAssetById_ReturnValue_1, int32 CallFunc_IsItemIdEquipped_SlotId, bool CallFunc_IsItemIdEquipped_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class AValInventoryManager* CallFunc_GetInventoryManager_ReturnValue_2, class AValInventoryManager* CallFunc_GetInventoryManager_ReturnValue_3, class AValInventoryManager* CallFunc_GetInventoryManager_ReturnValue_4, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_IsItemIdEquipped_SlotId_1, bool CallFunc_IsItemIdEquipped_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_1, class AValInventoryManager* CallFunc_GetInventoryManager_InventoryManager_1, int32 CallFunc_IsItemIdEquipped_SlotId_2, bool CallFunc_IsItemIdEquipped_ReturnValue_2, bool CallFunc_Is_Ability_Locked_IsLocked, bool CallFunc_Not_PreBool_ReturnValue_2, bool CallFunc_MatchesTag_ReturnValue, bool CallFunc_IsSelectorWidget_IsSelector);
	void UpdateRequiredLevel(int32 Level);
	void UpdateEquippedItem(bool LocalUpdated, class AValInventoryManager* CallFunc_GetInventoryManager_InventoryManager, class AValInventoryManager* CallFunc_GetInventoryManager_InventoryManager_1, const struct Valhalla_InventorySlot& CallFunc_GetEquippedSlotAt_EquippedSlot, bool CallFunc_GetEquippedSlotAt_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UValItemAsset* CallFunc_GetItemAssetById_ItemAsset, bool CallFunc_GetItemAssetById_ReturnValue);
	void UpdateIsLocked(bool IsLocked, bool Temp_bool_Variable, bool CallFunc_Not_PreBool_ReturnValue, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor_1, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor_2, bool Temp_bool_Variable_1, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor_3, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor_4, const struct SlateCore_SlateColor& K2Node_Select_Default, const struct SlateCore_SlateColor& K2Node_Select_Default_1, bool Temp_bool_Variable_2, const struct SlateCore_SlateColor& K2Node_Select_Default_2);
	void OnHovered(bool Value, bool Temp_bool_Variable, enum class EUMGSequencePlayMode Temp_byte_Variable, enum class EUMGSequencePlayMode Temp_byte_Variable_1, enum class EUMGSequencePlayMode K2Node_Select_Default, bool CallFunc_SetBool_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void OnPressed(bool Value, bool Temp_bool_Variable, const struct CoreUObject_Vector2D& Temp_struct_Variable, const struct CoreUObject_Vector2D& Temp_struct_Variable_1, const struct CoreUObject_Vector2D& K2Node_Select_Default, bool CallFunc_SetBool_ReturnValue);
	void UpdateSelected(bool Value, bool Temp_bool_Variable, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor_1, bool CallFunc_SetBool_ReturnValue, const struct SlateCore_SlateColor& K2Node_Select_Default);
	void OnInitialized(bool Temp_bool_Variable, const struct SlateCore_Margin& K2Node_MakeStruct_Margin, const struct SlateCore_Margin& K2Node_MakeStruct_Margin_1, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue, const struct SlateCore_Margin& K2Node_Select_Default);
	void UpdateKeybind(class FName Value);
	void UpdateEnabled(bool Enabled, bool CallFunc_Not_PreBool_ReturnValue, double CallFunc_SelectFloat_ReturnValue, float CallFunc_SetRenderOpacity_InOpacity_ImplicitCast);
	void UpdateAbility(class UValItemAsset* ItemAsset, bool CallFunc_UpdateClassCompatible_Compatible, bool CallFunc_HasTag_ReturnValue, bool CallFunc_IsValidSoftObjectReference_ReturnValue, bool CallFunc_MatchesTag_ReturnValue, bool CallFunc_IsValid_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor_1, bool Temp_bool_Variable, bool CallFunc_BooleanOR_ReturnValue, const struct SlateCore_SlateColor& K2Node_Select_Default);
	void UpdateData(class UObject* Data, class UObject* CachedLocalEqui);
	void UpdateSize(const struct SlateCore_Margin& K2Node_MakeStruct_Margin, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue, const struct CoreUObject_Vector2D& CallFunc_MakeVector2D_ReturnValue, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue_1, float K2Node_MakeStruct_Left_ImplicitCast);
	void OnLoaded_82CE3A2D4C38DA0E11E4578824892B08(class UObject* Loaded);
	void BndEvt__UI_Button_Menu_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Button_Menu_Button_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UI_Button_Menu_Button_K2Node_ComponentBoundEvent_2_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__UI_Button_Menu_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Button_Menu_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void PlayShowAnimWithDelay(double Delay);
	void PreConstruct(bool IsDesignTime);
	void InitializeWidget();
	void UpdateAbilityFromSoftAsset(TSoftObjectPtr<class UObject> Asset);
	void GamepadHover();
	void GamepadUnhover();
	void GamepadConfirm();
	void ExecuteUbergraph_UI_Loadout_Ability(int32 EntryPoint, double K2Node_CustomEvent_Delay, class UObject* Temp_object_Variable, class UValItemAsset* K2Node_DynamicCast_AsVal_Item_Asset, bool K2Node_DynamicCast_bSuccess, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, bool K2Node_Event_IsDesignTime, bool CallFunc_IsGameplayTagValid_ReturnValue, class AValInventoryManager* CallFunc_GetInventoryManager_ReturnValue, bool CallFunc_IsValid_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UObject* K2Node_CustomEvent_Loaded, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, TSoftObjectPtr<class UObject> K2Node_CustomEvent_Asset, float CallFunc_Delay_Duration_ImplicitCast);
	void OnItemUnhovered__DelegateSignature();
	void OnItemHovered__DelegateSignature(class UValItemAsset* ItemAsset);
	void OnSelected__DelegateSignature(const struct GameplayTags_GameplayTag& Slot);
	void OnClicked__DelegateSignature(class UValItemAsset* ItemAsset);
};

}


