#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1A9 (0x469 - 0x2C0)
// WidgetBlueprintGeneratedClass UI_Tooltip_Equipment_PlayerAttribute.UI_Tooltip_Equipment_PlayerAttribute_C
class UUI_Tooltip_Equipment_PlayerAttribute_C : public UUserWidget
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x2C0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      AnimOnHover;                                       // 0x2C8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                Background;                                        // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       BulletSwitcher;                                    // 0x2D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       DisplaySwitcher;                                   // 0x2E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Divider;                                           // 0x2E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               HitTarget;                                         // 0x2F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              HoverGroup;                                        // 0x2F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            NameTextA;                                         // 0x300(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            NameTextB;                                         // 0x308(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          SubStats;                                          // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            ValueTextA;                                        // 0x318(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            ValueTextB;                                        // 0x320(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AdditiveImage_C*                  WBP_AdditiveImage;                                 // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EPlayerAttributeType              CachedType;                                        // 0x330(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_20F0[0x3];                                     // Fixing Size After Last Property  
	float                                        CachedValue;                                       // 0x334(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PrimaryStat;                                       // 0x338(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TooltipDisplay;                                    // 0x339(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_20F2[0x6];                                     // Fixing Size After Last Property  
	struct Valhalla_PlayerAttributeConfigData    CachedConfig;                                      // 0x340(0xB8)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        FormattedValue;                                    // 0x3F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct SlateCore_SlateColor                  ColorNeutral;                                      // 0x3FC(0x14)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct SlateCore_SlateColor                  ColorPositive;                                     // 0x410(0x14)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct SlateCore_SlateColor                  ColorNegative;                                     // 0x424(0x14)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct SlateCore_SlateColor                  ColorPrimary;                                      // 0x438(0x14)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct SlateCore_SlateColor                  ColorSecondary;                                    // 0x44C(0x14)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                         CachedNeedConfig;                                  // 0x460(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2103[0x3];                                     // Fixing Size After Last Property  
	float                                        FormattedClassDefault;                             // 0x464(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShowBottomDecro;                                   // 0x468(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UUI_Tooltip_Equipment_PlayerAttribute_C* GetDefaultObj();

	void UpdateAttributeModifiers(class UPlayerAttributeConfig* LocalAttributeConfig, class UPlayerAttributeConfig* CallFunc_GetPlayerAttributeConfig_ReturnValue, int32 Temp_int_Array_Index_Variable, bool CallFunc_IsValid_ReturnValue, bool CallFunc_HasAnyChildren_ReturnValue, int32 Temp_int_Loop_Counter_Variable, const struct Valhalla_PlayerAttributeConfigData& CallFunc_GetAttributeConfigData_AttributeConfigData, bool CallFunc_GetAttributeConfigData_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, TArray<enum class EPlayerAttributeType>& CallFunc_Map_Keys_Keys, class UUI_Tooltip_Equipment_PlayerAttribute_SubStat_C* CallFunc_Create_ReturnValue, enum class EPlayerAttributeType CallFunc_Array_Get_Item, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue, class UCurveFloat* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, float CallFunc_GetFloatValue_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void GetBaseHealthShield(double* Value);
	bool IsTotalHealthShieldStat(bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void UpdateDisplayDefaults(const struct CoreUObject_LinearColor& CallFunc_SelectColor_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_SelectInt_ReturnValue);
	void CacheClassDefaultValue(float LocalDefaultValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, class AValInventoryManager* CallFunc_GetInventoryManager_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, TMap<enum class EPlayerAttributeType, float> CallFunc_GetClassAttributeValues_ReturnValue, double CallFunc_SelectFloat_ReturnValue, float CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_SelectFloat_ReturnValue_1, bool CallFunc_EqualEqual_DoubleDouble_ReturnValue, bool CallFunc_IsValid_ReturnValue, double CallFunc_SelectFloat_ReturnValue_2, double CallFunc_Subtract_DoubleDouble_A_ImplicitCast, double CallFunc_SelectFloat_A_ImplicitCast, float K2Node_VariableSet_FormattedClassDefault_ImplicitCast);
	void CacheAttributeValue(double Value, bool CallFunc_EqualEqual_ByteByte_ReturnValue, double CallFunc_GetBaseHealthShield_Value, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, double CallFunc_SelectFloat_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_1, double CallFunc_SelectFloat_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_SelectFloat_ReturnValue_2, bool CallFunc_EqualEqual_DoubleDouble_ReturnValue, double CallFunc_SelectFloat_ReturnValue_3, double CallFunc_Add_DoubleDouble_ReturnValue, float K2Node_VariableSet_CachedValue_ImplicitCast, double CallFunc_Subtract_DoubleDouble_A_ImplicitCast, double CallFunc_SelectFloat_A_ImplicitCast, float K2Node_VariableSet_FormattedValue_ImplicitCast);
	void CacheAttributeType(enum class EPlayerAttributeType Type, class UPlayerAttributeConfig* CallFunc_GetPlayerAttributeConfig_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct Valhalla_PlayerAttributeConfigData& CallFunc_GetAttributeConfigData_AttributeConfigData, bool CallFunc_GetAttributeConfigData_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void CacheAttributeData(enum class EPlayerAttributeType Type, double Value, bool* Changed, bool LocalChanged, bool CallFunc_NotEqual_DoubleDouble_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, double CallFunc_NotEqual_DoubleDouble_B_ImplicitCast);
	void GetFormattedText(class FText* Text, bool LocalFlatValue, bool Temp_bool_Variable, class FText Temp_text_Variable, class FText Temp_text_Variable_1, bool Temp_bool_Variable_1, class FText Temp_text_Variable_2, bool Temp_bool_Variable_2, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class FText CallFunc_AsPercent_Float_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue, class FText CallFunc_Conv_DoubleToText_ReturnValue, class FText K2Node_Select_Default, class FText K2Node_Select_Default_1, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData, class FText K2Node_Select_Default_2, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct Engine_FormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, double CallFunc_Less_DoubleDouble_A_ImplicitCast, double CallFunc_Conv_DoubleToText_Value_ImplicitCast);
	class UWBP_TooltipStatEntry_C* GetToolTipWidget(class UWBP_TooltipStatEntry_C* LocalWidget, class UWBP_TooltipStatEntry_C* CallFunc_Create_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void PreConstruct(bool IsDesignTime);
	void UpdateColor(bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, bool Temp_bool_Variable_3, int32 CallFunc_SelectInt_ReturnValue, double CallFunc_GetBaseHealthShield_Value, bool CallFunc_IsTotalHealthShieldStat_ReturnValue, double CallFunc_GetBaseHealthShield_Value_1, bool CallFunc_IsTotalHealthShieldStat_ReturnValue_1, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor_1, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor_2, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor_3, double CallFunc_SelectFloat_ReturnValue, double CallFunc_SelectFloat_ReturnValue_1, bool Temp_bool_Variable_4, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool Temp_bool_Variable_5, bool CallFunc_Less_DoubleDouble_ReturnValue, const struct SlateCore_SlateColor& K2Node_Select_Default, const struct SlateCore_SlateColor& K2Node_Select_Default_1, const struct SlateCore_SlateColor& K2Node_Select_Default_2, const struct SlateCore_SlateColor& K2Node_Select_Default_3, bool Temp_bool_Variable_6, const struct SlateCore_SlateColor& K2Node_Select_Default_4, bool CallFunc_Less_DoubleDouble_ReturnValue_1, const struct SlateCore_SlateColor& K2Node_Select_Default_5, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, const struct SlateCore_SlateColor& K2Node_Select_Default_6, double CallFunc_Greater_DoubleDouble_A_ImplicitCast, double CallFunc_SelectFloat_B_ImplicitCast, double CallFunc_SelectFloat_B_ImplicitCast_1, double CallFunc_Less_DoubleDouble_A_ImplicitCast, double CallFunc_Less_DoubleDouble_A_ImplicitCast_1, double CallFunc_Greater_DoubleDouble_A_ImplicitCast_1);
	void UpdateData(enum class EPlayerAttributeType Type, float Value, float LocalFormattedValue, const struct Valhalla_PlayerAttributeConfigData& LocalConfigData, bool CallFunc_CacheAttributeData_Changed, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_BooleanAND_ReturnValue, double CallFunc_CacheAttributeData_Value_ImplicitCast);
	void UpdateText(double LocalFormattedValue, class FText CallFunc_GetFormattedText_Text);
	void BndEvt__UI_Tooltip_Equipment_PlayerAttribute_HitTarget_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Tooltip_Equipment_PlayerAttribute_HitTarget_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_UI_Tooltip_Equipment_PlayerAttribute(int32 EntryPoint, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
};

}


