#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xC1 (0xC1 - 0x0)
// UserDefinedStruct Utopia_Constructor_ForceFeatures.Utopia_Constructor_ForceFeatures
struct Utopia_Constructor_ForceFeatures_Utopia_Constructor_ForceFeatures
{
public:
	class FName                                  DevName_20_88CC7E244664764E5F3CEAB25B0CE960;       // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_CellTypes                       CellType_6_F004F56C4A847B9F35703EBD2206DAA8;       // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2542[0x3];                                     // Fixing Size After Last Property  
	int32                                        Floor_9_DA63E5B244A684689E765C982F5B5E38;          // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Utopia_Constructor_MeshExclusion_Utopia_Constructor_MeshExclusion WallMeshAndFeature_13_F9E82BDC4B7FE39EFC801A94B064FD51; // 0x10(0x49)(Edit, BlueprintVisible, HasGetValueTypeHash)
	uint8                                        Pad_2546[0x7];                                     // Fixing Size After Last Property  
	struct Utopia_Constructor_MeshExclusion_Utopia_Constructor_MeshExclusion FloorMeshAndFeature_10_3502A6754AA9E6FF8F972CB7FF359C7F; // 0x60(0x49)(Edit, BlueprintVisible, HasGetValueTypeHash)
	uint8                                        Pad_2547[0x7];                                     // Fixing Size After Last Property  
	bool                                         AllowOnRoof_15_0954C389413A7AA46707598396B4698F;   // 0xB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2548[0x3];                                     // Fixing Size After Last Property  
	int32                                        ExplicitIndex_23_FF59C6BD48C8F0381F6BF5B0A0A1C53B; // 0xB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ForceOrientation_26_6E7394D84F207309C02CDCA5B4609077; // 0xB8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_OddEvenBoth                     DungeonGeneratorAllowed_29_736D70714883BC0084E5CFB77F47913A; // 0xBC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsConnectorToOtherUC_31_969E3B4546E1CC9FBF1950A2D6039C71; // 0xBD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ForceOutwardFacing_33_08110338449499422776B6A1A475D21E; // 0xBE(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_AdjacentCellsList               UCConnectorSide_36_4C2E7E034D574E6DAE015BA391E23E8D; // 0xBF(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseBlockerUCConnector_38_FA13487B4FA265DD313F5ABFFC339175; // 0xC0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


