#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x44 (0x44 - 0x0)
// UserDefinedStruct Utopia_Constructor_CellAVData.Utopia_Constructor_CellAVData
struct Utopia_Constructor_CellAVData_Utopia_Constructor_CellAVData
{
public:
	bool                                         UseMesh_13_2B2E6C1A481B52CD76340885B70D8161;       // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2381[0x7];                                     // Fixing Size After Last Property  
	class UStaticMesh*                           Mesh_14_539C63E6451CCC4763C06CAE16118332;          // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         UseCellFeature_10_CC064FCB48DEE9A6C2C349AEF9661273; // 0x10(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2382[0x7];                                     // Fixing Size After Last Property  
	struct Utopia_Constructor_CellFeature_Utopia_Constructor_CellFeature CellFeature_5_1F1F082B454C203D157831B8B2CFCD4C;    // 0x18(0x21)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2383[0x7];                                     // Fixing Size After Last Property  
	bool                                         Allow_If_Outside_17_B6B8485F456C5792420CD5B725811863; // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Allow_If_Wall_19_B67EB4A34C3FB41404C00D92D74A7BBC; // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Allow_if_Corner_21_031637774D54BBFB9F559DA954CE27D8; // 0x42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Allow_if_Middle_23_87ECD8C14155C9F544599489A07E2CA1; // 0x43(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


