#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xA0 (0xA0 - 0x0)
// UserDefinedStruct Utopia_Constructor_CellFeatureSets.Utopia_Constructor_CellFeatureSets
struct Utopia_Constructor_CellFeatureSets_Utopia_Constructor_CellFeatureSets
{
public:
	TArray<struct Utopia_Constructor_CellFeature_Utopia_Constructor_CellFeature> OutsideCellsToRandomize_51_50AEF1FB4BE42D8D84D3F09AE50797D4; // 0x0(0x10)(Edit, BlueprintVisible)
	TArray<struct Utopia_Constructor_CellFeature_Utopia_Constructor_CellFeature> MiddleCellstoRandomize_59_B286994D436A5B9BA39C638A9E2DA178; // 0x10(0x10)(Edit, BlueprintVisible)
	TArray<struct Utopia_Constructor_CellFeature_Utopia_Constructor_CellFeature> InsideWallCellstoRandomize_61_A2A01F8249E5293C8BF06497D8154892; // 0x20(0x10)(Edit, BlueprintVisible)
	TArray<struct Utopia_Constructor_CellFeature_Utopia_Constructor_CellFeature> InsideWallCornerCellstoRandomize_66_F447DFC9449A7FFA65D044971E37027B; // 0x30(0x10)(Edit, BlueprintVisible)
	TArray<struct Utopia_Constructor_CellFeature_Utopia_Constructor_CellFeature> TwoStoryMiddleCellstoRandomize_68_252BE83B4FC3BB35EC58D9B39FABE489; // 0x40(0x10)(Edit, BlueprintVisible)
	TArray<struct Utopia_Constructor_CellFeature_Utopia_Constructor_CellFeature> TwoStoryWallCells_72_A4F67B11467006A228BACEB9D132916B; // 0x50(0x10)(Edit, BlueprintVisible)
	TArray<struct Utopia_Constructor_CellFeature_Utopia_Constructor_CellFeature> TwoStoryCorners_76_7D5A9A314EC1A44BE5BBB9BBE04387F2; // 0x60(0x10)(Edit, BlueprintVisible)
	TArray<struct Utopia_Constructor_CellFeature_Utopia_Constructor_CellFeature> Cooridors_78_1D9288FE413C29990A00A686809A38A8;     // 0x70(0x10)(Edit, BlueprintVisible)
	TArray<struct Utopia_Constructor_CellFeature_Utopia_Constructor_CellFeature> DoubleCorners_82_DEE8923148BBF0C90DCD9DB18CE4D90A; // 0x80(0x10)(Edit, BlueprintVisible)
	TArray<struct Utopia_Constructor_CellFeature_Utopia_Constructor_CellFeature> TwoStoryDoubleCorners_86_7F7276D948F04F7C7E367897E775A7B3; // 0x90(0x10)(Edit, BlueprintVisible)
};

}


