#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xB40 (0xF20 - 0x3E0)
// BlueprintGeneratedClass Utopia_Constructor_V3.Utopia_Constructor_V3_C
class AUtopia_Constructor_V3_C : public AValUtopiaConstructor
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x3E0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                  CellProxy;                                         // 0x3E8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                         SimpleBoxCollision;                                // 0x3F0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  FogVolumeBox;                                      // 0x3F8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  ShadowBox;                                         // 0x400(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  StartingMesh;                                      // 0x408(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x410(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                         AssetReviewMode;                                   // 0x418(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DisableMeshes;                                     // 0x419(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DisableFeatures;                                   // 0x41A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         MiniMapMode;                                       // 0x41B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DebugText;                                         // 0x41C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EFA[0x3];                                     // Fixing Size After Last Property  
	int32                                        MinRow;                                            // 0x420(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MaxRow;                                            // 0x424(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MinColumn;                                         // 0x428(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MaxColumn;                                         // 0x42C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MinNumberofLevels;                                 // 0x430(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MaxNumberofLevels;                                 // 0x434(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_RemoveShapes                    LayoutShapeAdjust;                                 // 0x438(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AddSecondLevelFloor;                               // 0x439(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AddPenthouse;                                      // 0x43A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         RandomRemoveCells;                                 // 0x43B(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         MaintainGroundFloorShapeOnRemovedCells;            // 0x43C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EFC[0x3];                                     // Fixing Size After Last Property  
	double                                       ChanceCellFeature;                                 // 0x440(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       BuildingHeightAdjust;                              // 0x448(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_RandomStream              Seed;                                              // 0x450(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	int32                                        NumberCellsRow;                                    // 0x458(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NumberCellsColumn;                                 // 0x45C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_Transform                 BuildTransform;                                    // 0x460(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        FloorMaterial_Roll;                                // 0x4C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        LowerWallMaterial_Roll;                            // 0x4C4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        UpperWallMaterialRoll;                             // 0x4C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        TopWallMaterialRoll;                               // 0x4CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RoofMaterialRoll;                                  // 0x4D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RandomLevelRoll;                                   // 0x4D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UValSecurityLevel*                     SecurityLevelOverride;                             // 0x4D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                        MinNumberOfLootCrates;                             // 0x4E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MaxNumberOfLootCrates;                             // 0x4E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CellstoLootRatio;                                  // 0x4E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EFE[0x4];                                     // Fixing Size After Last Property  
	TArray<struct CoreUObject_Transform>         LootPlacementArray;                                // 0x4F0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct GameplayTags_GameplayTag, struct Valhalla_BotTransformData> BotPlacementMap;                                   // 0x500(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct TransformAndActor_TransformAndActor> InteractiveBlueprintsForBeginPlay;                 // 0x550(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct Utopia_Constructor_CellFeatureWithPlacement_Utopia_Constructor_CellFeatureWithPlacement BotSpawnVolume;                                    // 0x560(0x91)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EFF[0xF];                                     // Fixing Size After Last Property  
	enum class EBuildingType                     BuildingType;                                      // 0x600(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F00[0x7];                                     // Fixing Size After Last Property  
	double                                       DebugTextHeight;                                   // 0x608(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MiniMapRenderID;                                   // 0x610(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F01[0x4];                                     // Fixing Size After Last Property  
	struct CoreUObject_Vector                    ConstructorCenterPivot;                            // 0x618(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnBuildingLooted;                                  // 0x630(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct TransformAndActor_TransformAndActor> InteractiveBlueprintsForConstrution;               // 0x640(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct Utopia_Constructor_MaterialSlotSet_Utopia_Constructor_MaterialSlotSet> MaterialSets;                                      // 0x650(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                       CellSize;                                          // 0x660(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RoofZAdjust;                                       // 0x668(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MeshUniformScale;                                  // 0x670(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_Vector                    RoofScalingOverride;                               // 0x678(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Utopia_Constructor_ArtSet_Wall_Utopia_Constructor_ArtSet_Wall GroundLevel;                                       // 0x690(0x48)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct Utopia_Constructor_ArtSet_Plane_Utopia_Constructor_ArtSet_Plane GroundFlooring;                                    // 0x6D8(0x40)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct Utopia_Constructor_ArtSet_Wall_Utopia_Constructor_ArtSet_Wall SecondLevel;                                       // 0x718(0x48)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct Utopia_Constructor_ArtSet_Wall_Utopia_Constructor_ArtSet_Wall SecondLevelIfTop;                                  // 0x760(0x48)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct Utopia_Constructor_ArtSet_Plane_Utopia_Constructor_ArtSet_Plane SecondLevelFlooring;                               // 0x7A8(0x40)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct Utopia_Constructor_ArtSet_Wall_Utopia_Constructor_ArtSet_Wall FillLevels;                                        // 0x7E8(0x48)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct Utopia_Constructor_ArtSet_Plane_Utopia_Constructor_ArtSet_Plane FillFlooring;                                      // 0x830(0x40)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct Utopia_Constructor_ArtSet_Wall_Utopia_Constructor_ArtSet_Wall TopLevel;                                          // 0x870(0x48)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct Utopia_Constructor_ArtSet_Wall_Utopia_Constructor_ArtSet_Wall TopLevelIfPenthouse;                               // 0x8B8(0x48)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct Utopia_Constructor_ArtSet_Plane_Utopia_Constructor_ArtSet_Plane Roof;                                              // 0x900(0x40)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct Utopia_Constructor_CellFeatureSets_Utopia_Constructor_CellFeatureSets RandomCellFeatures;                                // 0x940(0xA0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct Utopia_Constructor_ForceFeatures_Utopia_Constructor_ForceFeatures> ForcedFeatures;                                    // 0x9E0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        OverrideFeaturestoIndex;                           // 0x9F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F06[0x4];                                     // Fixing Size After Last Property  
	TArray<struct Utopia_Constructor_Cell_Utopia_Constructor_Cell> CellGridOriginal;                                  // 0x9F8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         Looted;                                            // 0xA08(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F07[0x7];                                     // Fixing Size After Last Property  
	TArray<class ABP_Loot_Crate_C*>              SpawnedLootCrates;                                 // 0xA10(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                        SpawnedDoors;                                      // 0xA20(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                        BuildingID;                                        // 0xA30(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F08[0x4];                                     // Fixing Size After Last Property  
	TArray<struct Utopia_Constructor_LayoutShapes_Utopia_Constructor_LayoutShapes> ExsactSelectionShapes;                             // 0xA38(0x10)(Edit, BlueprintVisible)
	bool                                         MakeEdgesAllOutside;                               // 0xA48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         GenerateNavMeshForRoofs;                           // 0xA49(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F09[0x6];                                     // Fixing Size After Last Property  
	TArray<struct Utopia_Constructor_MaterialSlotSet_Utopia_Constructor_MaterialSlotSet> DepricatedMaterialSets;                            // 0xA50(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         UnifyMaterialRolls;                                // 0xA60(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F0A[0x7];                                     // Fixing Size After Last Property  
	struct Utopia_Constructor_ArtSet_Plane_Utopia_Constructor_ArtSet_Plane Roof1StoryOverride;                                // 0xA68(0x40)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct Utopia_Constructor_ArtSet_Wall_Utopia_Constructor_ArtSet_Wall SpecialFacingWalls;                                // 0xAA8(0x48)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                         UseSpecialFacingWalls;                             // 0xAF0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F0B[0x7];                                     // Fixing Size After Last Property  
	struct Utopia_Constructor_ArtSet_Wall_Utopia_Constructor_ArtSet_Wall CooridorWalls;                                     // 0xAF8(0x48)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct Utopia_Constructor_ArtSet_Plane_Utopia_Constructor_ArtSet_Plane CooridorFloors;                                    // 0xB40(0x40)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>          RoofMeshReferenceArray;                            // 0xB80(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                         UseShadowBox;                                      // 0xB90(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ForceSimpleShadowBox;                              // 0xB91(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F0C[0x6];                                     // Fixing Size After Last Property  
	struct Utopia_Constructor_MaterialSlotSet_Utopia_Constructor_MaterialSlotSet ShadowBoxMaterial;                                 // 0xB98(0x28)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct CoreUObject_Vector                    ShadowBoxLocationOffset;                           // 0xBC0(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseLocalFogVolume;                                 // 0xBD8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F0D[0x7];                                     // Fixing Size After Last Property  
	struct Utopia_Constructor_MaterialSlotSet_Utopia_Constructor_MaterialSlotSet FogVolumeMaterial;                                 // 0xBE0(0x28)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct CoreUObject_Vector                    FogVolumeLocationOffset;                           // 0xC08(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct Utopia_Constructor_CellFeatureWithPlacement_Utopia_Constructor_CellFeatureWithPlacement> EpicFeatureList;                                   // 0xC20(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct Utopia_Constructor_CellFeatureWithPlacement_Utopia_Constructor_CellFeatureWithPlacement MakeExitSpawnPoint;                                // 0xC30(0x91)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F0E[0xF];                                     // Fixing Size After Last Property  
	class AValBotSpawnVolume*                    BotSpawnVolumeRef;                                 // 0xCD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	enum class E_OddEvenBoth                     DungeonSupercellAllowed;                           // 0xCD8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F0F[0x7];                                     // Fixing Size After Last Property  
	TArray<struct Utopia_Constructor_CellFeature_Utopia_Constructor_CellFeature> DoorList;                                          // 0xCE0(0x10)(Edit, BlueprintVisible)
	bool                                         PlaceDoorsAtConnectors;                            // 0xCF0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F10[0x7];                                     // Fixing Size After Last Property  
	TArray<class UStaticMesh*>                   InsideCornerPillars;                               // 0xCF8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct Utopia_Constructor_ForceFeatures_Utopia_Constructor_ForceFeatures> RareFeatures;                                      // 0xD08(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                       RareFeatureChance;                                 // 0xD18(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                   OutsideFillList;                                   // 0xD20(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        ForceMaterialRollDebug;                            // 0xD30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F11[0x4];                                     // Fixing Size After Last Property  
	TArray<class UStaticMesh*>                   UpperFloorInsideCornerPillars;                     // 0xD38(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct Utopia_Constructor_MeshExclusion_Utopia_Constructor_MeshExclusion> OverrideWallsWithIC;                               // 0xD48(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMesh*>                   FogWreckage;                                       // 0xD58(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                       FogWreckagePercent;                                // 0xD68(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       LightFogScatteringIntensity;                       // 0xD70(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       LightIndirectIntensity;                            // 0xD78(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RectLightFogScatteringIntensity;                   // 0xD80(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RectLightIndirectIntensity;                        // 0xD88(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct CoreUObject_Transform>         SpecialLootPlacementArray;                         // 0xD90(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        ForceLayoutShapeDebug;                             // 0xDA0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PerformanceMode;                                   // 0xDA4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F14[0x3];                                     // Fixing Size After Last Property  
	int32                                        MinNumberScavLootCrates;                           // 0xDA8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MaxNumberScavLootCrates;                           // 0xDAC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PreventBRFogDestruction;                           // 0xDB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F15[0x7];                                     // Fixing Size After Last Property  
	class FText                                  AssetSetName;                                      // 0xDB8(0x18)(Edit, BlueprintVisible)
	struct CoreUObject_Vector                    AssetReviewTextOffset;                             // 0xDD0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AssetReviewCellSpacing;                            // 0xDE8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  AreaGameplayName;                                  // 0xDF0(0x18)(Edit, BlueprintVisible)
	double                                       GlobalUCHeightAdjust;                              // 0xE08(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       InsideCornerPillarScale;                           // 0xE10(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseSimpleBoxCollision;                             // 0xE18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PlaceOnRoof;                                       // 0xE19(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F16[0x6];                                     // Fixing Size After Last Property  
	struct CoreUObject_Vector                    BoxCollisionSize;                                  // 0xE20(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_Vector                    BoxCollisionPositionOffset;                        // 0xE38(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_Vector                    FogVolumeScale;                                    // 0xE50(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_LinearColor               Light_SL1;                                         // 0xE68(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_LinearColor               Light_SL2;                                         // 0xE78(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_LinearColor               Light_SL3;                                         // 0xE88(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_LinearColor               Light_SL4;                                         // 0xE98(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct CoreUObject_LinearColor               Light_SL5;                                         // 0xEA8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                     Light_MAT_SL1;                                     // 0xEB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                     Light_MAT_SL2;                                     // 0xEC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                     Light_MAT_SL3;                                     // 0xEC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                     Light_MAT_SL4;                                     // 0xED0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                     Light_MAT_SL5;                                     // 0xED8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         PreferBlockerLayout;                               // 0xEE0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DontBlockSL5;                                      // 0xEE1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F17[0x6];                                     // Fixing Size After Last Property  
	struct Utopia_Constructor_LayoutShapes_Utopia_Constructor_LayoutShapes BlockerShape;                                      // 0xEE8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                         PruneTopUCConnectors;                              // 0xEF8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PruneBottomUCConnectors_0;                         // 0xEF9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PruneLeftUCConnectors;                             // 0xEFA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PruneRightUCConnectors_0;                          // 0xEFB(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShowAreaNameOnMiniMap;                             // 0xEFC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F18[0x3];                                     // Fixing Size After Last Property  
	TArray<struct Utopia_Constructor_CellFeature_Utopia_Constructor_CellFeature> DoorBlockerList;                                   // 0xF00(0x10)(Edit, BlueprintVisible)
	bool                                         CanMakeExitPortals;                                // 0xF10(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4F19[0x7];                                     // Fixing Size After Last Property  
	class ABP_SwarmBeacon_C*                     SwarmBeaconReference;                              // 0xF18(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class AUtopia_Constructor_V3_C* GetDefaultObj();

	enum class EBuildingType GetBuildingType();
	void ResetLootCrates(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_HasAuthority_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, class ABP_Loot_Crate_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, enum class ECrateState CallFunc_GetCurrentState_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_NotEqual_ByteByte_ReturnValue, int32 CallFunc_Max_ReturnValue);
