#pragma once




#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAudioThreatTestActor.AudioSend
struct AValAudioThreatTestActor_AudioSend_Params
{
public:
	class FString                                Input;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.AsyncAction_GetLeaderboard.GetLeaderboard
struct UAsyncAction_GetLeaderboard_GetLeaderboard_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                LeaderboardName;                                   // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncAction_GetLeaderboard*           ReturnValue;                                       // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.AsyncTaskAttributeChanged.ListenForAttributesChange
struct UAsyncTaskAttributeChanged_ListenForAttributesChange_Params
{
public:
	class UAbilitySystemComponent*               AbilitySystemComponent;                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct GameplayAbilities_GameplayAttribute> Attributes;                                        // 0x8(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAsyncTaskAttributeChanged*            ReturnValue;                                       // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Valhalla.AsyncTaskAttributeChanged.ListenForAttributeChange
struct UAsyncTaskAttributeChanged_ListenForAttributeChange_Params
{
public:
	class UAbilitySystemComponent*               AbilitySystemComponent;                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttribute   Attribute;                                         // 0x8(0x38)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncTaskAttributeChanged*            ReturnValue;                                       // 0x40(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.AsyncTaskLocalPlayerRep.ListenForLocalPlayerRep
struct UAsyncTaskLocalPlayerRep_ListenForLocalPlayerRep_Params
{
public:
	class UValGameInstance*                      ValGameInstance;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncTaskLocalPlayerRep*              ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.AsyncTaskPlayerStateRep.PlayerStateRep
struct UAsyncTaskPlayerStateRep_PlayerStateRep_Params
{
public:
	class AValPlayerStateBase*                   PlayerState;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.AsyncTaskPlayerStateRep.ListenForPCPlayerStateRep
struct UAsyncTaskPlayerStateRep_ListenForPCPlayerStateRep_Params
{
public:
	class AValPlayerController*                  ValPC;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncTaskPlayerStateRep*              ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.AsyncTaskPlayerStateRep.ListenForCharacterPlayerStateRep
struct UAsyncTaskPlayerStateRep_ListenForCharacterPlayerStateRep_Params
{
public:
	class AValCharacter*                         ValCharacter;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncTaskPlayerStateRep*              ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.RemainingAmmoVFX.SetCharRef
struct URemainingAmmoVFX_SetCharRef_Params
{
public:
	class AValCharacter*                         CharacterReference;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.RemainingAmmoVFX.OnReload
struct URemainingAmmoVFX_OnReload_Params
{
public:
	struct GameplayTags_GameplayTag              InTag;                                             // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NewCount;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.RemainingAmmoVFX.OnClipAmmoChanged
struct URemainingAmmoVFX_OnClipAmmoChanged_Params
{
public:
	float                                        OldValue;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NewValue;                                          // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// Function Valhalla.ValGameplayAbility.ValInputPressed
struct UValGameplayAbility_ValInputPressed_Params
{
public:
	struct GameplayAbilities_GameplayAbilitySpecHandle Handle;                                            // 0x0(0x4)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23F[0x4];                                      // Fixing Size After Last Property  
	struct GameplayAbilities_GameplayAbilityActorInfo ActorInfo;                                         // 0x8(0x48)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilityActivationInfo ActivationInfo;                                    // 0x50(0x20)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function Valhalla.ValGameplayAbility.ValCheckCost
struct UValGameplayAbility_ValCheckCost_Params
{
public:
	struct GameplayAbilities_GameplayAbilitySpecHandle Handle;                                            // 0x0(0x4)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_244[0x4];                                      // Fixing Size After Last Property  
	struct GameplayAbilities_GameplayAbilityActorInfo ActorInfo;                                         // 0x8(0x48)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x50(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_245[0x7];                                      // Fixing Size Of Struct 
};

// 0x70 (0x70 - 0x0)
// Function Valhalla.ValGameplayAbility.ValApplyCost
struct UValGameplayAbility_ValApplyCost_Params
{
public:
	struct GameplayAbilities_GameplayAbilitySpecHandle Handle;                                            // 0x0(0x4)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_24D[0x4];                                      // Fixing Size After Last Property  
	struct GameplayAbilities_GameplayAbilityActorInfo ActorInfo;                                         // 0x8(0x48)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilityActivationInfo ActivationInfo;                                    // 0x50(0x20)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValGameplayAbility.ValActivationFailed
struct UValGameplayAbility_ValActivationFailed_Params
{
public:
	struct GameplayAbilities_GameplayAbilitySpecHandle Handle;                                            // 0x0(0x4)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_254[0x4];                                      // Fixing Size After Last Property  
	struct GameplayTags_GameplayTagContainer     FailureReason;                                     // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValGameplayAbility.UsesCharges
struct UValGameplayAbility_UsesCharges_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function Valhalla.ValGameplayAbility.TryInputLocal
struct UValGameplayAbility_TryInputLocal_Params
{
public:
	enum class EValAbilityInputID                InputID;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function Valhalla.ValGameplayAbility.TryInput
struct UValGameplayAbility_TryInput_Params
{
public:
	enum class EValAbilityInputID                InputID;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x1(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.SetCurrentChargeNoReplication
struct UValGameplayAbility_SetCurrentChargeNoReplication_Params
{
public:
	int32                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.SetCurrentCharge
struct UValGameplayAbility_SetCurrentCharge_Params
{
public:
	int32                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValGameplayAbility.SetCooldownAbility
struct UValGameplayAbility_SetCooldownAbility_Params
{
public:
	TSubclassOf<class UGameplayEffect>           NewCooldown;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValGameplayAbility.SendTargetDataToServer
struct UValGameplayAbility_SendTargetDataToServer_Params
{
public:
	struct GameplayAbilities_GameplayAbilityTargetDataHandle TargetData;                                        // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValGameplayAbility.OnSecondaryCooldownEnd
struct UValGameplayAbility_OnSecondaryCooldownEnd_Params
{
public:
	struct GameplayTags_GameplayTag              CooldownTag;                                       // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeRemaining;                                     // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Duration;                                          // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.OnAbilityLevelUpdated
struct UValGameplayAbility_OnAbilityLevelUpdated_Params
{
public:
	int32                                        NewLevel;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValGameplayAbility.MontageStopForMesh
struct UValGameplayAbility_MontageStopForMesh_Params
{
public:
	class USkeletalMeshComponent*                InMesh;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OverrideBlendOutTime;                              // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2B4[0x4];                                      // Fixing Size Of Struct 
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.MontageStopForAllMeshes
struct UValGameplayAbility_MontageStopForAllMeshes_Params
{
public:
	float                                        OverrideBlendOutTime;                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValGameplayAbility.MontageSetNextSectionNameForMesh
struct UValGameplayAbility_MontageSetNextSectionNameForMesh_Params
{
public:
	class USkeletalMeshComponent*                InMesh;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  FromSectionName;                                   // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ToSectionName;                                     // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValGameplayAbility.MontageJumpToSectionForMesh
struct UValGameplayAbility_MontageJumpToSectionForMesh_Params
{
public:
	class USkeletalMeshComponent*                InMesh;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SectionName;                                       // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Valhalla.ValGameplayAbility.MakeGameplayAbilityTargetDataHandleFromHitResults
struct UValGameplayAbility_MakeGameplayAbilityTargetDataHandleFromHitResults_Params
{
public:
	TArray<struct Engine_HitResult>              HitResults;                                        // 0x0(0x10)(ConstParm, Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilityTargetDataHandle ReturnValue;                                       // 0x10(0x28)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Valhalla.ValGameplayAbility.MakeGameplayAbilityTargetDataHandleFromActorArray
struct UValGameplayAbility_MakeGameplayAbilityTargetDataHandleFromActorArray_Params
{
public:
	TArray<class AActor*>                        TargetActors;                                      // 0x0(0x10)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilityTargetDataHandle ReturnValue;                                       // 0x10(0x28)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// Function Valhalla.ValGameplayAbility.MakeEffectContainerSpecFromContainer
struct UValGameplayAbility_MakeEffectContainerSpecFromContainer_Params
{
public:
	struct Valhalla_ValGameplayEffectContainer   Container;                                         // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayEventData   EventData;                                         // 0x18(0xB0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                        OverrideGameplayLevel;                             // 0xC8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31B[0x4];                                      // Fixing Size After Last Property  
	struct Valhalla_ValGameplayEffectContainerSpec ReturnValue;                                       // 0xD0(0x10)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0xD0 (0xD0 - 0x0)
// Function Valhalla.ValGameplayAbility.MakeEffectContainerSpec
struct UValGameplayAbility_MakeEffectContainerSpec_Params
{
public:
	struct GameplayTags_GameplayTag              ContainerTag;                                      // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayEventData   EventData;                                         // 0x8(0xB0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                        OverrideGameplayLevel;                             // 0xB8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_344[0x4];                                      // Fixing Size After Last Property  
	struct Valhalla_ValGameplayEffectContainerSpec ReturnValue;                                       // 0xC0(0x10)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function Valhalla.ValGameplayAbility.K2_GetSourceObject
struct UValGameplayAbility_K2_GetSourceObject_Params
{
public:
	struct GameplayAbilities_GameplayAbilitySpecHandle Handle;                                            // 0x0(0x4)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_373[0x4];                                      // Fixing Size After Last Property  
	struct GameplayAbilities_GameplayAbilityActorInfo ActorInfo;                                         // 0x8(0x48)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UObject*                               ReturnValue;                                       // 0x50(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Valhalla.ValGameplayAbility.K2_ApplyGameplayEffectSpecsToTarget
struct UValGameplayAbility_K2_ApplyGameplayEffectSpecsToTarget_Params
{
public:
	TArray<struct GameplayAbilities_GameplayEffectSpecHandle> EffectSpecHandles;                                 // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilityTargetDataHandle TargetData;                                        // 0x10(0x28)(Parm, NativeAccessSpecifierPublic)
	TArray<struct GameplayAbilities_ActiveGameplayEffectHandle> ReturnValue;                                       // 0x38(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValGameplayAbility.IsPredictionKeyValidForMorePrediction
struct UValGameplayAbility_IsPredictionKeyValidForMorePrediction_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValGameplayAbility.IsOnSecondaryCooldown
struct UValGameplayAbility_IsOnSecondaryCooldown_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValGameplayAbility.IsInputPressed
struct UValGameplayAbility_IsInputPressed_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValGameplayAbility.IsHitscan
struct UValGameplayAbility_IsHitscan_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValGameplayAbility.IsAbilityActive
struct UValGameplayAbility_IsAbilityActive_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValGameplayAbility.HasCharge
struct UValGameplayAbility_HasCharge_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValGameplayAbility.GetWeaponType
struct UValGameplayAbility_GetWeaponType_Params
{
public:
	struct GameplayTags_GameplayTag              OutWeaponType;                                     // 0x0(0x8)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValGameplayAbility.GetTimeSinceDate
struct UValGameplayAbility_GetTimeSinceDate_Params
{
public:
	struct CoreUObject_DateTime                  PreviousTime;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4A4[0x4];                                      // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValGameplayAbility.GetSubAbilityFromInputID
struct UValGameplayAbility_GetSubAbilityFromInputID_Params
{
public:
	enum class EValAbilityInputID                InputID;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4CB[0x7];                                      // Fixing Size After Last Property  
	class UGameplayAbility*                      ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValGameplayAbility.GetSubAbilityFromClass
struct UValGameplayAbility_GetSubAbilityFromClass_Params
{
public:
	TSubclassOf<class UGameplayAbility>          AbilityClass;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayAbility*                      ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValGameplayAbility.GetSlotSecondaryCooldownTag
struct UValGameplayAbility_GetSlotSecondaryCooldownTag_Params
{
public:
	struct GameplayTags_GameplayTag              OutGameplayTag;                                    // 0x0(0x8)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_51F[0x3];                                      // Fixing Size Of Struct 
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValGameplayAbility.GetSlotCooldownTags
struct UValGameplayAbility_GetSlotCooldownTags_Params
{
public:
	struct GameplayTags_GameplayTagContainer     OutGameplayTags;                                   // 0x0(0x20)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_54C[0x7];                                      // Fixing Size Of Struct 
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.GetSecondaryCooldownTimeRemaining
struct UValGameplayAbility_GetSecondaryCooldownTimeRemaining_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValGameplayAbility.GetOwningASC
struct UValGameplayAbility_GetOwningASC_Params
{
public:
	class UValAbilitySystemComponent*            ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.GetMaxCharges
struct UValGameplayAbility_GetMaxCharges_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.GetHolsterTime
struct UValGameplayAbility_GetHolsterTime_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.GetDrawTime
struct UValGameplayAbility_GetDrawTime_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValGameplayAbility.GetDamageType
struct UValGameplayAbility_GetDamageType_Params
{
public:
	struct GameplayTags_GameplayTag              OutDamageType;                                     // 0x0(0x8)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValGameplayAbility.GetCurrentPredictionKeyStatus
struct UValGameplayAbility_GetCurrentPredictionKeyStatus_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValGameplayAbility.GetCurrentMontageForMesh
struct UValGameplayAbility_GetCurrentMontageForMesh_Params
{
public:
	class USkeletalMeshComponent*                InMesh;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.GetCurrentCharges
struct UValGameplayAbility_GetCurrentCharges_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.GetCooldownDuration
struct UValGameplayAbility_GetCooldownDuration_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValGameplayAbility.GetAbilityTags
struct UValGameplayAbility_GetAbilityTags_Params
{
public:
	struct GameplayTags_GameplayTagContainer     ReturnValue;                                       // 0x0(0x20)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValGameplayAbility.GetAbilityPropertyModValues
struct UValGameplayAbility_GetAbilityPropertyModValues_Params
{
public:
	struct GameplayTags_GameplayTag              PropertyTag;                                       // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                OutValues;                                         // 0x8(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValGameplayAbility.GetAbilityAudioVisual
struct UValGameplayAbility_GetAbilityAudioVisual_Params
{
public:
	class UValAbilityAudioVisual*                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x140 (0x140 - 0x0)
// Function Valhalla.ValGameplayAbility.EventOnAbilityRemoved
struct UValGameplayAbility_EventOnAbilityRemoved_Params
{
public:
	struct GameplayAbilities_GameplayAbilityActorInfo ActorInfo;                                         // 0x0(0x48)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilitySpec Spec;                                              // 0x48(0xF8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x140 (0x140 - 0x0)
// Function Valhalla.ValGameplayAbility.EventOnAbilityGiven
struct UValGameplayAbility_EventOnAbilityGiven_Params
{
public:
	struct GameplayAbilities_GameplayAbilityActorInfo ActorInfo;                                         // 0x0(0x48)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilitySpec Spec;                                              // 0x48(0xF8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValGameplayAbility.BatchRPCTryActivateAbility
struct UValGameplayAbility_BatchRPCTryActivateAbility_Params
{
public:
	struct GameplayAbilities_GameplayAbilitySpecHandle InAbilityHandle;                                   // 0x0(0x4)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         EndAbilityImmediately;                             // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x5(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_785[0x2];                                      // Fixing Size Of Struct 
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValGameplayAbility.ApplySwapTimeModifier
struct UValGameplayAbility_ApplySwapTimeModifier_Params
{
public:
	float                                        OutPercentModifier;                                // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutFlatModifier;                                   // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              SwappedFromSlot;                                   // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              SwappedToSlot;                                     // 0x10(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.ApplySecondaryCooldown
struct UValGameplayAbility_ApplySecondaryCooldown_Params
{
public:
	float                                        Amount;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValGameplayAbility.ApplyLimbResistanceModifier
struct UValGameplayAbility_ApplyLimbResistanceModifier_Params
{
public:
	float                                        OutLimbDamageModifier;                             // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Damage;                                            // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayEffectContextHandle DamageContext;                                     // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValGameplayAbility.ApplyHealthResistanceModifier
struct UValGameplayAbility_ApplyHealthResistanceModifier_Params
{
public:
	float                                        OutPercentModifier;                                // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutFlatModifier;                                   // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Damage;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_81E[0x4];                                      // Fixing Size After Last Property  
	struct GameplayAbilities_GameplayEffectContextHandle DamageContext;                                     // 0x10(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Valhalla.ValGameplayAbility.ApplyEffectContainerSpecToTarget
struct UValGameplayAbility_ApplyEffectContainerSpecToTarget_Params
{
public:
	struct Valhalla_ValGameplayEffectContainerSpec ContainerSpec;                                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilityTargetDataHandle TargetData;                                        // 0x10(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct GameplayAbilities_ActiveGameplayEffectHandle> ReturnValue;                                       // 0x38(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValGameplayAbility.ApplyDamageResistanceModifier
struct UValGameplayAbility_ApplyDamageResistanceModifier_Params
{
public:
	float                                        OutPercentModifier;                                // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutFlatModifier;                                   // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutShieldModifier;                                 // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Damage;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayEffectContextHandle DamageContext;                                     // 0x10(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValGameplayAbility.ApplyDamageOutputModifier
struct UValGameplayAbility_ApplyDamageOutputModifier_Params
{
public:
	float                                        OutPercentModifier;                                // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutFlatModifier;                                   // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Damage;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_968[0x4];                                      // Fixing Size After Last Property  
	struct GameplayAbilities_GameplayEffectContextHandle DamageContext;                                     // 0x10(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.ApplyCooldownWithFlatAmount
struct UValGameplayAbility_ApplyCooldownWithFlatAmount_Params
{
public:
	float                                        Amount;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.AddMaxCharge
struct UValGameplayAbility_AddMaxCharge_Params
{
public:
	int32                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.AddAbilityCooldownPercentageModifier
struct UValGameplayAbility_AddAbilityCooldownPercentageModifier_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValGameplayAbility.AddAbilityCooldownFlatModifier
struct UValGameplayAbility_AddAbilityCooldownFlatModifier_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValDevice.ShouldUsePredictiveAiming
struct UValDevice_ShouldUsePredictiveAiming_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValDevice.GetDeployableAudioVisual
struct UValDevice_GetDeployableAudioVisual_Params
{
public:
	class UValDeployableAudioVisual*             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValDevice.GetAudioVisual
struct UValDevice_GetAudioVisual_Params
{
public:
	class UValDeviceAudioVisual*                 ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValDevice.GetActorToSpawnOnActivation
struct UValDevice_GetActorToSpawnOnActivation_Params
{
public:
	TSubclassOf<class AActor>                    ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValDevice.CalculateActivationDelta
struct UValDevice_CalculateActivationDelta_Params
{
public:
	float                                        TimeBetweenActivations;                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B42[0x4];                                      // Fixing Size After Last Property  
	double                                       LastActivation;                                    // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                       ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.SmoothTransformComponent.GetCurrentLocation
struct USmoothTransformComponent_GetCurrentLocation_Params
{
public:
	struct CoreUObject_Vector                    ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAnimInstance.SetWalking
struct UValAnimInstance_SetWalking_Params
{
public:
	bool                                         bValue;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAnimInstance.SetSprinting
struct UValAnimInstance_SetSprinting_Params
{
public:
	bool                                         bValue;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAnimInstance.SetRightHandIKStrength
struct UValAnimInstance_SetRightHandIKStrength_Params
{
public:
	float                                        NewStrength;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BlendTime;                                         // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAnimInstance.SetLeftHandIKStrength
struct UValAnimInstance_SetLeftHandIKStrength_Params
{
public:
	float                                        NewStrength;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BlendTime;                                         // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAnimInstance.SetHidden
struct UValAnimInstance_SetHidden_Params
{
public:
	bool                                         bNewHidden;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAnimInstance.RestoreSwapAnim
struct UValAnimInstance_RestoreSwapAnim_Params
{
public:
	float                                        HolsterDuration;                                   // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DrawDuration;                                      // 0x4(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAnimInstance.PlayReverseHolster
struct UValAnimInstance_PlayReverseHolster_Params
{
public:
	float                                        HolsterDuration;                                   // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAnimInstance.PlayReverseDraw
struct UValAnimInstance_PlayReverseDraw_Params
{
public:
	float                                        DrawDuration;                                      // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAnimInstance.PlayHolster
struct UValAnimInstance_PlayHolster_Params
{
public:
	float                                        HolsterDuration;                                   // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAnimInstance.PlayDraw
struct UValAnimInstance_PlayDraw_Params
{
public:
	float                                        DrawDuration;                                      // 0x0(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAnimInstance.PlayDeathAnimation
struct UValAnimInstance_PlayDeathAnimation_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValAnimInstance.OnWeaponHolstered
struct UValAnimInstance_OnWeaponHolstered_Params
{
public:
	struct GameplayTags_GameplayTag              InTag;                                             // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NewCount;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValAnimInstance.OnSprintStateChanged
struct UValAnimInstance_OnSprintStateChanged_Params
{
public:
	struct GameplayTags_GameplayTag              InTag;                                             // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NewCount;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValAnimInstance.OnPostMatchStateChanged
struct UValAnimInstance_OnPostMatchStateChanged_Params
{
public:
	struct GameplayTags_GameplayTag              InTag;                                             // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NewCount;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAnimInstance.BlendOutIK
struct UValAnimInstance_BlendOutIK_Params
{
public:
	bool                                         bForceBlendOutBothArms;                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAbilityAnimInstance.PlayMontageReplicated
struct UValAbilityAnimInstance_PlayMontageReplicated_Params
{
public:
	class UValGameplayAbility*                   Ability;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          Montage;                                           // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Duration;                                          // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_ED1[0x4];                                      // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAbilityAnimInstance.PlayMontage
struct UValAbilityAnimInstance_PlayMontage_Params
{
public:
	class UAnimMontage*                          Montage;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Duration;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FAB[0x4];                                      // Fixing Size Of Struct 
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValAbilityAnimInstance.OnGrenadeThrow
struct UValAbilityAnimInstance_OnGrenadeThrow_Params
{
public:
	struct GameplayTags_GameplayTag              InTag;                                             // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NewCount;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilityAudioVisual.GetMesh3P
struct UValAbilityAudioVisual_GetMesh3P_Params
{
public:
	class USkeletalMesh*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilityAudioVisual.GetMesh1P
struct UValAbilityAudioVisual_GetMesh1P_Params
{
public:
	class USkeletalMesh*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAbilityAudioVisual.GetMaterialOverrideParams1P
struct UValAbilityAudioVisual_GetMaterialOverrideParams1P_Params
{
public:
	class FName                                  Key;                                               // 0x0(0x8)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAbilityAudioVisual.GetMaterialOverride1P
struct UValAbilityAudioVisual_GetMaterialOverride1P_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1189[0x4];                                     // Fixing Size After Last Property  
	class UMaterialInterface*                    ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilityAudioVisual.GetABP3P
struct UValAbilityAudioVisual_GetABP3P_Params
{
public:
	class UClass*                                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.RemoveGrantedTag
struct UValAbilityFunctionLibrary_RemoveGrantedTag_Params
{
public:
	struct GameplayAbilities_GameplayEffectSpecHandle SpecHandle;                                        // 0x0(0x10)(Parm, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              GameplayTag;                                       // 0x10(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayEffectSpecHandle ReturnValue;                                       // 0x18(0x10)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.IsPrimaryAbilityInstanceActive
struct UValAbilityFunctionLibrary_IsPrimaryAbilityInstanceActive_Params
{
public:
	class UAbilitySystemComponent*               AbilitySystemComponent;                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilitySpecHandle Handle;                                            // 0x8(0x4)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1304[0x3];                                     // Fixing Size Of Struct 
};

// 0x130 (0x130 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.IsOccluded
struct UValAbilityFunctionLibrary_IsOccluded_Params
{
public:
	class AActor*                                Victim;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                          Bones;                                             // 0x8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    Origin;                                            // 0x18(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        IgnoreActors;                                      // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct Engine_HitResult                      Hit;                                               // 0x40(0xE8)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	enum class ECollisionChannel                 TraceChannel;                                      // 0x128(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDrawDebug;                                        // 0x129(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x12A(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13A4[0x5];                                     // Fixing Size Of Struct 
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.IsActiveGameplayEffectHandleValid
struct UValAbilityFunctionLibrary_IsActiveGameplayEffectHandleValid_Params
{
public:
	struct GameplayAbilities_ActiveGameplayEffectHandle Handle;                                            // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13FD[0x3];                                     // Fixing Size Of Struct 
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.IsAbilitySpecHandleValid
struct UValAbilityFunctionLibrary_IsAbilitySpecHandleValid_Params
{
public:
	struct GameplayAbilities_GameplayAbilitySpecHandle Handle;                                            // 0x0(0x4)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1436[0x3];                                     // Fixing Size Of Struct 
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.HasGrantedTagExact
struct UValAbilityFunctionLibrary_HasGrantedTagExact_Params
{
public:
	struct GameplayAbilities_GameplayEffectSpecHandle SpecHandle;                                        // 0x0(0x10)(Parm, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              GameplayTag;                                       // 0x10(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1488[0x7];                                     // Fixing Size Of Struct 
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.GetSetByCallerMagnitudeByTag
struct UValAbilityFunctionLibrary_GetSetByCallerMagnitudeByTag_Params
{
public:
	struct GameplayAbilities_GameplayEffectSpecHandle SpecHandle;                                        // 0x0(0x10)(Parm, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              DataTag;                                           // 0x10(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x18(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14C4[0x4];                                     // Fixing Size Of Struct 
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.GetPrimaryAbilityInstanceFromHandle
struct UValAbilityFunctionLibrary_GetPrimaryAbilityInstanceFromHandle_Params
{
public:
	class UAbilitySystemComponent*               AbilitySystemComponent;                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilitySpecHandle Handle;                                            // 0x8(0x4)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1503[0x4];                                     // Fixing Size After Last Property  
	class UValGameplayAbility*                   ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.GetPrimaryAbilityInstanceFromClass
struct UValAbilityFunctionLibrary_GetPrimaryAbilityInstanceFromClass_Params
{
public:
	class UAbilitySystemComponent*               AbilitySystemComponent;                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayAbility>          InAbilityClass;                                    // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UValGameplayAbility*                   ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.GetPlayerEditorWindowRole
struct UValAbilityFunctionLibrary_GetPlayerEditorWindowRole_Params
{
public:
	class UWorld*                                World;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ReturnValue;                                       // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.GetHitIDFromTargetData
struct UValAbilityFunctionLibrary_GetHitIDFromTargetData_Params
{
public:
	struct GameplayAbilities_GameplayAbilityTargetDataHandle HitResult;                                         // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x28(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HitID;                                             // 0x2C(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x30(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1574[0x7];                                     // Fixing Size Of Struct 
};

// 0xA0 (0xA0 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.FindActorsInExplosion
struct UValAbilityFunctionLibrary_FindActorsInExplosion_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DamageCauser;                                      // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    Origin;                                            // 0x10(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OuterDamageRadius;                                 // 0x28(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15DC[0x4];                                     // Fixing Size After Last Property  
	TArray<class AActor*>                        IgnoreActors;                                      // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	enum class ECollisionChannel                 DamagePreventionChannel;                           // 0x40(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15EB[0x7];                                     // Fixing Size After Last Property  
	TMap<class AActor*, struct Engine_HitResult> OutResults;                                        // 0x48(0x50)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         bIgnoreOcclusion;                                  // 0x98(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDrawDebug;                                        // 0x99(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x9A(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15FD[0x5];                                     // Fixing Size Of Struct 
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.EffectContextSetSourceObject
struct UValAbilityFunctionLibrary_EffectContextSetSourceObject_Params
{
public:
	struct GameplayAbilities_GameplayEffectContextHandle EffectContextHandle;                               // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	class UObject*                               NewSource;                                         // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.EffectContextSetAffectsTeam
struct UValAbilityFunctionLibrary_EffectContextSetAffectsTeam_Params
{
public:
	struct GameplayAbilities_GameplayEffectContextHandle EffectContextHandle;                               // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	bool                                         Value;                                             // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1695[0x7];                                     // Fixing Size Of Struct 
};

// 0x40 (0x40 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.EffectContextGetTargetData
struct UValAbilityFunctionLibrary_EffectContextGetTargetData_Params
{
public:
	struct GameplayAbilities_GameplayEffectContextHandle EffectContext;                                     // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilityTargetDataHandle ReturnValue;                                       // 0x18(0x28)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.EffectContextGetAffectsTeam
struct UValAbilityFunctionLibrary_EffectContextGetAffectsTeam_Params
{
public:
	struct GameplayAbilities_GameplayEffectContextHandle EffectContext;                                     // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1750[0x7];                                     // Fixing Size Of Struct 
};

// 0x40 (0x40 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.EffectContextAddTargetData
struct UValAbilityFunctionLibrary_EffectContextAddTargetData_Params
{
public:
	struct GameplayAbilities_GameplayEffectContextHandle EffectContextHandle;                               // 0x0(0x18)(Parm, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilityTargetDataHandle TargetData;                                        // 0x18(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.DoesEffectContainerSpecHaveEffects
struct UValAbilityFunctionLibrary_DoesEffectContainerSpecHaveEffects_Params
{
public:
	struct Valhalla_ValGameplayEffectContainerSpec ContainerSpec;                                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17F4[0x7];                                     // Fixing Size Of Struct 
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.ClearTargetData
struct UValAbilityFunctionLibrary_ClearTargetData_Params
{
public:
	struct GameplayAbilities_GameplayAbilityTargetDataHandle TargetData;                                        // 0x0(0x28)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.ApplyExternalEffectSpec
struct UValAbilityFunctionLibrary_ApplyExternalEffectSpec_Params
{
public:
	struct GameplayAbilities_GameplayEffectSpecHandle EffectSpec;                                        // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilityTargetDataHandle TargetData;                                        // 0x10(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct GameplayAbilities_ActiveGameplayEffectHandle> ReturnValue;                                       // 0x38(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function Valhalla.ValAbilityFunctionLibrary.ApplyExternalEffectContainerSpec
struct UValAbilityFunctionLibrary_ApplyExternalEffectContainerSpec_Params
{
public:
	struct Valhalla_ValGameplayEffectContainerSpec ContainerSpec;                                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilityTargetDataHandle TargetData;                                        // 0x10(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct GameplayAbilities_ActiveGameplayEffectHandle> ReturnValue;                                       // 0x38(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValPickup.TryToPickUp
struct AValPickup_TryToPickUp_Params
{
public:
	class AValCharacter*                         ValCharacter;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A3C[0x7];                                     // Fixing Size Of Struct 
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValPickup.SetPickupActive
struct AValPickup_SetPickupActive_Params
{
public:
	bool                                         bActive;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValPickup.ReserveItem
struct AValPickup_ReserveItem_Params
{
public:
	class AValCharacter*                         Reserver;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1AC9[0x7];                                     // Fixing Size Of Struct 
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValPickup.OnPickupComplete
struct AValPickup_OnPickupComplete_Params
{
public:
	class AValCharacter*                         ValCharacter;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValPickup.OnHoverStart
struct AValPickup_OnHoverStart_Params
{
public:
	class AValCharacter*                         Initiator;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValPickup.OnHoverEnd
struct AValPickup_OnHoverEnd_Params
{
public:
	class AValCharacter*                         Initiator;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValPickup.Interact
struct AValPickup_Interact_Params
{
public:
	class AValCharacter*                         Initiator;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValPickup.HideFloatingIcon
struct AValPickup_HideFloatingIcon_Params
{
public:
	bool                                         bIsHidden;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValPickup.GetPickupInteractText
struct AValPickup_GetPickupInteractText_Params
{
public:
	class AValCharacter*                         Initiator;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Success;                                           // 0x8(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1BC1[0x7];                                     // Fixing Size After Last Property  
	class FText                                  ReturnValue;                                       // 0x10(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValPickup.GetPickupAbility
struct AValPickup_GetPickupAbility_Params
{
public:
	TSubclassOf<class UValDevice>                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValPickup.GetMesh
struct AValPickup_GetMesh_Params
{
public:
	class USkeletalMeshComponent*                ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValPickup.GetInteractText
struct AValPickup_GetInteractText_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValPickup.GetInteractComponent
struct AValPickup_GetInteractComponent_Params
{
public:
	class UPrimitiveComponent*                   ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValPickup.GetCollisionComp
struct AValPickup_GetCollisionComp_Params
{
public:
	class USphereComponent*                      ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValPickup.EnablePickup
struct AValPickup_EnablePickup_Params
{
public:
	bool                                         Value;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValPickup.CustomPickupFunc
struct AValPickup_CustomPickupFunc_Params
{
public:
	class AValCharacter*                         ValCharacter;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CFC[0x7];                                     // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValPickup.CharacterPickupCheck
struct AValPickup_CharacterPickupCheck_Params
{
public:
	class AValCharacter*                         ValCharacter;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D89[0x7];                                     // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValPickup.CanInteract
struct AValPickup_CanInteract_Params
{
public:
	class AValCharacter*                         Initiator;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1DFA[0x7];                                     // Fixing Size Of Struct 
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValPickup.AutoPickupPickupItem
struct AValPickup_AutoPickupPickupItem_Params
{
public:
	class AValCharacter*                         Initiator;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAbilityPickup.OnRarityUpdated
struct AValAbilityPickup_OnRarityUpdated_Params
{
public:
	enum class ERarity                           Rarity;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilityPickup.OnEquipSlotUpdated
struct AValAbilityPickup_OnEquipSlotUpdated_Params
{
public:
	struct GameplayTags_GameplayTag              NewEquipSlot;                                      // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilityPickup.OnAbilityUpdated
struct AValAbilityPickup_OnAbilityUpdated_Params
{
public:
	TSubclassOf<class UValGameplayAbility>       Ability;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAbilityPickup.GetStackSize
struct AValAbilityPickup_GetStackSize_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAbilityPickup.GetRarity
struct AValAbilityPickup_GetRarity_Params
{
public:
	enum class ERarity                           ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAbilityPickup.GetMaxStackSize
struct AValAbilityPickup_GetMaxStackSize_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilityPickup.GetEquipSlot
struct AValAbilityPickup_GetEquipSlot_Params
{
public:
	struct GameplayTags_GameplayTag              ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilityPickup.GetAssetId
struct AValAbilityPickup_GetAssetId_Params
{
public:
	class FName                                  ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAbilityPickup.GetAbilityPickupMesh
struct AValAbilityPickup_GetAbilityPickupMesh_Params
{
public:
	TSoftObjectPtr<class UStaticMesh>            ReturnValue;                                       // 0x0(0x28)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilityPickup.GetAbility
struct AValAbilityPickup_GetAbility_Params
{
public:
	TSubclassOf<class UValGameplayAbility>       ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAbilitySwappable.Wait_ApplyCooldown
struct UValAbilitySwappable_Wait_ApplyCooldown_Params
{
public:
	float                                        Time;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAbilitySwappable.TryConfirm
struct UValAbilitySwappable_TryConfirm_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAbilitySwappable.SetSwapDisabled
struct UValAbilitySwappable_SetSwapDisabled_Params
{
public:
	bool                                         Value;                                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAbilitySwappable.SetHolsterTime
struct UValAbilitySwappable_SetHolsterTime_Params
{
public:
	float                                        NewTime;                                           // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAbilitySwappable.PlayMontage
struct UValAbilitySwappable_PlayMontage_Params
{
public:
	class UAnimMontage*                          Montage1P;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          Montage3P;                                         // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Duration;                                          // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_298F[0x4];                                     // Fixing Size Of Struct 
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilitySwappable.ModifySwappable
struct UValAbilitySwappable_ModifySwappable_Params
{
public:
	class AValCharacter*                         Character;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAbilitySwappable.GetGunHolsterTime
struct UValAbilitySwappable_GetGunHolsterTime_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAbilitySwappable.GetGunDrawTime
struct UValAbilitySwappable_GetGunDrawTime_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAbilitySwappable.CheckSwappableCosts
struct UValAbilitySwappable_CheckSwappableCosts_Params
{
public:
	class AValCharacter*                         Character;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2AB3[0x7];                                     // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.TryActivateAbilityByClassAndInput
struct UValAbilitySystemComponent_TryActivateAbilityByClassAndInput_Params
{
public:
	TSubclassOf<class UGameplayAbility>          InAbilityToActivate;                               // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InputID;                                           // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowRemoteActivation;                            // 0xC(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xD(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C28[0x2];                                     // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.SetGameplayEffectDurationHandle
struct UValAbilitySystemComponent_SetGameplayEffectDurationHandle_Params
{
public:
	struct GameplayAbilities_ActiveGameplayEffectHandle Handle;                                            // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NewDuration;                                       // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C94[0x3];                                     // Fixing Size Of Struct 
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.ServerCurrentMontageSetPlayRateForMesh
struct UValAbilitySystemComponent_ServerCurrentMontageSetPlayRateForMesh_Params
{
public:
	class USkeletalMeshComponent*                InMesh;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          ClientAnimMontage;                                 // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InPlayRate;                                        // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2D27[0x4];                                     // Fixing Size Of Struct 
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.ServerCurrentMontageSetNextSectionNameForMesh
struct UValAbilitySystemComponent_ServerCurrentMontageSetNextSectionNameForMesh_Params
{
public:
	class USkeletalMeshComponent*                InMesh;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          ClientAnimMontage;                                 // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ClientPosition;                                    // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SectionName;                                       // 0x14(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  NextSectionName;                                   // 0x1C(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2DD2[0x4];                                     // Fixing Size Of Struct 
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.ServerCurrentMontageJumpToSectionNameForMesh
struct UValAbilitySystemComponent_ServerCurrentMontageJumpToSectionNameForMesh_Params
{
public:
	class USkeletalMeshComponent*                InMesh;                                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          ClientAnimMontage;                                 // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SectionName;                                       // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.RemoveGameplayCueLocal
struct UValAbilitySystemComponent_RemoveGameplayCueLocal_Params
{
public:
	struct GameplayTags_GameplayTag              GameplayCueTag;                                    // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayCueParameters GameplayCueParameters;                             // 0x8(0xD8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x368 (0x368 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.OnGameplayEffectDurationChange
struct UValAbilitySystemComponent_OnGameplayEffectDurationChange_Params
{
public:
	struct GameplayAbilities_ActiveGameplayEffect ActiveEffect;                                      // 0x0(0x368)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.OnAbilityEndedWithData
struct UValAbilitySystemComponent_OnAbilityEndedWithData_Params
{
public:
	struct GameplayAbilities_AbilityEndedData    Data;                                              // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.OnAbilityEnded
struct UValAbilitySystemComponent_OnAbilityEnded_Params
{
public:
	class UGameplayAbility*                      EndedAbility;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.OnAbilityActivated
struct UValAbilitySystemComponent_OnAbilityActivated_Params
{
public:
	class UGameplayAbility*                      ActivatedAbility;                                  // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.MulticastSwappableAbilityEnded
struct UValAbilitySystemComponent_MulticastSwappableAbilityEnded_Params
{
public:
	class UClass*                                Type;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.MulticastSwappableAbilityActivated
struct UValAbilitySystemComponent_MulticastSwappableAbilityActivated_Params
{
public:
	class UClass*                                Type;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.K2_RemoveLooseGameplayTags
struct UValAbilitySystemComponent_K2_RemoveLooseGameplayTags_Params
{
public:
	struct GameplayTags_GameplayTagContainer     GameplayTags;                                      // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x20(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31EE[0x4];                                     // Fixing Size Of Struct 
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValAbilitySystemComponent.K2_RemoveLooseGameplayTag
struct UValAbilitySystemComponent_K2_RemoveLooseGameplayTag_Params
{
public:
	struct GameplayTags_GameplayTag              GameplayTag;                                       // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValAbilitySystemComponent.K2_GetTagCount
struct UValAbilitySystemComponent_K2_GetTagCount_Params
{
public:
	struct GameplayTags_GameplayTag              TagToCheck;                                        // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.K2_AddLooseGameplayTags
struct UValAbilitySystemComponent_K2_AddLooseGameplayTags_Params
{
public:
	struct GameplayTags_GameplayTagContainer     GameplayTags;                                      // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x20(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_33AA[0x4];                                     // Fixing Size Of Struct 
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValAbilitySystemComponent.K2_AddLooseGameplayTag
struct UValAbilitySystemComponent_K2_AddLooseGameplayTag_Params
{
public:
	struct GameplayTags_GameplayTag              GameplayTag;                                       // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.IncreaseAllCooldowns
struct UValAbilitySystemComponent_IncreaseAllCooldowns_Params
{
public:
	float                                        Amount;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValAbilitySystemComponent.IncreaseActiveCooldownWithTag
struct UValAbilitySystemComponent_IncreaseActiveCooldownWithTag_Params
{
public:
	float                                        Amount;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              Tag;                                               // 0x4(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.IncreaseActiveCooldownsByPercent
struct UValAbilitySystemComponent_IncreaseActiveCooldownsByPercent_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.IncreaseActiveCooldowns
struct UValAbilitySystemComponent_IncreaseActiveCooldowns_Params
{
public:
	float                                        Amount;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.GetCurrentPredictionKeyStatus
struct UValAbilitySystemComponent_GetCurrentPredictionKeyStatus_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.FindAbilitySpecHandleForClass
struct UValAbilitySystemComponent_FindAbilitySpecHandleForClass_Params
{
public:
	TSubclassOf<class UGameplayAbility>          AbilityClass;                                      // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               OptionalSourceObject;                              // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAbilitySpecHandle ReturnValue;                                       // 0x10(0x4)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3669[0x4];                                     // Fixing Size Of Struct 
};

// 0xE0 (0xE0 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.ExecuteGameplayCueLocal
struct UValAbilitySystemComponent_ExecuteGameplayCueLocal_Params
{
public:
	struct GameplayTags_GameplayTag              GameplayCueTag;                                    // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayCueParameters GameplayCueParameters;                             // 0x8(0xD8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.BP_RemoveGameplayCueWithParams
struct UValAbilitySystemComponent_BP_RemoveGameplayCueWithParams_Params
{
public:
	struct GameplayTags_GameplayTag              GameplayCueTag;                                    // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.BP_ExecuteGameplayCueWithParams
struct UValAbilitySystemComponent_BP_ExecuteGameplayCueWithParams_Params
{
public:
	struct GameplayTags_GameplayTag              GameplayCueTag;                                    // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayCueParameters GameplayCueParameters;                             // 0x8(0xD8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.BP_ApplyGameplayEffectToTargetWithPrediction
struct UValAbilitySystemComponent_BP_ApplyGameplayEffectToTargetWithPrediction_Params
{
public:
	TSubclassOf<class UGameplayEffect>           GameplayEffectClass;                               // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*               Target;                                            // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Level;                                             // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_38B6[0x4];                                     // Fixing Size After Last Property  
	struct GameplayAbilities_GameplayEffectContextHandle Context;                                           // 0x18(0x18)(Parm, NativeAccessSpecifierPublic)
	struct GameplayAbilities_ActiveGameplayEffectHandle ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.BP_ApplyGameplayEffectToSelfWithPrediction
struct UValAbilitySystemComponent_BP_ApplyGameplayEffectToSelfWithPrediction_Params
{
public:
	TSubclassOf<class UGameplayEffect>           GameplayEffectClass;                               // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Level;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_39B5[0x4];                                     // Fixing Size After Last Property  
	struct GameplayAbilities_GameplayEffectContextHandle EffectContext;                                     // 0x10(0x18)(Parm, NativeAccessSpecifierPublic)
	struct GameplayAbilities_ActiveGameplayEffectHandle ReturnValue;                                       // 0x28(0x8)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.BP_ApplyGameplayEffectSpecToSelfWithPrediction
struct UValAbilitySystemComponent_BP_ApplyGameplayEffectSpecToSelfWithPrediction_Params
{
public:
	struct GameplayAbilities_GameplayEffectSpecHandle SpecHandle;                                        // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct GameplayAbilities_ActiveGameplayEffectHandle ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.BP_AddGameplayCueWithParams
struct UValAbilitySystemComponent_BP_AddGameplayCueWithParams_Params
{
public:
	struct GameplayTags_GameplayTag              GameplayCueTag;                                    // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayCueParameters GameplayCueParameter;                              // 0x8(0xD8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.BatchRPCTryActivateAbility
struct UValAbilitySystemComponent_BatchRPCTryActivateAbility_Params
{
public:
	struct GameplayAbilities_GameplayAbilitySpecHandle InAbilityHandle;                                   // 0x0(0x4)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         EndAbilityImmediately;                             // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x5(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A9B[0x2];                                     // Fixing Size Of Struct 
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.AddSourceObjectToEffectContext
struct UValAbilitySystemComponent_AddSourceObjectToEffectContext_Params
{
public:
	struct GameplayAbilities_GameplayEffectContextHandle EffectContextHandle;                               // 0x0(0x18)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                               SourceObject;                                      // 0x18(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.AddGameplayCueLocal
struct UValAbilitySystemComponent_AddGameplayCueLocal_Params
{
public:
	struct GameplayTags_GameplayTag              GameplayCueTag;                                    // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayCueParameters GameplayCueParameters;                             // 0x8(0xD8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilitySystemComponent.AddAbilityMaxCharge
struct UValAbilitySystemComponent_AddAbilityMaxCharge_Params
{
public:
	struct GameplayAbilities_GameplayAbilitySpecHandle Handle;                                            // 0x0(0x4)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF8 (0xF8 - 0x0)
// Function Valhalla.ValAbilityUpgrade.SetOwningAbility
struct UValAbilityUpgrade_SetOwningAbility_Params
{
public:
	struct GameplayAbilities_GameplayAbilitySpec Ability;                                           // 0x0(0xF8)(Parm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilityUpgrade.SetListenSlot
struct UValAbilityUpgrade_SetListenSlot_Params
{
public:
	struct GameplayTags_GameplayTag              Slot;                                              // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAbilityUpgrade.SetGeneratedValue
struct UValAbilityUpgrade_SetGeneratedValue_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilityUpgrade.GetListenSlot
struct UValAbilityUpgrade_GetListenSlot_Params
{
public:
	struct GameplayTags_GameplayTag              ReturnValue;                                       // 0x0(0x8)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAbilityUpgrade.GetGeneratedValue
struct UValAbilityUpgrade_GetGeneratedValue_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAbilityUpgrade.EventApplyAbilityUpgrade
struct UValAbilityUpgrade_EventApplyAbilityUpgrade_Params
{
public:
	TSubclassOf<class UValGameplayAbility>       Class;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Value;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3CC7[0x4];                                     // Fixing Size After Last Property  
	class UValGameplayAbility*                   Ability;                                           // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAbilityUpgrade.EventActivateUpgrade
struct UValAbilityUpgrade_EventActivateUpgrade_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAbilityUpgrade.EquipSlotUpdated
struct UValAbilityUpgrade_EquipSlotUpdated_Params
{
public:
	struct GameplayTags_GameplayTag              Slot;                                              // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAbilityUpgrade.ApplyAbilityUpgrade
struct UValAbilityUpgrade_ApplyAbilityUpgrade_Params
{
public:
	class UValGameplayAbility*                   AbilityToUpgrade;                                  // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Value;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3D0E[0x4];                                     // Fixing Size Of Struct 
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAbilityUpgrade.ActivateUpgrade
struct UValAbilityUpgrade_ActivateUpgrade_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValActivityAsset.IsTierUnlocked
struct UValActivityAsset_IsTierUnlocked_Params
{
public:
	int32                                        CurrentLevel;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Tier;                                              // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3D90[0x3];                                     // Fixing Size Of Struct 
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityAsset.GetTotalTiersNeeded
struct UValActivityAsset_GetTotalTiersNeeded_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityAsset.GetTotalProgressNeeded
struct UValActivityAsset_GetTotalProgressNeeded_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValActivityAsset.GetTierUnlockLevel
struct UValActivityAsset_GetTierUnlockLevel_Params
{
public:
	int32                                        Tier;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValActivityAsset.GetTierForProgress
struct UValActivityAsset_GetTierForProgress_Params
{
public:
	int32                                        Progress;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowCompleted;                                    // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3DD4[0x3];                                     // Fixing Size After Last Property  
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValActivityAsset.GetRewardsForTier
struct UValActivityAsset_GetRewardsForTier_Params
{
public:
	int32                                        Tier;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3DE7[0x4];                                     // Fixing Size After Last Property  
	TArray<class URH_ItemAsset*>                 Rewards;                                           // 0x8(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValActivityAsset.GetProgressNeededForTier
struct UValActivityAsset_GetProgressNeededForTier_Params
{
public:
	int32                                        Tier;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCumulative;                                       // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3DFA[0x3];                                     // Fixing Size After Last Property  
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityAsset.GetProgressNeededForCompletion
struct UValActivityAsset_GetProgressNeededForCompletion_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityAsset.GetProgressId
struct UValActivityAsset_GetProgressId_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityAsset.GetItemId
struct UValActivityAsset_GetItemId_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValActivityAsset.GetCompletionIdForTier
struct UValActivityAsset_GetCompletionIdForTier_Params
{
public:
	int32                                        Tier;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityAsset.GetCompletionId
struct UValActivityAsset_GetCompletionId_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValActivityAsset.GetClaimLoot
struct UValActivityAsset_GetClaimLoot_Params
{
public:
	TArray<class URH_ItemAsset*>                 ClaimLoot;                                         // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityAsset.GetActivityType
struct UValActivityAsset_GetActivityType_Params
{
public:
	enum class EActivityType                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValActivityAsset.GetActivityResetIds
struct UValActivityAsset_GetActivityResetIds_Params
{
public:
	TArray<int32>                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityPlayer.TurnInActivity
struct AValActivityPlayer_TurnInActivity_Params
{
public:
	int32                                        ActivityId;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityPlayer.ServerTurnInActivity
struct AValActivityPlayer_ServerTurnInActivity_Params
{
public:
	int32                                        ActivityId;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityPlayer.ServerClaimActivityLoot
struct AValActivityPlayer_ServerClaimActivityLoot_Params
{
public:
	int32                                        ActivityId;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValActivityPlayer.OnPlayerInventoryReady
struct AValActivityPlayer_OnPlayerInventoryReady_Params
{
public:
	class UValPlayerInventory*                   PlayerInventory;                                   // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValActivityPlayer.OnInventoryUpdated
struct AValActivityPlayer_OnInventoryUpdated_Params
{
public:
	TArray<int32>                                ItemIds;                                           // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValActivityPlayer.OnInstanceOwnershipUpdated
struct AValActivityPlayer_OnInstanceOwnershipUpdated_Params
{
public:
	class UValActivityPlayerInstance*            ActivityInstance;                                  // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsUnlocked;                                       // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F59[0x7];                                     // Fixing Size Of Struct 
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValActivityPlayer.OnGameStateSet
struct AValActivityPlayer_OnGameStateSet_Params
{
public:
	class AGameStateBase*                        GameState;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValActivityPlayer.ClientUpdateActivity
struct AValActivityPlayer_ClientUpdateActivity_Params
{
public:
	int32                                        ActivityId;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InventoryCount;                                    // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsOwned;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3F8E[0x3];                                     // Fixing Size Of Struct 
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityPlayer.ClaimActivityLoot
struct AValActivityPlayer_ClaimActivityLoot_Params
{
public:
	int32                                        ActivityId;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValActivityPlayer.AddProgress
struct AValActivityPlayer_AddProgress_Params
{
public:
	int32                                        ActivityId;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.SetProgress
struct UValActivityPlayerInstance_SetProgress_Params
{
public:
	int32                                        Count;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3FFC[0x3];                                     // Fixing Size Of Struct 
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.SetOwnership
struct UValActivityPlayerInstance_SetOwnership_Params
{
public:
	bool                                         bOwned;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.SetActivityFailed
struct UValActivityPlayerInstance_SetActivityFailed_Params
{
public:
	bool                                         Failed;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.ResetProgress
struct UValActivityPlayerInstance_ResetProgress_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.OnTrackerProgress
struct UValActivityPlayerInstance_OnTrackerProgress_Params
{
public:
	int32                                        Count;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.OnActivityTierReached
struct UValActivityPlayerInstance_OnActivityTierReached_Params
{
public:
	int32                                        Tier;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.IsUnlocked
struct UValActivityPlayerInstance_IsUnlocked_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.IsTurnedIn
struct UValActivityPlayerInstance_IsTurnedIn_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.IsProgressUpdated
struct UValActivityPlayerInstance_IsProgressUpdated_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.IsOwnershipUpdated
struct UValActivityPlayerInstance_IsOwnershipUpdated_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.IsCurrentTierUnlocked
struct UValActivityPlayerInstance_IsCurrentTierUnlocked_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.IsComplete
struct UValActivityPlayerInstance_IsComplete_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.IsClaimed
struct UValActivityPlayerInstance_IsClaimed_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.IsActivityInitialized
struct UValActivityPlayerInstance_IsActivityInitialized_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.HasLoadedInventory
struct UValActivityPlayerInstance_HasLoadedInventory_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetTotalProgressNeeded
struct UValActivityPlayerInstance_GetTotalProgressNeeded_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetTierCompletionTime
struct UValActivityPlayerInstance_GetTierCompletionTime_Params
{
public:
	int32                                        Tier;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_40CD[0x4];                                     // Fixing Size After Last Property  
	struct CoreUObject_DateTime                  Timestamp;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_40D0[0x7];                                     // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetProgressTime
struct UValActivityPlayerInstance_GetProgressTime_Params
{
public:
	struct CoreUObject_DateTime                  Timestamp;                                         // 0x0(0x8)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_40E4[0x7];                                     // Fixing Size Of Struct 
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetProgressNeededForTier
struct UValActivityPlayerInstance_GetProgressNeededForTier_Params
{
public:
	int32                                        Tier;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCumulative;                                       // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4100[0x3];                                     // Fixing Size After Last Property  
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetProgressInCurrentTier
struct UValActivityPlayerInstance_GetProgressInCurrentTier_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetPendingProgress
struct UValActivityPlayerInstance_GetPendingProgress_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetOwningController
struct UValActivityPlayerInstance_GetOwningController_Params
{
public:
	class AValPlayerController*                  ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetInitialProgress
struct UValActivityPlayerInstance_GetInitialProgress_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetCustomDataReward
struct UValActivityPlayerInstance_GetCustomDataReward_Params
{
public:
	class UValEquipmentAsset*                    OutEquipmentAsset;                                 // 0x0(0x8)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Quantity;                                          // 0x8(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERarity                           Rarity;                                            // 0xC(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xD(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4151[0x2];                                     // Fixing Size Of Struct 
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetCurrentTierUnlockLevel
struct UValActivityPlayerInstance_GetCurrentTierUnlockLevel_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetCurrentTier
struct UValActivityPlayerInstance_GetCurrentTier_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetCurrentProgress
struct UValActivityPlayerInstance_GetCurrentProgress_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetCompletionTime
struct UValActivityPlayerInstance_GetCompletionTime_Params
{
public:
	struct CoreUObject_DateTime                  Timestamp;                                         // 0x0(0x8)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_418B[0x7];                                     // Fixing Size Of Struct 
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetActivityTracker
struct UValActivityPlayerInstance_GetActivityTracker_Params
{
public:
	class UValActivityTracker*                   ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetActivityPlayer
struct UValActivityPlayerInstance_GetActivityPlayer_Params
{
public:
	class AValActivityPlayer*                    ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetActivity
struct UValActivityPlayerInstance_GetActivity_Params
{
public:
	class UValActivityAsset*                     ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.GetAcquiredTime
struct UValActivityPlayerInstance_GetAcquiredTime_Params
{
public:
	struct CoreUObject_DateTime                  Timestamp;                                         // 0x0(0x8)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_41BF[0x7];                                     // Fixing Size Of Struct 
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValActivityPlayerInstance.AddProgress
struct UValActivityPlayerInstance_AddProgress_Params
{
public:
	int32                                        Count;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_41CF[0x3];                                     // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValActivityTracker.TierReached
struct UValActivityTracker_TierReached_Params
{
public:
	class UValActivityPlayerInstance*            PlayerInstance;                                    // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Tier;                                              // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4223[0x4];                                     // Fixing Size Of Struct 
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityTracker.GetProgressInCurrentTier
struct UValActivityTracker_GetProgressInCurrentTier_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityTracker.GetPendingProgress
struct UValActivityTracker_GetPendingProgress_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityTracker.GetInitialProgress
struct UValActivityTracker_GetInitialProgress_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityTracker.GetCurrentProgress
struct UValActivityTracker_GetCurrentProgress_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValActivityTracker.GetActivityId
struct UValActivityTracker_GetActivityId_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValActivityTracker.CanAddProgress
struct UValActivityTracker_CanAddProgress_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x118 (0x118 - 0x0)
// Function Valhalla.ValActivityTracker_Damage.OnDamage
struct UValActivityTracker_Damage_OnDamage_Params
{
public:
	struct CoreUObject_Guid                      PlayerUuid;                                        // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct Valhalla_DamageData                   DamageData;                                        // 0x10(0x100)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                Target;                                            // 0x110(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Valhalla.ValActivityTracker_DogTag.OnDogTagFound
struct UValActivityTracker_DogTag_OnDogTagFound_Params
{
public:
	bool                                         IsFriendly;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_42DF[0x3];                                     // Fixing Size After Last Property  
	int32                                        Split;                                             // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct Valhalla_InventoryItem                InventoryItem;                                     // 0x8(0xC8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	enum class EPlayerLevelType                  LevelType;                                         // 0xD0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_42E2[0x7];                                     // Fixing Size Of Struct 
};

// 0x108 (0x108 - 0x0)
// Function Valhalla.ValActivityTracker_Elimination.OnElimination
struct UValActivityTracker_Elimination_OnElimination_Params
{
public:
	struct Valhalla_DamageData                   DamageData;                                        // 0x0(0x100)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                Target;                                            // 0x100(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.UpdatePerceptionSightConfig
struct UValAIBlueprintHelperLibrary_UpdatePerceptionSightConfig_Params
{
public:
	class AAIController*                         Controller;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SightRadius;                                       // 0x8(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LoseSightRadius;                                   // 0xC(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PeripheralVisionAngleDegrees;                      // 0x10(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_43A5[0x4];                                     // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.UpdatePerceptionHearingConfig
struct UValAIBlueprintHelperLibrary_UpdatePerceptionHearingConfig_Params
{
public:
	class AAIController*                         Controller;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HearingRadius;                                     // 0x8(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_43AF[0x4];                                     // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.UnregisterAsCoverWithSightManager
struct UValAIBlueprintHelperLibrary_UnregisterAsCoverWithSightManager_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                InActor;                                           // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.SyncLoadBotData
struct UValAIBlueprintHelperLibrary_SyncLoadBotData_Params
{
public:
	class UValBotData*                           BotData;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.SpawnBotGroup
struct UValAIBlueprintHelperLibrary_SpawnBotGroup_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UValBotWaveConfig*                     SpawnConfig;                                       // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct CoreUObject_Transform>         SpawnLocations;                                    // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         bTreatNullBotDataAsValid;                          // 0x20(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_43D4[0x7];                                     // Fixing Size After Last Property  
	TArray<class AValCharacter*>                 OutBots;                                           // 0x28(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class AValBotSpawnVolume*                    OwningVolume;                                      // 0x38(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.SpawnAIFromClassWithData
struct UValAIBlueprintHelperLibrary_SpawnAIFromClassWithData_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class APawn>                     PawnClass;                                         // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UValBotData*                           ConfigData;                                        // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBehaviorTree*                         BehaviorTree;                                      // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    Location;                                          // 0x20(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Rotator                   Rotation;                                          // 0x38(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bNoCollisionFail;                                  // 0x50(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_43EF[0x7];                                     // Fixing Size After Last Property  
	class AActor*                                Owner;                                             // 0x58(0x8)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                 ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.SetCanEverAffectNavigation
struct UValAIBlueprintHelperLibrary_SetCanEverAffectNavigation_Params
{
public:
	class UActorComponent*                       Component;                                         // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanAffectNavigation;                              // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_43F6[0x7];                                     // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.RegisterAsCoverWithSightManager
struct UValAIBlueprintHelperLibrary_RegisterAsCoverWithSightManager_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                InActor;                                           // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.PredictTargetLocation
struct UValAIBlueprintHelperLibrary_PredictTargetLocation_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                TargetActor;                                       // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PredictionTime;                                    // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_43FF[0x4];                                     // Fixing Size After Last Property  
	struct CoreUObject_Vector                    ReturnValue;                                       // 0x18(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.IsLocationWithinBuilding
struct UValAIBlueprintHelperLibrary_IsLocationWithinBuilding_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    InLocation;                                        // 0x8(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4403[0x7];                                     // Fixing Size Of Struct 
};

// 0x40 (0x40 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.IsLocationOnNavMesh
struct UValAIBlueprintHelperLibrary_IsLocationOnNavMesh_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    InLocation;                                        // 0x8(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    OutClosestNavMeshLocation;                         // 0x20(0x18)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x38(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_440A[0x7];                                     // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.IsCybridTeamID
struct UValAIBlueprintHelperLibrary_IsCybridTeamID_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TeamNum;                                           // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_440F[0x3];                                     // Fixing Size Of Struct 
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.IsCybridCalmTowardsTarget
struct UValAIBlueprintHelperLibrary_IsCybridCalmTowardsTarget_Params
{
public:
	class AActor*                                CybridActor;                                       // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                TargetActor;                                       // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4414[0x7];                                     // Fixing Size Of Struct 
};

// 0x60 (0x60 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.HasEffectiveAim
struct UValAIBlueprintHelperLibrary_HasEffectiveAim_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    MuzzleLocation;                                    // 0x8(0x18)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                TargetActor;                                       // 0x20(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    EffectiveAimLocation;                              // 0x28(0x18)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    PredictedLocation;                                 // 0x40(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x58(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_441A[0x7];                                     // Fixing Size Of Struct 
};

// 0x78 (0x78 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetSpawnBotGroupData
struct UValAIBlueprintHelperLibrary_GetSpawnBotGroupData_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UValBotWaveConfig*                     SpawnConfig;                                       // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct GameplayTags_GameplayTag, struct Valhalla_BotTransformData> SpawnLocations;                                    // 0x10(0x50)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         bTreatNullBotDataAsValid;                          // 0x60(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_442E[0x3];                                     // Fixing Size After Last Property  
	float                                        SpawnPercentModifier;                              // 0x64(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct Valhalla_ValBotWaveSetSpawnData> OutBotData;                                        // 0x68(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetSlopeAngleFromActor
struct UValAIBlueprintHelperLibrary_GetSlopeAngleFromActor_Params
{
public:
	class AActor*                                SourceActor;                                       // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    EndOffsetFromActorLocation;                        // 0x8(0x18)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutSlopeAngle;                                     // 0x20(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x24(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4436[0x3];                                     // Fixing Size Of Struct 
};

// 0x40 (0x40 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetSlopeAngle
struct UValAIBlueprintHelperLibrary_GetSlopeAngle_Params
{
public:
	struct CoreUObject_Vector                    TraceStart;                                        // 0x0(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    TraceEnd;                                          // 0x18(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                SourceActor;                                       // 0x30(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutSlopeAngle;                                     // 0x38(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x3C(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_443D[0x3];                                     // Fixing Size Of Struct 
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetRotationTowardsTarget
struct UValAIBlueprintHelperLibrary_GetRotationTowardsTarget_Params
{
public:
	class AValCharacter*                         ValOwner;                                          // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Rotator                   Rotation;                                          // 0x8(0x18)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4442[0x7];                                     // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetPerceptionHearingRadius
struct UValAIBlueprintHelperLibrary_GetPerceptionHearingRadius_Params
{
public:
	class AAIController*                         Controller;                                        // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_444A[0x4];                                     // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetHazardsTeam
struct UValAIBlueprintHelperLibrary_GetHazardsTeam_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATeamState*                            ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetDoorExitPoints
struct UValAIBlueprintHelperLibrary_GetDoorExitPoints_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                    ActorClass;                                        // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        OutActors;                                         // 0x10(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_444D[0x7];                                     // Fixing Size Of Struct 
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetAlarmSpawnWave
struct UValAIBlueprintHelperLibrary_GetAlarmSpawnWave_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValUtopiaConstructor*                 OwningConstructor;                                 // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UValBotWaveConfig*>             SpawnWaves;                                        // 0x10(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4454[0x7];                                     // Fixing Size Of Struct 
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetAlarmSpawnConfig
struct UValAIBlueprintHelperLibrary_GetAlarmSpawnConfig_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValUtopiaConstructor*                 OwningConstructor;                                 // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UValBotWaveConfig*                     ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetAITeam
struct UValAIBlueprintHelperLibrary_GetAITeam_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATeamState*                            ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetActorPredictedHeadLocation
struct UValAIBlueprintHelperLibrary_GetActorPredictedHeadLocation_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    PredictedLocation;                                 // 0x8(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    ReturnValue;                                       // 0x20(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetActorHeadLocation
struct UValAIBlueprintHelperLibrary_GetActorHeadLocation_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetAccelerationFromJetpack
struct UValAIBlueprintHelperLibrary_GetAccelerationFromJetpack_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                TargetActor;                                       // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PredictionTime;                                    // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4463[0x4];                                     // Fixing Size After Last Property  
	struct CoreUObject_Vector                    ReturnValue;                                       // 0x18(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.GetAccelerationFromFalling
struct UValAIBlueprintHelperLibrary_GetAccelerationFromFalling_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                TargetActor;                                       // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PredictionTime;                                    // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_446C[0x4];                                     // Fixing Size After Last Property  
	struct CoreUObject_Vector                    ReturnValue;                                       // 0x18(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.FindNearbyCoverFromSightManager
struct UValAIBlueprintHelperLibrary_FindNearbyCoverFromSightManager_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    Location;                                          // 0x8(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0x20(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4474[0x4];                                     // Fixing Size After Last Property  
	TArray<class AActor*>                        OutCoverActors;                                    // 0x28(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.DoesPathExistToTarget
struct UValAIBlueprintHelperLibrary_DoesPathExistToTarget_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                SourceActor;                                       // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                TargetActor;                                       // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4476[0x7];                                     // Fixing Size Of Struct 
};

// 0x30 (0x30 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.DoesPathExistToLocation
struct UValAIBlueprintHelperLibrary_DoesPathExistToLocation_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                SourceActor;                                       // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    TargetLocation;                                    // 0x10(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_447C[0x7];                                     // Fixing Size Of Struct 
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.CalculateBotReactionTimeForTarget
struct UValAIBlueprintHelperLibrary_CalculateBotReactionTimeForTarget_Params
{
public:
	class UValBotData*                           BotData;                                           // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValCharacter*                         Target;                                            // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x10(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4482[0x4];                                     // Fixing Size Of Struct 
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAIBlueprintHelperLibrary.CalculateBotAccuracyForTarget
struct UValAIBlueprintHelperLibrary_CalculateBotAccuracyForTarget_Params
{
public:
	class UValBotData*                           BotData;                                           // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValCharacter*                         Target;                                            // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x10(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4488[0x4];                                     // Fixing Size Of Struct 
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAIController.UpdateBlackboardKeyValueAsVector
struct AValAIController_UpdateBlackboardKeyValueAsVector_Params
{
public:
	class FName                                  Key;                                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    Value;                                             // 0x8(0x18)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIController.UpdateBlackboardKeyValueAsObject
struct AValAIController_UpdateBlackboardKeyValueAsObject_Params
{
public:
	class FName                                  Key;                                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               Value;                                             // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValAIController.UpdateBlackboardKeyValueAsEnum
struct AValAIController_UpdateBlackboardKeyValueAsEnum_Params
{
public:
	class FName                                  Key;                                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Value;                                             // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_44A3[0x3];                                     // Fixing Size Of Struct 
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValAIController.UpdateBlackboardKeyValueAsBool
struct AValAIController_UpdateBlackboardKeyValueAsBool_Params
{
public:
	class FName                                  Key;                                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Value;                                             // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_44A8[0x3];                                     // Fixing Size Of Struct 
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAIController.SetTetherRadius
struct AValAIController_SetTetherRadius_Params
{
public:
	float                                        Radius;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIController.SetBotLeader
struct AValAIController_SetBotLeader_Params
{
public:
	class AValCharacter*                         Leader;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIController.RespawnAIDeferred
struct AValAIController_RespawnAIDeferred_Params
{
public:
	float                                        Time;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFindRespawnPoint;                                 // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_44C8[0x3];                                     // Fixing Size Of Struct 
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAIController.Respawn
struct AValAIController_Respawn_Params
{
public:
	bool                                         bFindRespawnPoint;                                 // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIController.OnTeamChanged
struct AValAIController_OnTeamChanged_Params
{
public:
	int32                                        OldTeamId;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NewTeamId;                                         // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIController.OnReviveBeaconStarted
struct AValAIController_OnReviveBeaconStarted_Params
{
public:
	class AValReviveBeacon*                      Beacon;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIController.OnReviveBeaconDestroyed
struct AValAIController_OnReviveBeaconDestroyed_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIController.OnReviveBeacon
struct AValAIController_OnReviveBeacon_Params
{
public:
	class AValReviveBeacon*                      Beacon;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAIController.OnPortalState
struct AValAIController_OnPortalState_Params
{
public:
	enum class EGameObjectiveState               PortalState;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIController.OnCharacterSetupComplete
struct AValAIController_OnCharacterSetupComplete_Params
{
public:
	class AValCharacter*                         Bot;                                               // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIController.OnBotLeaderSet
struct AValAIController_OnBotLeaderSet_Params
{
public:
	class AValCharacter*                         Leader;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAIController.IsPlayerBotController
struct AValAIController_IsPlayerBotController_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAIController.IsInBuilding
struct AValAIController_IsInBuilding_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIController.GetValCharacter
struct AValAIController_GetValCharacter_Params
{
public:
	class AValCharacter*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIController.GetBotConfigData
struct AValAIController_GetBotConfigData_Params
{
public:
	class UValBotData*                           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIController.AddNewReviveBeacon
struct AValAIController_AddNewReviveBeacon_Params
{
public:
	class AValReviveBeacon*                      Beacon;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIController_NPC.StartBehaviorTree
struct AValAIController_NPC_StartBehaviorTree_Params
{
public:
	class AValCharacter*                         ValChar;                                           // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIFSM.StartMachineWithStartStateOverride
struct UValAIFSM_StartMachineWithStartStateOverride_Params
{
public:
	class AValCharacter*                         InBot;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              StartStateOverrideTag;                             // 0x8(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIFSM.StartMachine
struct UValAIFSM_StartMachine_Params
{
public:
	class AValCharacter*                         InBot;                                             // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAIFSM.IsStarted
struct UValAIFSM_IsStarted_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAIFSM.IsDebug
struct UValAIFSM_IsDebug_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValAIFSM.GotoState
struct UValAIFSM_GotoState_Params
{
public:
	struct GameplayTags_GameplayTag              NextStateTag;                                      // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForce;                                            // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_458A[0x3];                                     // Fixing Size Of Struct 
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIFSM.GetTag
struct UValAIFSM_GetTag_Params
{
public:
	struct GameplayTags_GameplayTag              ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIFSM.GetState
struct UValAIFSM_GetState_Params
{
public:
	struct GameplayTags_GameplayTag              InTag;                                             // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UValAIFSM_State*                       ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIFSM.GetDebugDisplayNameBP
struct UValAIFSM_GetDebugDisplayNameBP_Params
{
public:
	class FString                                OutDisplayName;                                    // 0x0(0x10)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIFSM.GetCharacter
struct UValAIFSM_GetCharacter_Params
{
public:
	class AValCharacter*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIFSM.CollectChildFSMsAndSelf
struct UValAIFSM_CollectChildFSMsAndSelf_Params
{
public:
	TArray<class UValAIFSM*>                     OutAllFSMs;                                        // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAIFSM_State.ResetStateTimeout
struct UValAIFSM_State_ResetStateTimeout_Params
{
public:
	float                                        NewTimeoutTime;                                    // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAIFSM_State.IsActive
struct UValAIFSM_State_IsActive_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIFSM_State.GetTag
struct UValAIFSM_State_GetTag_Params
{
public:
	struct GameplayTags_GameplayTag              ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAIFSM_State.GetMinTimeInState
struct UValAIFSM_State_GetMinTimeInState_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIFSM_State.GetCharacter
struct UValAIFSM_State_GetCharacter_Params
{
public:
	class AValCharacter*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAIFSM_State.CheckForTransition
struct UValAIFSM_State_CheckForTransition_Params
{
public:
	struct GameplayTags_GameplayTagContainer     ActiveTransitionTags;                              // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIFSM_State.AddActiveEffectToRemovalList
struct UValAIFSM_State_AddActiveEffectToRemovalList_Params
{
public:
	struct GameplayAbilities_ActiveGameplayEffectHandle ActiveHandle;                                      // 0x0(0x8)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIFSMComponent.StartMachineWithStartStateOverride
struct UValAIFSMComponent_StartMachineWithStartStateOverride_Params
{
public:
	struct GameplayTags_GameplayTag              StartStateOverrideTag;                             // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAIFSMComponent.RegisterStartStateHandler
struct UValAIFSMComponent_RegisterStartStateHandler_Params
{
public:
	struct GameplayTags_GameplayTag              FSM;                                               // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              State;                                             // 0x8(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           HandlerDelegate;                                   // 0x10(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAIFSMComponent.RegisterEndStateHandler
struct UValAIFSMComponent_RegisterEndStateHandler_Params
{
public:
	struct GameplayTags_GameplayTag              FSM;                                               // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              State;                                             // 0x8(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           HandlerDelegate;                                   // 0x10(0x10)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAIFSMComponent.IsStarted
struct UValAIFSMComponent_IsStarted_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAIFSMComponent.GetAllFSMs
struct UValAIFSMComponent_GetAllFSMs_Params
{
public:
	TArray<class UValAIFSM*>                     OutAllFSMs;                                        // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIFSMComponent.GetAIAudioCueAgent
struct UValAIFSMComponent_GetAIAudioCueAgent_Params
{
public:
	class UValAIAudioCueAgent*                   ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAimAssistComponent.OnPawnChanged
struct UValAimAssistComponent_OnPawnChanged_Params
{
public:
	class APawn*                                 Pawn;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAimAssistComponent.OnOwnerEquippedWeaponUpdated
struct UValAimAssistComponent_OnOwnerEquippedWeaponUpdated_Params
{
public:
	struct GameplayTags_GameplayTag              EquipSlot;                                         // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValVisibleToAIComponent.SetVisibilityType
struct UValVisibleToAIComponent_SetVisibilityType_Params
{
public:
	class FName                                  NewType;                                           // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValVisibleToAIComponent.IsVisibleTo
struct UValVisibleToAIComponent_IsVisibleTo_Params
{
public:
	class FName                                  SupportedType;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4625[0x3];                                     // Fixing Size Of Struct 
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValVisibleToAIComponent.GetVisibilityType
struct UValVisibleToAIComponent_GetVisibilityType_Params
{
public:
	class FName                                  ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAICoverComponent.OnSightManagerReady
struct UValAICoverComponent_OnSightManagerReady_Params
{
public:
	class AValSightManager*                      PSightManager;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAIVisionObscurerComponent.OnSightManagerReady
struct UValAIVisionObscurerComponent_OnSightManagerReady_Params
{
public:
	class AValSightManager*                      PSightManager;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAISightComponent.UpdateSightRadius
struct UValAISightComponent_UpdateSightRadius_Params
{
public:
	float                                        NewSightRadius;                                    // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4642[0x3];                                     // Fixing Size Of Struct 
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAISightComponent.UpdatePeripheralVisionAngle
struct UValAISightComponent_UpdatePeripheralVisionAngle_Params
{
public:
	float                                        NewPeripheralVisionAngleDegrees;                   // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4645[0x3];                                     // Fixing Size Of Struct 
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAISightComponent.UpdateLoseSightRadius
struct UValAISightComponent_UpdateLoseSightRadius_Params
{
public:
	float                                        NewLoseSightRadius;                                // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4647[0x3];                                     // Fixing Size Of Struct 
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAISightComponent.SightCheckHandler
struct UValAISightComponent_SightCheckHandler_Params
{
public:
	class AActor*                                Target;                                            // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class UValAIVisionObscurerComponent>> VisionObscurers;                                   // 0x8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAISightComponent.ShouldSee
struct UValAISightComponent_ShouldSee_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAISightComponent.SetVisionType
struct UValAISightComponent_SetVisionType_Params
{
public:
	class FName                                  NewType;                                           // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAISightComponent.SetCustomViewLocationOffset
struct UValAISightComponent_SetCustomViewLocationOffset_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAISightComponent.SetCanSee
struct UValAISightComponent_SetCanSee_Params
{
public:
	bool                                         bInCanSee;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValAISightComponent.OnViewedActorTagChanged
struct UValAISightComponent_OnViewedActorTagChanged_Params
{
public:
	struct GameplayTags_GameplayTag              InTag;                                             // 0x0(0x8)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NewCount;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAISightComponent.OnViewedActorDied
struct UValAISightComponent_OnViewedActorDied_Params
{
public:
	float                                        TimeToRespawn;                                     // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4659[0x4];                                     // Fixing Size After Last Property  
	class AValCharacter*                         Pawn;                                              // 0x8(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAISightComponent.IsBlinded
struct UValAISightComponent_IsBlinded_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAISightComponent.GetVisionType
struct UValAISightComponent_GetVisionType_Params
{
public:
	class FName                                  ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAISightComponent.GetPeripheralVisionAngle
struct UValAISightComponent_GetPeripheralVisionAngle_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAISightComponent.GetNearClippingRadius
struct UValAISightComponent_GetNearClippingRadius_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAISightComponent.GetMinRange
struct UValAISightComponent_GetMinRange_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAISightComponent.GetMaxRange
struct UValAISightComponent_GetMaxRange_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAISightComponent.GetLoseSightRadius
struct UValAISightComponent_GetLoseSightRadius_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAISightComponent.GetDefaultSightRadius
struct UValAISightComponent_GetDefaultSightRadius_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAISightComponent.ClearGameplayTagEvents
struct UValAISightComponent_ClearGameplayTagEvents_Params
{
public:
	class AActor*                                LostActor;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAISightComponent.BindGameplayTagEvents
struct UValAISightComponent_BindGameplayTagEvents_Params
{
public:
	class AActor*                                ViewedActor;                                       // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValSquad.UpdateForMember
struct UValSquad_UpdateForMember_Params
{
public:
	class AValCharacter*                         InMember;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValSquad.ToggleRecord
struct UValSquad_ToggleRecord_Params
{
public:
	bool                                         bOn;                                               // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValSquad.GetLeader
struct UValSquad_GetLeader_Params
{
public:
	class AValCharacter*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValSquad.DumpLocationRecord
struct UValSquad_DumpLocationRecord_Params
{
public:
	TArray<struct CoreUObject_Vector>            OutLocationCache;                                  // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Valhalla.ValSquad.ChooseNextWaypoint
struct UValSquad_ChooseNextWaypoint_Params
{
public:
	class AValCharacter*                         InMember;                                          // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMeanderToCenter;                                  // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_469B[0x7];                                     // Fixing Size After Last Property  
	struct CoreUObject_Vector                    OutWaypoint;                                       // 0x10(0x18)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_469C[0x7];                                     // Fixing Size Of Struct 
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAkRoomObject.SetAssociatedAkRoom
struct IValAkRoomObject_SetAssociatedAkRoom_Params
{
public:
	class AValAkRoom*                            Room;                                              // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValAkRoomObject.AkGetLocation
struct IValAkRoomObject_AkGetLocation_Params
{
public:
	struct CoreUObject_Vector                    ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValArtifactDeposit.OnDepositComplete
struct AValArtifactDeposit_OnDepositComplete_Params
{
public:
	TArray<struct Valhalla_PendingItem>          ItemsDeposited;                                    // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValArtifactDeposit.Interact
struct AValArtifactDeposit_Interact_Params
{
public:
	class AValCharacter*                         Initiator;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValArtifactDeposit.GetInteractType
struct AValArtifactDeposit_GetInteractType_Params
{
public:
	enum class EInteractType                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValArtifactDeposit.GetInteractText
struct AValArtifactDeposit_GetInteractText_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValArtifactDeposit.GetInteractComponent
struct AValArtifactDeposit_GetInteractComponent_Params
{
public:
	class UPrimitiveComponent*                   ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValArtifactDeposit.CanInteract
struct AValArtifactDeposit_CanInteract_Params
{
public:
	class AValCharacter*                         Initiator;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_46E0[0x7];                                     // Fixing Size Of Struct 
};

// 0xC (0xC - 0x0)
// Function Valhalla.ValClassComponentBase.HasModsForTag
struct UValClassComponentBase_HasModsForTag_Params
{
public:
	struct GameplayTags_GameplayTag              TagToCheck;                                        // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_46EB[0x3];                                     // Fixing Size Of Struct 
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValClassComponentBase.GetValCharacter
struct UValClassComponentBase_GetValCharacter_Params
{
public:
	class AValCharacter*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValClassComponentBase.GetPassivePropertyModValues
struct UValClassComponentBase_GetPassivePropertyModValues_Params
{
public:
	struct GameplayTags_GameplayTag              PassiveIdTag;                                      // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              PropertyTag;                                       // 0x8(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                OutValues;                                         // 0x10(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValClassComponentBase.ApplyDamageResistanceModifier
struct UValClassComponentBase_ApplyDamageResistanceModifier_Params
{
public:
	float                                        OutPercentModifier;                                // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutFlatModifier;                                   // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutShieldModifier;                                 // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Damage;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayEffectContextHandle DamageContext;                                     // 0x10(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValClassComponentBase.ApplyDamageOutputModifier
struct UValClassComponentBase_ApplyDamageOutputModifier_Params
{
public:
	float                                        OutPercentModifier;                                // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutFlatModifier;                                   // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Damage;                                            // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_46FC[0x4];                                     // Fixing Size After Last Property  
	struct GameplayAbilities_GameplayEffectContextHandle DamageContext;                                     // 0x10(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValEquipmentAsset.OnlyBuyInBundles
struct UValEquipmentAsset_OnlyBuyInBundles_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValEquipmentAsset.GetBuyPrice
struct UValEquipmentAsset_GetBuyPrice_Params
{
public:
	enum class ERarity                           InRarity;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4712[0x3];                                     // Fixing Size After Last Property  
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function Valhalla.ValEquipmentAsset.GetAvailableBundles
struct UValEquipmentAsset_GetAvailableBundles_Params
{
public:
	TArray<struct Valhalla_VendorItemBundle>     OutAvailableBundles;                               // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	enum class ERarity                           InRarity;                                          // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_471A[0x7];                                     // Fixing Size Of Struct 
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAttributeActorBase.SetHealth
struct AValAttributeActorBase_SetHealth_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAttributeActorBase.OnRep_TeamId
struct AValAttributeActorBase_OnRep_TeamId_Params
{
public:
	int32                                        OldTeamId;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x100 (0x100 - 0x0)
// Function Valhalla.ValAttributeActorBase.OnDamaged
struct AValAttributeActorBase_OnDamaged_Params
{
public:
	struct Valhalla_DamageData                   DamageData;                                        // 0x0(0x100)(Parm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAttributeActorBase.IsAlive
struct AValAttributeActorBase_IsAlive_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAttributeActorBase.GetTemporaryShields
struct AValAttributeActorBase_GetTemporaryShields_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAttributeActorBase.GetTemporaryHealth
struct AValAttributeActorBase_GetTemporaryHealth_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAttributeActorBase.GetShieldsMax
struct AValAttributeActorBase_GetShieldsMax_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAttributeActorBase.GetShields
struct AValAttributeActorBase_GetShields_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAttributeActorBase.GetShieldPercent
struct AValAttributeActorBase_GetShieldPercent_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAttributeActorBase.GetHealthPercent
struct AValAttributeActorBase_GetHealthPercent_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAttributeActorBase.GetHealthMax
struct AValAttributeActorBase_GetHealthMax_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function Valhalla.ValAttributeActorBase.GetHealth
struct AValAttributeActorBase_GetHealth_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAttributeActorBase.GetAttributes
struct AValAttributeActorBase_GetAttributes_Params
{
public:
	class UValAttributeSet*                      ReturnValue;                                       // 0x0(0x8)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAttributeActorBase.CanBeHealed
struct AValAttributeActorBase_CanBeHealed_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAttributeActorBase.CanBeDamaged
struct AValAttributeActorBase_CanBeDamaged_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAttributeActorBase.AlwaysDamageable
struct AValAttributeActorBase_AlwaysDamageable_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAttributeActor.GetMesh
struct AValAttributeActor_GetMesh_Params
{
public:
	class USkeletalMeshComponent*                ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function Valhalla.ValAttributeActor.GetCapsuleComponent
struct AValAttributeActor_GetCapsuleComponent_Params
{
public:
	class UCapsuleComponent*                     ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_UniversalAbilityCooldownModifier
struct UValAttributeSet_OnRep_UniversalAbilityCooldownModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldUniversalAbilityCooldownModifier;               // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_TrapDamageMitigationMultiplier
struct UValAttributeSet_OnRep_TrapDamageMitigationMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldTrapDamageMitigationMultiplier;                 // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_TimeUntilPassiveReload
struct UValAttributeSet_OnRep_TimeUntilPassiveReload_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldTimeUntilPassiveReload;                         // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_TimeBetweenBursts
struct UValAttributeSet_OnRep_TimeBetweenBursts_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldTimeBetweenBursts;                              // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ThrownSpeedMultiplier
struct UValAttributeSet_OnRep_ThrownSpeedMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldThrowSpeed;                                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_TemporaryShield
struct UValAttributeSet_OnRep_TemporaryShield_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldTemporaryShield;                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_TemporaryHealth
struct UValAttributeSet_OnRep_TemporaryHealth_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldTemporaryHealth;                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_TauntAggroRange
struct UValAttributeSet_OnRep_TauntAggroRange_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldTauntAggroRange;                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_StimSpeedMultiplier
struct UValAttributeSet_OnRep_StimSpeedMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldStimSpeedMultiplier;                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_StealthEnergyConsumptionRate
struct UValAttributeSet_OnRep_StealthEnergyConsumptionRate_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldStealthEnergyConsumptionRate;                   // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_StealthDurationModifier
struct UValAttributeSet_OnRep_StealthDurationModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldStealthDurationModifier;                        // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_StartingReserveAmmo
struct UValAttributeSet_OnRep_StartingReserveAmmo_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldStartingReserveAmmo;                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_StartingClipAmmo
struct UValAttributeSet_OnRep_StartingClipAmmo_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldStartingClipAmmo;                               // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_StaggerResistance
struct UValAttributeSet_OnRep_StaggerResistance_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldStaggerResistance;                              // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_StaggerImpact
struct UValAttributeSet_OnRep_StaggerImpact_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldStaggerImpact;                                  // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_SprintSpeedMultiplier
struct UValAttributeSet_OnRep_SprintSpeedMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldSprintSpeedMultiplier;                          // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_SpecialtyAmmoPickupMultiplier
struct UValAttributeSet_OnRep_SpecialtyAmmoPickupMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldSpecialtyAmmoPickupMultiplier;                  // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_SoundDetectableRange
struct UValAttributeSet_OnRep_SoundDetectableRange_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldSoundDetectableRange;                           // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_SlideSpeedMultiplier
struct UValAttributeSet_OnRep_SlideSpeedMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldSlideSpeedMultiplier;                           // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_SkiInitialImpulse
struct UValAttributeSet_OnRep_SkiInitialImpulse_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldSkiInitialImpulse;                              // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ShotsPerFire
struct UValAttributeSet_OnRep_ShotsPerFire_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldShotsPerFire;                                   // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ShieldRegenAmount
struct UValAttributeSet_OnRep_ShieldRegenAmount_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldShieldRegenAmount;                              // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ShieldPenetrationMitigationMultiplier
struct UValAttributeSet_OnRep_ShieldPenetrationMitigationMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldShieldPenetrationMitigationMultiplier;          // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ShieldPenetration
struct UValAttributeSet_OnRep_ShieldPenetration_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldShieldPenetrationMultiplier;                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ShieldPackUseSpeedModifier
struct UValAttributeSet_OnRep_ShieldPackUseSpeedModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldShieldPackUseSpeedModifier;                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ShieldPackModifier
struct UValAttributeSet_OnRep_ShieldPackModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldShieldPackModifier;                             // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ShieldPackMax
struct UValAttributeSet_OnRep_ShieldPackMax_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldShieldPackMax;                                  // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ShieldMax
struct UValAttributeSet_OnRep_ShieldMax_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldShieldMax;                                      // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ShieldDamageOutputModifier
struct UValAttributeSet_OnRep_ShieldDamageOutputModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldShieldDamageOutputModifier;                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ShieldBroke
struct UValAttributeSet_OnRep_ShieldBroke_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldShieldBroke;                                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_Shield
struct UValAttributeSet_OnRep_Shield_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldShield;                                         // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_SelfDamageMitigationModifier
struct UValAttributeSet_OnRep_SelfDamageMitigationModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldSelfDamageMitigationModifier;                   // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ScrapPickupMultiplier
struct UValAttributeSet_OnRep_ScrapPickupMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldScrapPickupMultiplier;                          // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_RespawnPointInteractTimeMultiplier
struct UValAttributeSet_OnRep_RespawnPointInteractTimeMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldRespawnPointInteractTimeMultiplier;             // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ReserveAmmoMax
struct UValAttributeSet_OnRep_ReserveAmmoMax_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldReserveAmmoMax;                                 // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ReloadTimeMultiplier
struct UValAttributeSet_OnRep_ReloadTimeMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldReloadTimeMultiplier;                           // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ReloadSpeed
struct UValAttributeSet_OnRep_ReloadSpeed_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldReloadSpeed;                                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ReloadMinimum
struct UValAttributeSet_OnRep_ReloadMinimum_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldReloadMinimum;                                  // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_RangedDamageMitigationModifier
struct UValAttributeSet_OnRep_RangedDamageMitigationModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldRangedDamageMitigationModifier;                 // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_QuickMeleeDamage
struct UValAttributeSet_OnRep_QuickMeleeDamage_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldQuickMeleeDamage;                               // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ProjectileSpeedMultiplier
struct UValAttributeSet_OnRep_ProjectileSpeedMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldProjectileSpeedMultiplier;                      // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_PrimaryFireInputBufferTime
struct UValAttributeSet_OnRep_PrimaryFireInputBufferTime_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldPrimaryFireInputBufferTime;                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_PrimaryAmmoPickupMultiplier
struct UValAttributeSet_OnRep_PrimaryAmmoPickupMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldPrimaryAmmoPickupMultiplier;                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_PrefireTime
struct UValAttributeSet_OnRep_PrefireTime_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldPrefireTime;                                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_PortalInteractTimeMultiplier
struct UValAttributeSet_OnRep_PortalInteractTimeMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldInteractTimeMultiplier;                         // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_PickupRangeMultiplier
struct UValAttributeSet_OnRep_PickupRangeMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldPickupRangeMultiplier;                          // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_PerceptionSightDistance
struct UValAttributeSet_OnRep_PerceptionSightDistance_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldPerceptionSightDistance;                        // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_PerceptionPeripheralVisionHalfAngle
struct UValAttributeSet_OnRep_PerceptionPeripheralVisionHalfAngle_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldPerceptionPeripheralVisionHalfAngle;            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_PerceptionLoseSightDistance
struct UValAttributeSet_OnRep_PerceptionLoseSightDistance_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldPerceptionLoseSightDistance;                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_PerceptionHearingDistance
struct UValAttributeSet_OnRep_PerceptionHearingDistance_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldPerceptionHearingDistance;                      // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_PendingBoostMax
struct UValAttributeSet_OnRep_PendingBoostMax_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldPendingBoostMax;                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_OxygenMaximum
struct UValAttributeSet_OnRep_OxygenMaximum_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldOxygenMaximum;                                  // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_OxygenConsumeRateMultiplier
struct UValAttributeSet_OnRep_OxygenConsumeRateMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldOxygenConsumeRateMultiplier;                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_OxygenConsumeRate
struct UValAttributeSet_OnRep_OxygenConsumeRate_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldOxygenConsumeRate;                              // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_OverallDamageModifier
struct UValAttributeSet_OnRep_OverallDamageModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldOverallDamageModifier;                          // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_NonPlayerDamageModifier
struct UValAttributeSet_OnRep_NonPlayerDamageModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldNonPlayerDamageModifier;                        // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_MovingSpread
struct UValAttributeSet_OnRep_MovingSpread_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldMovingSpread;                                   // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_MovementSpeed
struct UValAttributeSet_OnRep_MovementSpeed_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldMovementSpeed;                                  // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_MeleeDamageMitigationModifier
struct UValAttributeSet_OnRep_MeleeDamageMitigationModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldMeleeDamageMitigationModifier;                  // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_MediumShieldEnergyConsumptionRate
struct UValAttributeSet_OnRep_MediumShieldEnergyConsumptionRate_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldMediumShieldEnergyConsumptionRate;              // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_MaxGroundSpeedMultiplier
struct UValAttributeSet_OnRep_MaxGroundSpeedMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldMaxGroundSpeedMultiplier;                       // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_MarkedDamageModifier
struct UValAttributeSet_OnRep_MarkedDamageModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldMarkedDamageModifier;                           // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_LootUpgradeChance
struct UValAttributeSet_OnRep_LootUpgradeChance_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldLootUpgradeChance;                              // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_KickbackModifier
struct UValAttributeSet_OnRep_KickbackModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldKickbackModifier;                               // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_JumpHeightMultiplier
struct UValAttributeSet_OnRep_JumpHeightMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldJumpHeightMultiplier;                           // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_JetpackVerticalBoost
struct UValAttributeSet_OnRep_JetpackVerticalBoost_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldJetpackVerticalBoost;                           // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_JetpackOverburnDuration
struct UValAttributeSet_OnRep_JetpackOverburnDuration_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldJetpackOverburnDuration;                        // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_JetpackEnergyConsumptionRate
struct UValAttributeSet_OnRep_JetpackEnergyConsumptionRate_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldJetpackEnergyConsumptionRate;                   // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ItemRarityMitigationMultiplier
struct UValAttributeSet_OnRep_ItemRarityMitigationMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldItemRarityMitigationMultiplier;                 // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ItemRarityDamageMultiplier
struct UValAttributeSet_OnRep_ItemRarityDamageMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldItemRarityDamageMultiplier;                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ItemEquipTimeMultiplier
struct UValAttributeSet_OnRep_ItemEquipTimeMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldItemEquipTimeMultiplier;                        // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_InteractTimeMultiplier
struct UValAttributeSet_OnRep_InteractTimeMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldInteractTimeMultiplier;                         // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_IncomingKnockbackModifier
struct UValAttributeSet_OnRep_IncomingKnockbackModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldIncomingKnockbackModifier;                      // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_HolsterSpeedMultiplier
struct UValAttributeSet_OnRep_HolsterSpeedMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldHolsterSpeedMultiplier;                         // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_HitDebuffGroundSpeedMultiplier
struct UValAttributeSet_OnRep_HitDebuffGroundSpeedMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldHitDebuffGroundSpeedMultiplier;                 // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_HeavyShieldEnergyConsumptionRate
struct UValAttributeSet_OnRep_HeavyShieldEnergyConsumptionRate_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldHeavyShieldEnergyConsumptionRate;               // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_HealthRegenAmount
struct UValAttributeSet_OnRep_HealthRegenAmount_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldHealthRegenAmount;                              // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_HealthPackUseSpeedModifier
struct UValAttributeSet_OnRep_HealthPackUseSpeedModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldHealthPackUseSpeedModifier;                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_HealthPackModifier
struct UValAttributeSet_OnRep_HealthPackModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldHealthPackModifier;                             // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_HealthPackMax
struct UValAttributeSet_OnRep_HealthPackMax_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldHealthPackMax;                                  // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_HealthMax
struct UValAttributeSet_OnRep_HealthMax_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldHealthMax;                                      // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_Health
struct UValAttributeSet_OnRep_Health_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldHealth;                                         // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_HealReductionModifier
struct UValAttributeSet_OnRep_HealReductionModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldHealReductionModifier;                          // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_HeadshotDamageModifier
struct UValAttributeSet_OnRep_HeadshotDamageModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldHeadshotDamageModifier;                         // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_HeadshotDamageMitigationMultiplier
struct UValAttributeSet_OnRep_HeadshotDamageMitigationMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldHeadshotDamageMitigationMultiplier;             // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_GrenadeDamageMultiplier
struct UValAttributeSet_OnRep_GrenadeDamageMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldGrenadeDamageMultiplier;                        // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_GlobalStaggerMultiplier
struct UValAttributeSet_OnRep_GlobalStaggerMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldGlobalStaggerMultiplier;                        // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_GlobalSecondaryDamageMultiplier
struct UValAttributeSet_OnRep_GlobalSecondaryDamageMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldGlobalSecondaryDamageMultiplier;                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_GlobalPrimaryDamageMultiplier
struct UValAttributeSet_OnRep_GlobalPrimaryDamageMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldGlobalPrimaryDamageMultiplier;                  // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_GlobalMitigationModifier
struct UValAttributeSet_OnRep_GlobalMitigationModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldGlobalMitigationModifier;                       // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_GlobalMeleeDamageMultiplier
struct UValAttributeSet_OnRep_GlobalMeleeDamageMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldGlobalMeleeDamageMultiplier;                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_GlobalDamageMultiplier
struct UValAttributeSet_OnRep_GlobalDamageMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldGlobalDamageMultiplier;                         // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_GlobalCybridDamageModifier
struct UValAttributeSet_OnRep_GlobalCybridDamageModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldGlobalCybridDamageModifier;                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_GlobalAOEDamageMultiplier
struct UValAttributeSet_OnRep_GlobalAOEDamageMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldGlobalAOEDamageMultiplier;                      // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_FlinchRollIntensity
struct UValAttributeSet_OnRep_FlinchRollIntensity_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldFlinchRollIntensity;                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_FlinchPitchIntensity
struct UValAttributeSet_OnRep_FlinchPitchIntensity_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldFlinchPitchIntensity;                           // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_FlashlightRangeModifier
struct UValAttributeSet_OnRep_FlashlightRangeModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldFlashlightRangeModifier;                        // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_FlashlightIntensityModifier
struct UValAttributeSet_OnRep_FlashlightIntensityModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldFlashlightIntensityModifier;                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_FlagHolderDamageMultiplier
struct UValAttributeSet_OnRep_FlagHolderDamageMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldFlagHolderDamageMultiplier;                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_FalloffModifier
struct UValAttributeSet_OnRep_FalloffModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldFalloffModifier;                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_FallingSpread
struct UValAttributeSet_OnRep_FallingSpread_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldFallingSpread;                                  // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_FabricatorCostMultiplier
struct UValAttributeSet_OnRep_FabricatorCostMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldFabricatorCostMultiplier;                       // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_EnergyRegenRate
struct UValAttributeSet_OnRep_EnergyRegenRate_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldEnergyRegenRate;                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_EnergyMax
struct UValAttributeSet_OnRep_EnergyMax_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldEnergyMax;                                      // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_EmpStunModifier
struct UValAttributeSet_OnRep_EmpStunModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldEMPStunModifier;                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_DrawSpeedMultiplier
struct UValAttributeSet_OnRep_DrawSpeedMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldDrawSpeedMultiplier;                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_DoorInteractTimeMultiplier
struct UValAttributeSet_OnRep_DoorInteractTimeMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldDoorInteractTimeMultiplier;                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_DirectHitDamageModifier
struct UValAttributeSet_OnRep_DirectHitDamageModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldDirectHitDamageModifier;                        // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_DetectionRadius
struct UValAttributeSet_OnRep_DetectionRadius_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldDetectionRadius;                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_DamageToEnergyConversionRate
struct UValAttributeSet_OnRep_DamageToEnergyConversionRate_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldDamageToEnergyConversionRate;                   // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_DamageBoostUseSpeedModifier
struct UValAttributeSet_OnRep_DamageBoostUseSpeedModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldDamageBoostUseSpeedModifier;                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_CybridTetherStateTime
struct UValAttributeSet_OnRep_CybridTetherStateTime_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldCybridTetherStateTime;                          // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_CybridLatchDuration
struct UValAttributeSet_OnRep_CybridLatchDuration_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldCybridLatchDuration;                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_CybridDriveByDistance
struct UValAttributeSet_OnRep_CybridDriveByDistance_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldCybridDriveByDistance;                          // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_CybridDamageModifier
struct UValAttributeSet_OnRep_CybridDamageModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldCybridDamageModifier;                           // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_CybridDamageMitigationModifier
struct UValAttributeSet_OnRep_CybridDamageMitigationModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldCybridDamageMitigationModifier;                 // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_CybridCriticalHealthThresholdPct
struct UValAttributeSet_OnRep_CybridCriticalHealthThresholdPct_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldCybridCriticalHealthThresholdPct;               // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_CybridBeamDistance
struct UValAttributeSet_OnRep_CybridBeamDistance_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldCybridBeamDistance;                             // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_CybridAlertStateTime
struct UValAttributeSet_OnRep_CybridAlertStateTime_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldCybridAlertStateTime;                           // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_CrouchingSpread
struct UValAttributeSet_OnRep_CrouchingSpread_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldCrouchingSpread;                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ClipAmmoMax
struct UValAttributeSet_OnRep_ClipAmmoMax_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldClipAmmoMax;                                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ChestInteractTimeMultiplier
struct UValAttributeSet_OnRep_ChestInteractTimeMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldChestInteractTimeMultiplier;                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ChargeTimeModifier
struct UValAttributeSet_OnRep_ChargeTimeModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldChargeTimeModifier;                             // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_CharacterMassModifier
struct UValAttributeSet_OnRep_CharacterMassModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldCharacterMassModifier;                          // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_CharacterMass
struct UValAttributeSet_OnRep_CharacterMass_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldCharacterMass;                                  // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_BurstShots
struct UValAttributeSet_OnRep_BurstShots_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldBurstShots;                                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_BlockTime
struct UValAttributeSet_OnRep_BlockTime_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldBlockTime;                                      // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_BackwardMovementSpeedReductionMultiplier
struct UValAttributeSet_OnRep_BackwardMovementSpeedReductionMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldBackwardMovementSpeedReductionMultiplier;       // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_BackstabDamageModifier
struct UValAttributeSet_OnRep_BackstabDamageModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldBackstabDamageModifier;                         // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AttackSpreadReductionModifier
struct UValAttributeSet_OnRep_AttackSpreadReductionModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAttackSpreadReductionModifier;                  // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AttackSpreadRecovery
struct UValAttributeSet_OnRep_AttackSpreadRecovery_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAttackSpreadRecovery;                           // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AttackSpreadMax
struct UValAttributeSet_OnRep_AttackSpreadMax_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAttackSpreadMax;                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AttackSpreadIncrement
struct UValAttributeSet_OnRep_AttackSpreadIncrement_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAttackSpreadIncrement;                          // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AttackSpread
struct UValAttributeSet_OnRep_AttackSpread_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAttackSpread;                                   // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AttackRate
struct UValAttributeSet_OnRep_AttackRate_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAttackRate;                                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AttackDamagePerEnergy
struct UValAttributeSet_OnRep_AttackDamagePerEnergy_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAttackDamagePerEnergy;                          // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AttackDamage
struct UValAttributeSet_OnRep_AttackDamage_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAttackDamage;                                   // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AOEModifier
struct UValAttributeSet_OnRep_AOEModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAOEModifier;                                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AOEDamageMitigationModifier
struct UValAttributeSet_OnRep_AOEDamageMitigationModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAOEDamageMitigationModifier;                    // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AmmoUsedPerShot
struct UValAttributeSet_OnRep_AmmoUsedPerShot_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAmmoUsedPerShot;                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AirControl
struct UValAttributeSet_OnRep_AirControl_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAirControl;                                     // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AimSwayModifier
struct UValAttributeSet_OnRep_AimSwayModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAimSwayModifier;                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AimingSpread
struct UValAttributeSet_OnRep_AimingSpread_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAimingSpread;                                   // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AimingMaxSpeedMultiplier
struct UValAttributeSet_OnRep_AimingMaxSpeedMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAimingMaxSpeedMultiplier;                       // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AimFOVModifier
struct UValAttributeSet_OnRep_AimFOVModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAimFOVModifier;                                 // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AIAcquireTargetTime
struct UValAttributeSet_OnRep_AIAcquireTargetTime_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAIAcquireTargetTime;                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ADSTimeMultiplier
struct UValAttributeSet_OnRep_ADSTimeMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldADSTimeMultiplier;                              // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_ADSTime
struct UValAttributeSet_OnRep_ADSTime_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldADSTime;                                        // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AbilityDamageMultiplier
struct UValAttributeSet_OnRep_AbilityDamageMultiplier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAbilityDamageMultiplier;                        // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.OnRep_AbilityAOEModifier
struct UValAttributeSet_OnRep_AbilityAOEModifier_Params
{
public:
	struct GameplayAbilities_GameplayAttributeData OldAbilityAOEModifier;                             // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.GetPlayerType
struct UValAttributeSet_GetPlayerType_Params
{
public:
	class AValCharacter*                         Character;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPlayerType                       PlayerType;                                        // 0x8(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4A2A[0x7];                                     // Fixing Size Of Struct 
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAttributeSet.GetPlayerStatus
struct UValAttributeSet_GetPlayerStatus_Params
{
public:
	class AValCharacter*                         Character;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct Valhalla_PlayerStatus                 PlayerStatus;                                      // 0x8(0x14)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_4A2F[0x4];                                     // Fixing Size Of Struct 
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAttributeSet.GetPlayerId
struct UValAttributeSet_GetPlayerId_Params
{
public:
	class AValCharacter*                         Character;                                         // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PlayerId;                                          // 0x8(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4A34[0x4];                                     // Fixing Size Of Struct 
};

// 0x368 (0x368 - 0x0)
// Function Valhalla.ValAT_CooldownChanged.OnActiveEffectDurationChange
struct UValAT_CooldownChanged_OnActiveEffectDurationChange_Params
{
public:
	struct GameplayAbilities_ActiveGameplayEffect Effect;                                            // 0x0(0x368)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// Function Valhalla.ValAT_CooldownChanged.ListenForCooldownChange
struct UValAT_CooldownChanged_ListenForCooldownChange_Params
{
public:
	class UAbilitySystemComponent*               AbilitySystemComponent;                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTagContainer     CooldownTags;                                      // 0x8(0x20)(Parm, NativeAccessSpecifierPublic)
	bool                                         UseServerCooldown;                                 // 0x28(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4ADC[0x7];                                     // Fixing Size After Last Property  
	class UValAT_CooldownChanged*                ReturnValue;                                       // 0x30(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Valhalla.ValAT_GameplayTagAddedRemoved.ListenForGameplayTagAddedOrRemoved
struct UValAT_GameplayTagAddedRemoved_ListenForGameplayTagAddedOrRemoved_Params
{
public:
	class UAbilitySystemComponent*               AbilitySystemComponent;                            // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTagContainer     Tags;                                              // 0x8(0x20)(Parm, NativeAccessSpecifierPublic)
	class UValAT_GameplayTagAddedRemoved*        ReturnValue;                                       // 0x28(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// Function Valhalla.ValAT_PlayMontageForMeshAndWait.PlayMontageForMeshAndWait
struct UValAT_PlayMontageForMeshAndWait_PlayMontageForMeshAndWait_Params
{
public:
	class UGameplayAbility*                      OwningAbility;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  TaskInstanceName;                                  // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                Mesh;                                              // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          MontageToPlay;                                     // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTagContainer     EventTags;                                         // 0x20(0x20)(Parm, NativeAccessSpecifierPublic)
	float                                        Rate;                                              // 0x40(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  StartSection;                                      // 0x44(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStopWhenAbilityEnds;                              // 0x4C(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4AFE[0x3];                                     // Fixing Size After Last Property  
	float                                        AnimRootMotionTranslationScale;                    // 0x50(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReplicateMontage;                                 // 0x54(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4AFF[0x3];                                     // Fixing Size After Last Property  
	float                                        OverrideBlendOutTimeForCancelAbility;              // 0x58(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OverrideBlendOutTimeForStopWhenEndAbility;         // 0x5C(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UValAT_PlayMontageForMeshAndWait*      ReturnValue;                                       // 0x60(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAT_ServerWaitForClientTargetData.ServerWaitForClientTargetData
struct UValAT_ServerWaitForClientTargetData_ServerWaitForClientTargetData_Params
{
public:
	class UGameplayAbility*                      OwningAbility;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  TaskInstanceName;                                  // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         TriggerOnce;                                       // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4B0A[0x7];                                     // Fixing Size After Last Property  
	class UValAT_ServerWaitForClientTargetData*  ReturnValue;                                       // 0x18(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Valhalla.ValAT_ServerWaitForClientTargetData.OnTargetDataReplicatedCallback
struct UValAT_ServerWaitForClientTargetData_OnTargetDataReplicatedCallback_Params
{
public:
	struct GameplayAbilities_GameplayAbilityTargetDataHandle Data;                                              // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              ActivationTag;                                     // 0x28(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAT_WaitAiming.WaitAiming
struct UValAT_WaitAiming_WaitAiming_Params
{
public:
	class UGameplayAbility*                      OwningAbility;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  TaskInstanceName;                                  // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValCharacter*                         Character;                                         // 0x10(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWantsToAim;                                       // 0x18(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4B21[0x7];                                     // Fixing Size After Last Property  
	class UValAT_WaitAiming*                     ReturnValue;                                       // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Valhalla.ValAT_WaitTargetDataUsingActor.WaitTargetDataWithReusableActor
struct UValAT_WaitTargetDataUsingActor_WaitTargetDataWithReusableActor_Params
{
public:
	class UGameplayAbility*                      OwningAbility;                                     // 0x0(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  TaskInstanceName;                                  // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EGameplayTargetingConfirmation    ConfirmationType;                                  // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4B3A[0x7];                                     // Fixing Size After Last Property  
	class AGameplayAbilityTargetActor*           InTargetActor;                                     // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCreateKeyIfNotValidForMorePredicting;             // 0x20(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4B3D[0x7];                                     // Fixing Size After Last Property  
	class UValAT_WaitTargetDataUsingActor*       ReturnValue;                                       // 0x28(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function Valhalla.ValAT_WaitTargetDataUsingActor.OnTargetDataReplicatedCallback
struct UValAT_WaitTargetDataUsingActor_OnTargetDataReplicatedCallback_Params
{
public:
	struct GameplayAbilities_GameplayAbilityTargetDataHandle Data;                                              // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              ActivationTag;                                     // 0x28(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAT_WaitTargetDataUsingActor.OnTargetDataReadyCallback
struct UValAT_WaitTargetDataUsingActor_OnTargetDataReadyCallback_Params
{
public:
	struct GameplayAbilities_GameplayAbilityTargetDataHandle Data;                                              // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function Valhalla.ValAT_WaitTargetDataUsingActor.OnTargetDataCancelledCallback
struct UValAT_WaitTargetDataUsingActor_OnTargetDataCancelledCallback_Params
{
public:
	struct GameplayAbilities_GameplayAbilityTargetDataHandle Data;                                              // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAudioRoomCollection.SetRoomAkEvent
struct IValAudioRoomCollection_SetRoomAkEvent_Params
{
public:
	struct CoreUObject_Vector                    Location;                                          // 0x0(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                         Event;                                             // 0x18(0x8)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAudioRoomCollection.OnAudioRoomRequestUnLoad
struct IValAudioRoomCollection_OnAudioRoomRequestUnLoad_Params
{
public:
	bool                                         bDisableOnlyObjects;                               // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function Valhalla.ValAudioRoomCollection.OnAudioRoomRequestLoad
struct IValAudioRoomCollection_OnAudioRoomRequestLoad_Params
{
public:
	bool                                         bEnableObjects;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function Valhalla.ValAudioRoomCollection.GetAkRooms
struct IValAudioRoomCollection_GetAkRooms_Params
{
public:
	TArray<class AValAkRoom*>                    OutRooms;                                          // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function Valhalla.ValAudioRoomCollection.GetAkRoomAtLocation
struct IValAudioRoomCollection_GetAkRoomAtLocation_Params
{
public:
	struct CoreUObject_Vector                    Location;                                          // 0x0(0x18)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
