#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x70 (0x308 - 0x298)
// Class Valhalla.ValAudioThreatTestActor
class AValAudioThreatTestActor : public AActor
{
public:
	class UStaticMeshComponent*                  MeshComp;                                          // 0x298(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UValProxyAudioThreatComponent*         ThreatComp;                                        // 0x2A0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextRenderComponent*                  TextComp;                                          // 0x2A8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECollisionChannel                 ObjectTraceType;                                   // 0x2B0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CB[0x7];                                      // Fixing Size After Last Property  
	TArray<struct CoreUObject_Color>             BucketColors;                                      // 0x2B8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterial>              RenderMaterial;                                    // 0x2C8(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VATTAID;                                           // 0x2F0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Damage;                                            // 0x2F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShooting;                                         // 0x2F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCybrid;                                           // 0x2F9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CC[0x6];                                      // Fixing Size After Last Property  
	class UMaterialInstanceDynamic*              RenderMaterialInstance;                            // 0x300(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AValAudioThreatTestActor* GetDefaultObj();

	void AudioSend(const class FString& Input);
};

// 0x28 (0x58 - 0x30)
// Class Valhalla.AsyncAction_GetLeaderboard
class UAsyncAction_GetLeaderboard : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            Completed;                                         // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D1[0x18];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UAsyncAction_GetLeaderboard* GetDefaultObj();

	class UAsyncAction_GetLeaderboard* GetLeaderboard(class UObject* WorldContextObject, const class FString& LeaderboardName);
};

// 0x60 (0x90 - 0x30)
// Class Valhalla.AsyncTaskAttributeChanged
class UAsyncTaskAttributeChanged : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnAttributeChanged;                                // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*               ASC;                                               // 0x40(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1EF[0x48];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UAsyncTaskAttributeChanged* GetDefaultObj();

	class UAsyncTaskAttributeChanged* ListenForAttributesChange(class UAbilitySystemComponent* AbilitySystemComponent, const TArray<struct GameplayAbilities_GameplayAttribute>& Attributes);
	class UAsyncTaskAttributeChanged* ListenForAttributeChange(class UAbilitySystemComponent* AbilitySystemComponent, const struct GameplayAbilities_GameplayAttribute& Attribute);
	void EndTask();
};

// 0x18 (0x48 - 0x30)
// Class Valhalla.AsyncTaskLocalPlayerRep
class UAsyncTaskLocalPlayerRep : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnLocalPlayerRep;                                  // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UValGameInstance*                      CachedValGameInstance;                             // 0x40(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAsyncTaskLocalPlayerRep* GetDefaultObj();

	void LocalPlayerRep();
	class UAsyncTaskLocalPlayerRep* ListenForLocalPlayerRep(class UValGameInstance* ValGameInstance);
	void EndTask();
};

// 0x20 (0x50 - 0x30)
// Class Valhalla.AsyncTaskPlayerStateRep
class UAsyncTaskPlayerStateRep : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnPlayerStateRep;                                  // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AValPlayerController*                  CachedPC;                                          // 0x40(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AValCharacter*                         CachedCharacter;                                   // 0x48(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAsyncTaskPlayerStateRep* GetDefaultObj();

	void PlayerStateRep(class AValPlayerStateBase* PlayerState);
	class UAsyncTaskPlayerStateRep* ListenForPCPlayerStateRep(class AValPlayerController* ValPC);
	class UAsyncTaskPlayerStateRep* ListenForCharacterPlayerStateRep(class AValCharacter* ValCharacter);
	void EndTask();
};

// 0x0 (0x550 - 0x550)
// Class Valhalla.HUDContainerWidget
class UHUDContainerWidget : public URHWidget
{
public:

	static class UClass* StaticClass();
	static class UHUDContainerWidget* GetDefaultObj();

};

// 0x18 (0x40 - 0x28)
// Class Valhalla.RemainingAmmoVFX
class URemainingAmmoVFX : public UObject
{
public:
	uint8                                        Pad_22F[0x18];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class URemainingAmmoVFX* GetDefaultObj();

	void SetCharRef(class AValCharacter* CharacterReference);
	void OnReload(const struct GameplayTags_GameplayTag& InTag, int32 NewCount);
	void OnClipAmmoChanged(float OldValue, float NewValue);
};

// 0x0 (0x380 - 0x380)
// Class Valhalla.RHInstanceDefaultGameMode
class ARHInstanceDefaultGameMode : public AGameMode
{
public:

	static class UClass* StaticClass();
	static class ARHInstanceDefaultGameMode* GetDefaultObj();

};

// 0x8 (0x498 - 0x490)
// Class Valhalla.RHTestClientConnectGameMode
class ARHTestClientConnectGameMode : public ARHGameModeBase
{
public:
	uint8                                        Pad_237[0x8];                                      // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class ARHTestClientConnectGameMode* GetDefaultObj();

};

// 0x248 (0x600 - 0x3B8)
// Class Valhalla.ValGameplayAbility
class UValGameplayAbility : public UGameplayAbility
{
public:
	class UValAbilityAudioVisual*                AbilityAV;                                         // 0x3B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UValAbilitySystemComponent> OwningASC;                                         // 0x3C0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct GameplayAbilities_ScalableFloat> CooldownDuration;                                  // 0x3C8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                        CooldownModifierFlat;                              // 0x3D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CooldownModifierPercentage;                        // 0x3DC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CooldownDurationIndex;                             // 0x3E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A1B[0x4];                                      // Fixing Size After Last Property  
	struct GameplayTags_GameplayTagContainer     CooldownTags;                                      // 0x3E8(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                         bOverrideCooldownTag;                              // 0x408(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A2B[0x7];                                      // Fixing Size After Last Property  
	struct GameplayTags_GameplayTagContainer     TempCooldownTags;                                  // 0x410(0x20)(Protected, NativeAccessSpecifierProtected)
	class UValAT_CooldownChanged*                SecondaryCooldownTask;                             // 0x430(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            OnAbilityHeldDelegate;                             // 0x438(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              CooldownSetByCallerTag;                            // 0x448(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EValAbilityInputID                AbilityInputID;                                    // 0x450(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EValAbilityInputID                AbilityID;                                         // 0x451(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bActivateAbilityOnGranted;                         // 0x452(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bActivateOnInput;                                  // 0x453(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCannotActivateWhileInteracting;                   // 0x454(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCannotActivateWhileDowned;                        // 0x455(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreSwappableAbilities;                         // 0x456(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCannotActivateWhileThirdPerson;                   // 0x457(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UValGameplayAbility>> SubAbilities;                                      // 0x458(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<enum class EValAbilityInputID, TSubclassOf<class UValGameplayAbility>> InputedSubAbilities;                               // 0x468(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<enum class EValAbilityInputID, struct GameplayAbilities_GameplayAbilitySpecHandle> InputedSubAbilitySpecHandles;                      // 0x4B8(0x50)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct GameplayAbilities_GameplayAbilitySpecHandle> SubAbilitySpecHandles;                             // 0x508(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              EquipStatsTag;                                     // 0x518(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct GameplayAbilities_ActiveGameplayEffectHandle> EquipStatEffects;                                  // 0x520(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	float                                        DrawTime;                                          // 0x530(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        HolsterTime;                                       // 0x534(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct GameplayTags_GameplayTag, struct Valhalla_ValGameplayEffectContainer> EffectContainerMap;                                // 0x538(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                        StartingMaxCharges;                                // 0x588(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsConsumable;                                     // 0x58C(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A75[0x3];                                      // Fixing Size After Last Property  
	int32                                        CurrentCharges;                                    // 0x590(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A79[0x4];                                      // Fixing Size After Last Property  
	FMulticastInlineDelegateProperty_            OnChargeChange;                                    // 0x598(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_A7E[0x10];                                     // Fixing Size After Last Property  
	TArray<struct Valhalla_AbilityMeshMontage>   CurrentAbilityMeshMontages;                        // 0x5B8(0x10)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct GameplayTags_GameplayTag              AssetIDTag;                                        // 0x5C8(0x8)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCalcAbilityPropertyModsOnActivation;              // 0x5D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAbilityEventType                 AbilityEventType;                                  // 0x5D1(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A87[0x2E];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValGameplayAbility* GetDefaultObj();

	void ValInputPressed(const struct GameplayAbilities_GameplayAbilitySpecHandle& Handle, struct GameplayAbilities_GameplayAbilityActorInfo& ActorInfo, const struct GameplayAbilities_GameplayAbilityActivationInfo& ActivationInfo);
	bool ValCheckCost(const struct GameplayAbilities_GameplayAbilitySpecHandle& Handle, struct GameplayAbilities_GameplayAbilityActorInfo& ActorInfo);
	void ValApplyCost(const struct GameplayAbilities_GameplayAbilitySpecHandle& Handle, struct GameplayAbilities_GameplayAbilityActorInfo& ActorInfo, const struct GameplayAbilities_GameplayAbilityActivationInfo& ActivationInfo);
	void ValActivationFailed(const struct GameplayAbilities_GameplayAbilitySpecHandle& Handle, struct GameplayTags_GameplayTagContainer& FailureReason);
	bool UsesCharges();
	bool TryInputLocal(enum class EValAbilityInputID InputID);
	bool TryInput(enum class EValAbilityInputID InputID);
	void SetFullCharge();
	void SetCurrentChargeNoReplication(int32 Value);
	void SetCurrentCharge(int32 Value);
	void SetCooldownAbility(TSubclassOf<class UGameplayEffect> NewCooldown);
	void SendTargetDataToServer(struct GameplayAbilities_GameplayAbilityTargetDataHandle& TargetData);
	void RemoveCharge();
	void OnSecondaryCooldownEnd(const struct GameplayTags_GameplayTag& CooldownTag, float TimeRemaining, float Duration);
	void OnAbilityLevelUpdated(int32 NewLevel);
	void MontageStopForMesh(class USkeletalMeshComponent* InMesh, float OverrideBlendOutTime);
	void MontageStopForAllMeshes(float OverrideBlendOutTime);
	void MontageSetNextSectionNameForMesh(class USkeletalMeshComponent* InMesh, class FName FromSectionName, class FName ToSectionName);
	void MontageJumpToSectionForMesh(class USkeletalMeshComponent* InMesh, class FName SectionName);
	struct GameplayAbilities_GameplayAbilityTargetDataHandle MakeGameplayAbilityTargetDataHandleFromHitResults(const TArray<struct Engine_HitResult>& HitResults);
	struct GameplayAbilities_GameplayAbilityTargetDataHandle MakeGameplayAbilityTargetDataHandleFromActorArray(const TArray<class AActor*>& TargetActors);
	struct Valhalla_ValGameplayEffectContainerSpec MakeEffectContainerSpecFromContainer(struct Valhalla_ValGameplayEffectContainer& Container, struct GameplayAbilities_GameplayEventData& EventData, int32 OverrideGameplayLevel);
	struct Valhalla_ValGameplayEffectContainerSpec MakeEffectContainerSpec(const struct GameplayTags_GameplayTag& ContainerTag, struct GameplayAbilities_GameplayEventData& EventData, int32 OverrideGameplayLevel);
	class UObject* K2_GetSourceObject(const struct GameplayAbilities_GameplayAbilitySpecHandle& Handle, struct GameplayAbilities_GameplayAbilityActorInfo& ActorInfo);
	TArray<struct GameplayAbilities_ActiveGameplayEffectHandle> K2_ApplyGameplayEffectSpecsToTarget(TArray<struct GameplayAbilities_GameplayEffectSpecHandle>& EffectSpecHandles, const struct GameplayAbilities_GameplayAbilityTargetDataHandle& TargetData);
	bool IsPredictionKeyValidForMorePrediction();
	bool IsOnSecondaryCooldown();
	bool IsInputPressed();
	bool IsHitscan();
	bool IsAbilityActive();
	bool HasCharge();
	void GetWeaponType(struct GameplayTags_GameplayTag& OutWeaponType);
	float GetTimeSinceDate(const struct CoreUObject_DateTime& PreviousTime);
	class UGameplayAbility* GetSubAbilityFromInputID(enum class EValAbilityInputID InputID);
	class UGameplayAbility* GetSubAbilityFromClass(TSubclassOf<class UGameplayAbility> AbilityClass);
	bool GetSlotSecondaryCooldownTag(struct GameplayTags_GameplayTag* OutGameplayTag);
	bool GetSlotCooldownTags(struct GameplayTags_GameplayTagContainer* OutGameplayTags);
	float GetSecondaryCooldownTimeRemaining();
	class UValAbilitySystemComponent* GetOwningASC();
	int32 GetMaxCharges();
	float GetHolsterTime();
	float GetDrawTime();
	void GetDamageType(struct GameplayTags_GameplayTag& OutDamageType);
	class FString GetCurrentPredictionKeyStatus();
	class UAnimMontage* GetCurrentMontageForMesh(class USkeletalMeshComponent* InMesh);
	int32 GetCurrentCharges();
	float GetCooldownDuration();
	struct GameplayTags_GameplayTagContainer GetAbilityTags();
	void GetAbilityPropertyModValues(const struct GameplayTags_GameplayTag& PropertyTag, TArray<float>* OutValues);
	class UValAbilityAudioVisual* GetAbilityAudioVisual();
	void EventOnAbilityRemoved(struct GameplayAbilities_GameplayAbilityActorInfo& ActorInfo, struct GameplayAbilities_GameplayAbilitySpec& Spec);
	void EventOnAbilityPendingRemoved();
	void EventOnAbilityGiven(struct GameplayAbilities_GameplayAbilityActorInfo& ActorInfo, struct GameplayAbilities_GameplayAbilitySpec& Spec);
	void EndSecondaryCooldown();
	void EndCooldown();
	void CalcAbilityPropertyModifiers();
	void BeginPlay();
	bool BatchRPCTryActivateAbility(const struct GameplayAbilities_GameplayAbilitySpecHandle& InAbilityHandle, bool EndAbilityImmediately);
	void ApplySwapTimeModifier(float& OutPercentModifier, float& OutFlatModifier, struct GameplayTags_GameplayTag& SwappedFromSlot, struct GameplayTags_GameplayTag& SwappedToSlot);
	void ApplySecondaryCooldown(float Amount);
	void ApplyLimbResistanceModifier(float& OutLimbDamageModifier, float Damage, struct GameplayAbilities_GameplayEffectContextHandle& DamageContext);
	void ApplyHealthResistanceModifier(float& OutPercentModifier, float& OutFlatModifier, float Damage, struct GameplayAbilities_GameplayEffectContextHandle& DamageContext);
	TArray<struct GameplayAbilities_ActiveGameplayEffectHandle> ApplyEffectContainerSpecToTarget(struct Valhalla_ValGameplayEffectContainerSpec& ContainerSpec, struct GameplayAbilities_GameplayAbilityTargetDataHandle& TargetData);
	void ApplyDamageResistanceModifier(float& OutPercentModifier, float& OutFlatModifier, float& OutShieldModifier, float Damage, struct GameplayAbilities_GameplayEffectContextHandle& DamageContext);
	void ApplyDamageOutputModifier(float& OutPercentModifier, float& OutFlatModifier, float Damage, struct GameplayAbilities_GameplayEffectContextHandle& DamageContext);
	void ApplyCooldownWithFlatAmount(float Amount);
	void ApplyCooldown();
	void AddMaxCharge(int32 Value);
	void AddCharge();
	void AddAbilityCooldownPercentageModifier(float Value);
	void AddAbilityCooldownFlatModifier(float Value);
};

// 0x50 (0x650 - 0x600)
// Class Valhalla.ValDevice
class UValDevice : public UValGameplayAbility
{
public:
	uint8                                        Pad_B52[0x8];                                      // Fixing Size After Last Property  
	bool                                         bCanActivateWhileUnderwater;                       // 0x608(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B55[0x7];                                      // Fixing Size After Last Property  
	class UValDeviceAudioVisual*                 AudioVisual;                                       // 0x610(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UValDeployableAudioVisual*             DeployableAudioVisual;                             // 0x618(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanActivateWhileSprinting;                        // 0x620(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInterruptsSprintingOnActivation;                  // 0x621(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_B6A[0x2];                                      // Fixing Size After Last Property  
	float                                        InterruptSprintingDelay;                           // 0x624(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanActivateWhileStealthed;                        // 0x628(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInterruptsStealthOnActivation;                    // 0x629(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_B72[0x2];                                      // Fixing Size After Last Property  
	float                                        InterruptSteathDelay;                              // 0x62C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                    ActorToSpawnOnActivation;                          // 0x630(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ValidationDistanceLeeway;                          // 0x638(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUsePredictiveAiming;                              // 0x63C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_B7F[0x3];                                      // Fixing Size After Last Property  
	FMulticastInlineDelegateProperty_            OnDeviceUnheldDel;                                 // 0x640(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValDevice* GetDefaultObj();

	bool ShouldUsePredictiveAiming();
	class UValDeployableAudioVisual* GetDeployableAudioVisual();
	class UValDeviceAudioVisual* GetAudioVisual();
	TSubclassOf<class AActor> GetActorToSpawnOnActivation();
	double CalculateActivationDelta(float TimeBetweenActivations, double LastActivation);
};

// 0x0 (0x650 - 0x650)
// Class Valhalla.RubyWeapon
class URubyWeapon : public UValDevice
{
public:

	static class UClass* StaticClass();
	static class URubyWeapon* GetDefaultObj();

};

// 0x30 (0x2D0 - 0x2A0)
// Class Valhalla.SmoothTransformComponent
class USmoothTransformComponent : public USceneComponent
{
public:
	float                                        UpdateSpeed;                                       // 0x2A0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDistance;                                       // 0x2A4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_BDF[0x28];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class USmoothTransformComponent* GetDefaultObj();

	struct CoreUObject_Vector GetCurrentLocation();
};

// 0x7B8 (0xB00 - 0x348)
// Class Valhalla.ValAnimInstance
class UValAnimInstance : public UAnimInstance
{
public:
	uint8                                        Pad_DBD[0x8];                                      // Fixing Size After Last Property  
	struct Valhalla_ValAnimInstanceProxy         Proxy;                                             // 0x350(0x760)(BlueprintVisible, BlueprintReadOnly, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                CopyPoseComp;                                      // 0xAB0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AValCharacter*                         ValCharacterOwner;                                 // 0xAB8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UValCharacterMovementComponent*        ValCharacterMovementComponent;                     // 0xAC0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableIKWhileSprinting;                          // 0xAC8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAlwaysIKRightHand;                                // 0xAC9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAlwaysIKLeftHand;                                 // 0xACA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DD2[0x1];                                      // Fixing Size After Last Property  
	float                                        AimingAlpha;                                       // 0xACC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BlockingAlpha;                                     // 0xAD0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bWalking;                                          // 0xAD4(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSprinting;                                        // 0xAD5(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStateSprinting;                                   // 0xAD6(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bFalling;                                          // 0xAD7(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bJetpacking;                                       // 0xAD8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSkydiving;                                        // 0xAD9(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSkydiveLanding;                                   // 0xADA(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bWantsToSki;                                       // 0xADB(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LeftHandIKStrength;                                // 0xADC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        RightHandIKStrength;                               // 0xAE0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LeftHandIKTargetStrength;                          // 0xAE4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        RightHandIKTargetStrength;                         // 0xAE8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ForwardPercent;                                    // 0xAEC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LeftPercent;                                       // 0xAF0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUpdateAnimation;                                  // 0xAF4(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E19[0x3];                                      // Fixing Size After Last Property  
	float                                        RightPercent;                                      // 0xAF8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E1F[0x4];                                      // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAnimInstance* GetDefaultObj();

	void StopSwapAnims();
	void SetWalking(bool bValue);
	void SetSprinting(bool bValue);
	void SetRightHandIKStrength(float NewStrength, float BlendTime);
	void SetLeftHandIKStrength(float NewStrength, float BlendTime);
	void SetHidden(bool bNewHidden);
	void RestoreSwapAnim(float HolsterDuration, float DrawDuration);
	void PlayReverseHolster(float HolsterDuration);
	void PlayReverseDraw(float DrawDuration);
	void PlayHolster(float HolsterDuration);
	void PlayDraw(float DrawDuration);
	bool PlayDeathAnimation();
	void OnWeaponHolstered(const struct GameplayTags_GameplayTag& InTag, int32 NewCount);
	void OnVaulted();
	void OnSprintStateChanged(const struct GameplayTags_GameplayTag& InTag, int32 NewCount);
	void OnPostMatchStateChanged(const struct GameplayTags_GameplayTag& InTag, int32 NewCount);
	void EventSprintStateUpdated();
	void BlendOutIK(bool bForceBlendOutBothArms);
	void BlendInIK();
};

// 0x20 (0xB20 - 0xB00)
// Class Valhalla.ValAbilityAnimInstance
class UValAbilityAnimInstance : public UValAnimInstance
{
public:
	class UAnimMontage*                          DrawingMontage;                                    // 0xB00(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          HolsteringMontage;                                 // 0xB08(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          FireMontage;                                       // 0xB10(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UValAT_PlayMontageForMeshAndWait*      MontageTask;                                       // 0xB18(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValAbilityAnimInstance* GetDefaultObj();

	void PlayMontageReplicated(class UValGameplayAbility* Ability, class UAnimMontage* Montage, float Duration);
	void PlayMontage(class UAnimMontage* Montage, float Duration);
	void OnGrenadeThrow(const struct GameplayTags_GameplayTag& InTag, int32 NewCount);
};

// 0x230 (0x260 - 0x30)
// Class Valhalla.ValAbilityAudioVisual
class UValAbilityAudioVisual : public UDataAsset
{
public:
	struct GameplayTags_GameplayTag              AppearanceSlot;                                    // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          Mesh1P;                                            // 0x38(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          Mesh3P;                                            // 0x60(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UValAnimInstance>        ABP1P;                                             // 0x88(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UValAnimInstance>        ABP3P;                                             // 0xB0(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMaterialInterface>> MaterialOverrides1P;                               // 0xD8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FName, TSoftObjectPtr<class UTexture2D>> MaterialOverrideParams1P;                          // 0xE8(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMaterialInterface>> MaterialOverrides3P;                               // 0x138(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FName, TSoftObjectPtr<class UTexture2D>> MaterialOverrideParams3P;                          // 0x148(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                         bHideSkeletalMesh;                                 // 0x198(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1214[0x7];                                     // Fixing Size After Last Property  
	struct CoreUObject_Transform                 FirstPersonRelativeTransform;                      // 0x1A0(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                        ProjectileTrail;                                   // 0x200(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             AbilityIcon;                                       // 0x208(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  AbilityDisplayName;                                // 0x230(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  AbilityDescription;                                // 0x248(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValAbilityAudioVisual* GetDefaultObj();

	class USkeletalMesh* GetMesh3P();
	class USkeletalMesh* GetMesh1P();
	class UTexture2D* GetMaterialOverrideParams1P(class FName& Key);
	class UMaterialInterface* GetMaterialOverride1P(int32 Index);
	class UClass* GetABP3P();
};

// 0x0 (0x28 - 0x28)
// Class Valhalla.ValAbilityFunctionLibrary
class UValAbilityFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UValAbilityFunctionLibrary* GetDefaultObj();

	struct GameplayAbilities_GameplayEffectSpecHandle RemoveGrantedTag(const struct GameplayAbilities_GameplayEffectSpecHandle& SpecHandle, const struct GameplayTags_GameplayTag& GameplayTag);
	bool IsPrimaryAbilityInstanceActive(class UAbilitySystemComponent* AbilitySystemComponent, const struct GameplayAbilities_GameplayAbilitySpecHandle& Handle);
	bool IsOccluded(class AActor* Victim, TArray<class FName>& Bones, struct CoreUObject_Vector& Origin, TArray<class AActor*>& IgnoreActors, struct Engine_HitResult* Hit, enum class ECollisionChannel TraceChannel, bool bDrawDebug);
	bool IsActiveGameplayEffectHandleValid(const struct GameplayAbilities_ActiveGameplayEffectHandle& Handle);
	bool IsAbilitySpecHandleValid(const struct GameplayAbilities_GameplayAbilitySpecHandle& Handle);
	bool HasGrantedTagExact(const struct GameplayAbilities_GameplayEffectSpecHandle& SpecHandle, const struct GameplayTags_GameplayTag& GameplayTag);
	float GetSetByCallerMagnitudeByTag(const struct GameplayAbilities_GameplayEffectSpecHandle& SpecHandle, const struct GameplayTags_GameplayTag& DataTag);
	class UValGameplayAbility* GetPrimaryAbilityInstanceFromHandle(class UAbilitySystemComponent* AbilitySystemComponent, const struct GameplayAbilities_GameplayAbilitySpecHandle& Handle);
	class UValGameplayAbility* GetPrimaryAbilityInstanceFromClass(class UAbilitySystemComponent* AbilitySystemComponent, TSubclassOf<class UGameplayAbility> InAbilityClass);
	class FString GetPlayerEditorWindowRole(class UWorld* World);
	bool GetHitIDFromTargetData(struct GameplayAbilities_GameplayAbilityTargetDataHandle& HitResult, int32 Index, int32* HitID);
	bool FindActorsInExplosion(class UObject* WorldContextObject, class AActor* DamageCauser, struct CoreUObject_Vector& Origin, float OuterDamageRadius, TArray<class AActor*>& IgnoreActors, enum class ECollisionChannel DamagePreventionChannel, TMap<class AActor*, struct Engine_HitResult>* OutResults, bool bIgnoreOcclusion, bool bDrawDebug);
	void EffectContextSetSourceObject(const struct GameplayAbilities_GameplayEffectContextHandle& EffectContextHandle, class UObject* NewSource);
	void EffectContextSetAffectsTeam(const struct GameplayAbilities_GameplayEffectContextHandle& EffectContextHandle, bool Value);
	struct GameplayAbilities_GameplayAbilityTargetDataHandle EffectContextGetTargetData(const struct GameplayAbilities_GameplayEffectContextHandle& EffectContext);
	bool EffectContextGetAffectsTeam(const struct GameplayAbilities_GameplayEffectContextHandle& EffectContext);
	void EffectContextAddTargetData(const struct GameplayAbilities_GameplayEffectContextHandle& EffectContextHandle, struct GameplayAbilities_GameplayAbilityTargetDataHandle& TargetData);
	bool DoesEffectContainerSpecHaveEffects(struct Valhalla_ValGameplayEffectContainerSpec& ContainerSpec);
	void ClearTargetData(struct GameplayAbilities_GameplayAbilityTargetDataHandle& TargetData);
	TArray<struct GameplayAbilities_ActiveGameplayEffectHandle> ApplyExternalEffectSpec(struct GameplayAbilities_GameplayEffectSpecHandle& EffectSpec, struct GameplayAbilities_GameplayAbilityTargetDataHandle& TargetData);
	TArray<struct GameplayAbilities_ActiveGameplayEffectHandle> ApplyExternalEffectContainerSpec(struct Valhalla_ValGameplayEffectContainerSpec& ContainerSpec, struct GameplayAbilities_GameplayAbilityTargetDataHandle& TargetData);
};

// 0x138 (0x3D0 - 0x298)
// Class Valhalla.ValPickup
class AValPickup : public AActor
{
public:
	uint8                                        Pad_1E71[0x8];                                     // Fixing Size After Last Property  
	FMulticastInlineDelegateProperty_            OnPickedUp;                                        // 0x2A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class USphereComponent*                      CollisionComp;                                     // 0x2B0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USphereComponent*                      InteractCollisionComp;                             // 0x2B8(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                Mesh;                                              // 0x2C0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct GameplayTags_GameplayTag              EquipSlot;                                         // 0x2C8(0x8)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UValDevice>                PickupAbility;                                     // 0x2D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>           PickupEffect;                                      // 0x2D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct GameplayTags_GameplayTag, float> PickupEffectMagnitudes;                            // 0x2E0(0x50)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                         bPickupOnContact;                                  // 0x330(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1EBE[0x7];                                     // Fixing Size After Last Property  
	class FText                                  InteractText;                                      // 0x338(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                  FailedInteractText;                                // 0x350(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                         R_bPickupActive;                                   // 0x368(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDestroyOnPickup;                                  // 0x369(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1EE7[0x2];                                     // Fixing Size After Last Property  
	int32                                        RespawnTime;                                       // 0x36C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct Engine_TimerHandle                    RespawnTimer;                                      // 0x370(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCustomOnPickupComplete;                           // 0x378(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPreventDefenderInteract;                          // 0x379(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPickedUp;                                         // 0x37A(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1F08[0x5];                                     // Fixing Size After Last Property  
	class AValCharacter*                         CachedInitiator;                                   // 0x380(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCameraModifier>           CamMod;                                            // 0x388(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct Engine_WeightedBlendable>      PickupModMaterials;                                // 0x390(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F24[0x18];                                    // Fixing Size After Last Property  
	TArray<class AValCharacter*>                 CharactersThatCanInteract;                         // 0x3B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class AValCharacter*                         CachedReserver;                                    // 0x3C8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AValPickup* GetDefaultObj();

	bool TryToPickUp(class AValCharacter* ValCharacter);
	void SetPickupActive(bool bActive);
	bool ReserveItem(class AValCharacter* Reserver);
	void ReleaseReservation();
	void OnPickupComplete(class AValCharacter* ValCharacter);
	void OnHoverStart(class AValCharacter* Initiator);
	void OnHoverEnd(class AValCharacter* Initiator);
	void Interact(class AValCharacter* Initiator);
	void HideFloatingIcon(bool bIsHidden);
	class FText GetPickupInteractText(class AValCharacter* Initiator, bool* Success);
	TSubclassOf<class UValDevice> GetPickupAbility();
	class USkeletalMeshComponent* GetMesh();
	class FText GetInteractText();
	class UPrimitiveComponent* GetInteractComponent();
	class USphereComponent* GetCollisionComp();
	void FinishPickup();
	void EnablePickup(bool Value);
	bool CustomPickupFunc(class AValCharacter* ValCharacter);
	bool CharacterPickupCheck(class AValCharacter* ValCharacter);
	bool CanInteract(class AValCharacter* Initiator);
	void AutoPickupPickupItem(class AValCharacter* Initiator);
};

// 0x1A0 (0x570 - 0x3D0)
// Class Valhalla.ValAbilityPickup
class AValAbilityPickup : public AValPickup
{
public:
	TMap<enum class ERarity, int32>              RaritySpawnWeights;                                // 0x3D0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	enum class ERarity                           R_Rarity;                                          // 0x420(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2678[0x7];                                     // Fixing Size After Last Property  
	TSubclassOf<class UValGameplayAbility>       R_AbilityPickup;                                   // 0x428(0x8)(Net, ZeroConstructor, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct GameplayTags_GameplayTag              R_EquipSlot;                                       // 0x430(0x8)(Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         R_bAbilityLoaded;                                  // 0x438(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_269A[0x7];                                     // Fixing Size After Last Property  
	TSoftObjectPtr<class UStaticMesh>            R_AbilityPickupMesh;                               // 0x440(0x28)(Net, RepNotify, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        R_StackSize;                                       // 0x468(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        R_MaxStackSize;                                    // 0x46C(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  R_AssetId;                                         // 0x470(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_26B3[0xF8];                                    // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class AValAbilityPickup* GetDefaultObj();

	void SelectPickupRarity();
	void SelectPickupAbility();
	void OnStackSizeUpdated();
	void OnRep_StackSize();
	void OnRep_PickupRarity();
	void OnRep_PickupEquipSlot();
	void OnRep_PickupAbility();
	void OnRep_MaxStackSize();
	void OnRep_DungeonMods();
	void OnRep_AssetId();
	void OnRep_AbilityPickupMesh();
	void OnRep_AbilityLoaded();
	void OnRarityUpdated(enum class ERarity Rarity);
	void OnMaxStackSizeUpdated();
	void OnEquipSlotUpdated(const struct GameplayTags_GameplayTag& NewEquipSlot);
	void OnDungeonModsUpdated();
	void OnAssetIdUpdated();
	void OnAbilityUpdated(TSubclassOf<class UValGameplayAbility> Ability);
	void OnAbilityPickupMeshUpdated();
	int32 GetStackSize();
	enum class ERarity GetRarity();
	int32 GetMaxStackSize();
	struct GameplayTags_GameplayTag GetEquipSlot();
	class FName GetAssetId();
	TSoftObjectPtr<class UStaticMesh> GetAbilityPickupMesh();
	TSubclassOf<class UValGameplayAbility> GetAbility();
};

// 0x28 (0x628 - 0x600)
// Class Valhalla.ValAbilitySwappable
class UValAbilitySwappable : public UValGameplayAbility
{
public:
	enum class EValAbilitySwappableSwapType      DrawTimeType;                                      // 0x600(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2ACD[0x3];                                     // Fixing Size After Last Property  
	float                                        CustomGunDrawTime;                                 // 0x604(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EValAbilitySwappableSwapType      HolsterTimeType;                                   // 0x608(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2AF7[0x3];                                     // Fixing Size After Last Property  
	float                                        CustomGunHolsterTime;                              // 0x60C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsInterruptible;                                  // 0x610(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSwapDisabled;                                     // 0x611(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2B12[0x6];                                     // Fixing Size After Last Property  
	class AValCharacter*                         OwningCharacter;                                   // 0x618(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAbilityTask_WaitDelay*                DelayTask;                                         // 0x620(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UValAbilitySwappable* GetDefaultObj();

	void Wait_UseAbility();
	void Wait_HolsterAbility();
	void Wait_End();
	void Wait_DrawWeapon();
	void Wait_DrawAbility();
	void Wait_ApplyCooldown(float Time);
	bool TryConfirm();
	void SetSwapDisabled(bool Value);
	void SetHolsterTime(float NewTime);
	void PlayMontage(class UAnimMontage* Montage1P, class UAnimMontage* Montage3P, float Duration);
	void ModifySwappable(class AValCharacter* Character);
	float GetGunHolsterTime();
	float GetGunDrawTime();
	void DelayedApplyCooldownAndEndAbility();
	bool CheckSwappableCosts(class AValCharacter* Character);
};

// 0x170 (0x13C0 - 0x1250)
// Class Valhalla.ValAbilitySystemComponent
class UValAbilitySystemComponent : public UAbilitySystemComponent
{
public:
	uint8                                        Pad_3B81[0x8];                                     // Fixing Size After Last Property  
	TMap<enum class EValAbilityInputID, struct GameplayTags_GameplayTag> EquipSlotCooldowns;                                // 0x1258(0x50)(Edit, NativeAccessSpecifierPublic)
	TMap<enum class EValAbilityInputID, struct GameplayTags_GameplayTag> EquipSlotSecondaryCDs;                             // 0x12A8(0x50)(Edit, NativeAccessSpecifierPublic)
	TMap<enum class EValAbilityInputID, struct GameplayTags_GameplayTag> AbilityActivatedTags;                              // 0x12F8(0x50)(Edit, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActiveEffectDurationChanged;                     // 0x1348(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bPendingMontageRepForMesh;                         // 0x1358(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3BA1[0x7];                                     // Fixing Size After Last Property  
	TArray<struct Valhalla_GameplayAbilityLocalAnimMontageForMesh> LocalAnimMontageInfoForMeshes;                     // 0x1360(0x10)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct Valhalla_GameplayAbilityRepAnimMontageForMesh> RepAnimMontageInfoForMeshes;                       // 0x1370(0x10)(Net, ZeroConstructor, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            OnActiveAbilityActivated;                          // 0x1380(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActiveAbilityEndedSuccessfully;                  // 0x1390(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActiveAbilityCancelled;                          // 0x13A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct Valhalla_GameplayAbilityChargesInfo> R_AbilityCharges;                                  // 0x13B0(0x10)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UValAbilitySystemComponent* GetDefaultObj();

	bool TryActivateAbilityByClassAndInput(TSubclassOf<class UGameplayAbility> InAbilityToActivate, int32 InputID, bool bAllowRemoteActivation);
	bool SetGameplayEffectDurationHandle(const struct GameplayAbilities_ActiveGameplayEffectHandle& Handle, float NewDuration);
	void ServerCurrentMontageSetPlayRateForMesh(class USkeletalMeshComponent* InMesh, class UAnimMontage* ClientAnimMontage, float InPlayRate);
	void ServerCurrentMontageSetNextSectionNameForMesh(class USkeletalMeshComponent* InMesh, class UAnimMontage* ClientAnimMontage, float ClientPosition, class FName SectionName, class FName NextSectionName);
	void ServerCurrentMontageJumpToSectionNameForMesh(class USkeletalMeshComponent* InMesh, class UAnimMontage* ClientAnimMontage, class FName SectionName);
	void RemoveGameplayCueLocal(const struct GameplayTags_GameplayTag& GameplayCueTag, struct GameplayAbilities_GameplayCueParameters& GameplayCueParameters);
	void RefreshAllCharges();
	void OnRep_ReplicatedAnimMontageForMesh();
	void OnRep_Charges();
	void OnGameplayEffectDurationChange(struct GameplayAbilities_ActiveGameplayEffect* ActiveEffect);
	void OnAbilityEndedWithData(struct GameplayAbilities_AbilityEndedData& Data);
	void OnAbilityEnded(class UGameplayAbility* EndedAbility);
	void OnAbilityActivated(class UGameplayAbility* ActivatedAbility);
	void MulticastSwappableAbilityEnded(class UClass* Type);
	void MulticastSwappableAbilityActivated(class UClass* Type);
	void K2_RemoveLooseGameplayTags(struct GameplayTags_GameplayTagContainer& GameplayTags, int32 Count);
	void K2_RemoveLooseGameplayTag(struct GameplayTags_GameplayTag& GameplayTag, int32 Count);
	int32 K2_GetTagCount(const struct GameplayTags_GameplayTag& TagToCheck);
	void K2_AddLooseGameplayTags(struct GameplayTags_GameplayTagContainer& GameplayTags, int32 Count);
	void K2_AddLooseGameplayTag(struct GameplayTags_GameplayTag& GameplayTag, int32 Count);
	void IncreaseAllCooldowns(float Amount);
	void IncreaseActiveCooldownWithTag(float Amount, struct GameplayTags_GameplayTag& Tag);
	void IncreaseActiveCooldownsByPercent(float Value);
	void IncreaseActiveCooldowns(float Amount);
	class FString GetCurrentPredictionKeyStatus();
	struct GameplayAbilities_GameplayAbilitySpecHandle FindAbilitySpecHandleForClass(TSubclassOf<class UGameplayAbility> AbilityClass, class UObject* OptionalSourceObject);
	void ExecuteGameplayCueLocal(const struct GameplayTags_GameplayTag& GameplayCueTag, struct GameplayAbilities_GameplayCueParameters& GameplayCueParameters);
	void ClientRefreshAllCharges();
	void BP_RemoveGameplayCueWithParams(const struct GameplayTags_GameplayTag& GameplayCueTag);
	void BP_ExecuteGameplayCueWithParams(const struct GameplayTags_GameplayTag& GameplayCueTag, struct GameplayAbilities_GameplayCueParameters& GameplayCueParameters);
	struct GameplayAbilities_ActiveGameplayEffectHandle BP_ApplyGameplayEffectToTargetWithPrediction(TSubclassOf<class UGameplayEffect> GameplayEffectClass, class UAbilitySystemComponent* Target, float Level, const struct GameplayAbilities_GameplayEffectContextHandle& Context);
	struct GameplayAbilities_ActiveGameplayEffectHandle BP_ApplyGameplayEffectToSelfWithPrediction(TSubclassOf<class UGameplayEffect> GameplayEffectClass, float Level, const struct GameplayAbilities_GameplayEffectContextHandle& EffectContext);
	struct GameplayAbilities_ActiveGameplayEffectHandle BP_ApplyGameplayEffectSpecToSelfWithPrediction(struct GameplayAbilities_GameplayEffectSpecHandle& SpecHandle);
	void BP_AddGameplayCueWithParams(const struct GameplayTags_GameplayTag& GameplayCueTag, struct GameplayAbilities_GameplayCueParameters& GameplayCueParameter);
	bool BatchRPCTryActivateAbility(const struct GameplayAbilities_GameplayAbilitySpecHandle& InAbilityHandle, bool EndAbilityImmediately);
	void AddSourceObjectToEffectContext(struct GameplayAbilities_GameplayEffectContextHandle& EffectContextHandle, class UObject* SourceObject);
	void AddGameplayCueLocal(const struct GameplayTags_GameplayTag& GameplayCueTag, struct GameplayAbilities_GameplayCueParameters& GameplayCueParameters);
	void AddAbilityMaxCharge(const struct GameplayAbilities_GameplayAbilitySpecHandle& Handle, int32 Value);
};

// 0x7D0 (0xA78 - 0x2A8)
// Class Valhalla.ValAbilitySystemGlobals
class UValAbilitySystemGlobals : public UAbilitySystemGlobals
{
public:
	uint8                                        Pad_3C18[0x7D0];                                   // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAbilitySystemGlobals* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class Valhalla.ValAbilityKnockbackData
class UValAbilityKnockbackData : public UObject
{
public:
	struct CoreUObject_Vector                    KnockbackDirection;                                // 0x28(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        KnockbackMagnitude;                                // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InCurveTime;                                       // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           InKnockbackCurve;                                  // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValAbilityKnockbackData* GetDefaultObj();

};

// 0x118 (0x140 - 0x28)
// Class Valhalla.ValAbilityImpactData
class UValAbilityImpactData : public UObject
{
public:
	struct CoreUObject_Vector                    VelocityBeforeImpact;                              // 0x28(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    VelocityAfterImpact;                               // 0x40(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct Engine_HitResult                      Impact;                                            // 0x58(0xE8)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValAbilityImpactData* GetDefaultObj();

};

// 0x48 (0x648 - 0x600)
// Class Valhalla.ValAbilityUpgrade
class UValAbilityUpgrade : public UValGameplayAbility
{
public:
	bool                                         bForceListenSlot;                                  // 0x600(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUpgradeAlwaysActive;                              // 0x601(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSlotHeld;                                         // 0x602(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3D20[0x1];                                     // Fixing Size After Last Property  
	struct GameplayTags_GameplayTag              ListenSlot;                                        // 0x604(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3D24[0x4];                                     // Fixing Size After Last Property  
	class UValGameplayAbility*                   OwningAbility;                                     // 0x610(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                CachedAvatarActor;                                 // 0x618(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct GameplayAbilities_ActiveGameplayEffectHandle> ActiveEffectHandles;                               // 0x620(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct GameplayAbilities_GameplayEffectSpecHandle> EffectsToApplyHandles;                             // 0x630(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	float                                        GeneratedValue;                                    // 0x640(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3D2C[0x4];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAbilityUpgrade* GetDefaultObj();

	void UnapplyAbilityUpgrade();
	void SetOwningAbility(const struct GameplayAbilities_GameplayAbilitySpec& Ability);
	void SetListenSlot(struct GameplayTags_GameplayTag& Slot);
	void SetGeneratedValue(float Value);
	void RemoveActiveGameplayEffectHandles();
	void OnSlotDeviceHeldChanged();
	struct GameplayTags_GameplayTag GetListenSlot();
	float GetGeneratedValue();
	void EventUnapplyAbilityUpgrade();
	void EventApplyAbilityUpgrade(TSubclassOf<class UValGameplayAbility> Class, float Value, class UValGameplayAbility* Ability);
	void EventActivateUpgrade(float Value);
	void EquipSlotUpdated(const struct GameplayTags_GameplayTag& Slot);
	void ApplyAbilityUpgrade(class UValGameplayAbility* AbilityToUpgrade, float Value);
	void ActivateUpgrade(float Value);
};

// 0x28 (0xE8 - 0xC0)
// Class Valhalla.ValActivityTier
class UValActivityTier : public URH_ItemAsset
{
public:
	int32                                        RequiredCount;                                     // 0xC0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CompletionItemId;                                  // 0xC4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MinimumLevelRequired;                              // 0xC8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3D62[0x4];                                     // Fixing Size After Last Property  
	TArray<class URH_ItemAsset*>                 RewardAssets;                                      // 0xD0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                         bUnboundedProgress;                                // 0xE0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3D69[0x7];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValActivityTier* GetDefaultObj();

};

// 0x98 (0x158 - 0xC0)
// Class Valhalla.ValActivityAsset
class UValActivityAsset : public URH_ItemAsset
{
public:
	TArray<struct Valhalla_DailyContractLootMapping> DailyContractLootPools;                            // 0xC0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        ProgressItemId;                                    // 0xD0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ECD[0x4];                                     // Fixing Size After Last Property  
	TArray<int32>                                ActivityResetIds;                                  // 0xD8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UValActivityTier*>              Tiers;                                             // 0xE8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UValActivityPrerequisite*>      Prerequisites;                                     // 0xF8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UValActivityRequirement*>       Requirements;                                      // 0x108(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSubclassOf<class UValActivityTracker>       TrackerClass;                                      // 0x118(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         OwnershipRequired;                                 // 0x120(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AutoClaimReward;                                   // 0x121(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRequiresClaim;                                    // 0x122(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3ED3[0x5];                                     // Fixing Size After Last Property  
	TArray<class URH_ItemAsset*>                 ClaimAssets;                                       // 0x128(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	enum class EActivityType                     ActivityType;                                      // 0x138(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ClientManaged;                                     // 0x139(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ClientVisible;                                     // 0x13A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EActivityClientNotification       ClientNotification;                                // 0x13B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3EDA[0x4];                                     // Fixing Size After Last Property  
	class FText                                  MissionProgressMessage;                            // 0x140(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValActivityAsset* GetDefaultObj();

	bool IsTierUnlocked(int32 CurrentLevel, int32 Tier);
	int32 GetTotalTiersNeeded();
	int32 GetTotalProgressNeeded();
	int32 GetTierUnlockLevel(int32 Tier);
	int32 GetTierForProgress(int32 Progress, bool bShowCompleted);
	void GetRewardsForTier(int32 Tier, TArray<class URH_ItemAsset*>* Rewards);
	int32 GetProgressNeededForTier(int32 Tier, bool bCumulative);
	int32 GetProgressNeededForCompletion();
	int32 GetProgressId();
	int32 GetItemId();
	int32 GetCompletionIdForTier(int32 Tier);
	int32 GetCompletionId();
	void GetClaimLoot(TArray<class URH_ItemAsset*>* ClaimLoot);
	enum class EActivityType GetActivityType();
	TArray<int32> GetActivityResetIds();
};

// 0x130 (0x3C8 - 0x298)
// Class Valhalla.ValActivityPlayer
class AValActivityPlayer : public AActor
{
public:
	FMulticastInlineDelegateProperty_            OnActivityUnlocked;                                // 0x298(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActivityCompleted;                               // 0x2A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActivityInitialized;                             // 0x2B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActivityIncremented;                             // 0x2C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActivityTierReached;                             // 0x2D8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActivityPlayerLoaded;                            // 0x2E8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UDataAsset>>     R_ActivityAssets;                                  // 0x2F8(0x10)(Net, ZeroConstructor, RepNotify, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UDataAsset>>     R_MissionAssets;                                   // 0x308(0x10)(Net, ZeroConstructor, RepNotify, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                        Pad_3FCA[0x18];                                    // Fixing Size After Last Property  
	struct CoreUObject_Guid                      OwningPlayerId;                                    // 0x330(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UValActivityAsset*>             ActivityAssets;                                    // 0x340(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UValActivityAsset*>             MissionAssets;                                     // 0x350(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UValActivityPlayerInstance*>    ActivityInstances;                                 // 0x360(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AValPlayerController>   WeakOwningController;                              // 0x370(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class UValActivityPlayerInstance*, struct Valhalla_DailyContractRewards> ContractsToGrant;                                  // 0x378(0x50)(Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AValActivityPlayer* GetDefaultObj();

	void TurnInActivity(int32 ActivityId);
	void ServerTurnInActivity(int32 ActivityId);
	void ServerClaimActivityLoot(int32 ActivityId);
	void OnRep_MissionAssets();
	void OnRep_ActivityAssets();
	void OnPlayerInventoryReady(class UValPlayerInventory* PlayerInventory);
	void OnMissionAssetsLoaded();
	void OnInventoryUpdated(TArray<int32>& ItemIds);
	void OnInventoryLoaded();
	void OnInstanceOwnershipUpdated(class UValActivityPlayerInstance* ActivityInstance, bool bIsUnlocked);
	void OnGameStateSet(class AGameStateBase* GameState);
	void OnAssetsLoaded();
	void ClientUpdateActivity(int32 ActivityId, int32 InventoryCount, bool bIsOwned);
	void ClaimActivityLoot(int32 ActivityId);
	void AddProgress(int32 ActivityId, int32 Count);
};

// 0x140 (0x168 - 0x28)
// Class Valhalla.ValActivityPlayerInstance
class UValActivityPlayerInstance : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnActivityTierTurnedIn;                            // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActivityProgressUpdated;                         // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActivityOwnershipUpdated;                        // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_41DD[0x18];                                    // Fixing Size After Last Property  
	class UValActivityAsset*                     ActivityAsset;                                     // 0x70(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AValActivityPlayer*                    ActivityPlayer;                                    // 0x78(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UValActivityTracker*                   ActivityTracker;                                   // 0x80(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct RallyHereIntegration_RH_ItemInventory ActivityInventoryItem;                             // 0x88(0x90)(Protected, NativeAccessSpecifierProtected)
	TMap<class FString, double>                  PlatformProgressPerAchievement;                    // 0x118(0x50)(Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UValActivityPlayerInstance* GetDefaultObj();

	bool SetProgress(int32 Count);
	void SetOwnership(bool bOwned);
	void SetActivityFailed(bool Failed);
	bool ResetProgress();
	void OnTrackerProgress(int32 Count);
	void OnMissionProgress();
	void OnInventoryProgressUpdated();
	void OnInventoryOwnershipUpdated();
	void OnActivityTierReached(int32 Tier);
	bool IsUnlocked();
	bool IsTurnedIn();
	bool IsProgressUpdated();
	bool IsOwnershipUpdated();
	bool IsCurrentTierUnlocked();
	bool IsComplete();
	bool IsClaimed();
	bool IsActivityInitialized();
	bool HasLoadedInventory();
	int32 GetTotalProgressNeeded();
	bool GetTierCompletionTime(int32 Tier, struct CoreUObject_DateTime* Timestamp);
	bool GetProgressTime(struct CoreUObject_DateTime* Timestamp);
	int32 GetProgressNeededForTier(int32 Tier, bool bCumulative);
	int32 GetProgressInCurrentTier();
	int32 GetPendingProgress();
	class AValPlayerController* GetOwningController();
	int32 GetInitialProgress();
	bool GetCustomDataReward(class UValEquipmentAsset** OutEquipmentAsset, int32* Quantity, enum class ERarity* Rarity);
	int32 GetCurrentTierUnlockLevel();
	int32 GetCurrentTier();
	int32 GetCurrentProgress();
	bool GetCompletionTime(struct CoreUObject_DateTime* Timestamp);
	class UValActivityTracker* GetActivityTracker();
	class AValActivityPlayer* GetActivityPlayer();
	class UValActivityAsset* GetActivity();
	bool GetAcquiredTime(struct CoreUObject_DateTime* Timestamp);
	bool AddProgress(int32 Count);
};

// 0xC0 (0xE8 - 0x28)
// Class Valhalla.ValActivityTracker
class UValActivityTracker : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnProgress;                                        // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActivityMissionProgress;                         // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActivityMissionTimeout;                          // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UValActivityAsset>      ActivityAsset;                                     // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UValActivityPlayerInstance> ActivityPlayerInstance;                            // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIncrementOncePerMatch;                            // 0x68(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4269[0x1];                                     // Fixing Size After Last Property  
	bool                                         bInOneMatch;                                       // 0x6A(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_426B[0xD];                                     // Fixing Size After Last Property  
	struct Engine_TimerHandle                    TimeLimitTimer;                                    // 0x78(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseThresholds;                                    // 0x80(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUsePercentTreshold;                               // 0x81(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_426E[0x2];                                     // Fixing Size After Last Property  
	float                                        ThresholdPercent;                                  // 0x84(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ThresholdInterval;                                 // 0x88(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4271[0x4];                                     // Fixing Size After Last Property  
	class AValPlayerController*                  CachedController;                                  // 0x90(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ETeamSize                         ExpectedTeamSize;                                  // 0x98(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ETeamSize                         ActualTeamSize;                                    // 0x99(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4278[0x6];                                     // Fixing Size After Last Property  
	TSubclassOf<class AValGameModeBase>          SpecificGameMode;                                  // 0xA0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct GameplayTags_GameplayTag              InteractionTag;                                    // 0xA8(0x8)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTrackHealth;                                      // 0xB0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4280[0x3];                                     // Fixing Size After Last Property  
	float                                        MinHealth;                                         // 0xB4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxHealth;                                         // 0xB8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTrackShields;                                     // 0xBC(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4284[0x3];                                     // Fixing Size After Last Property  
	float                                        MinShields;                                        // 0xC0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxShields;                                        // 0xC4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTrackMatchTime;                                   // 0xC8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4287[0x3];                                     // Fixing Size After Last Property  
	float                                        MinTime;                                           // 0xCC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxTime;                                           // 0xD0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHasTimeLimit;                                     // 0xD4(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_428B[0x3];                                     // Fixing Size After Last Property  
	float                                        TrackerTimeLimit;                                  // 0xD8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct GameplayTags_GameplayTag              LocationTag;                                       // 0xDC(0x8)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_428D[0x4];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValActivityTracker* GetDefaultObj();

	void TierReached(class UValActivityPlayerInstance* PlayerInstance, int32 Tier);
	void OnTimeLimitExceeded();
	int32 GetProgressInCurrentTier();
	int32 GetPendingProgress();
	int32 GetInitialProgress();
	int32 GetCurrentProgress();
	int32 GetActivityId();
	bool CanAddProgress();
};

// 0x58 (0x140 - 0xE8)
// Class Valhalla.ValActivityTracker_Damage
class UValActivityTracker_Damage : public UValActivityTracker
{
public:
	struct GameplayTags_GameplayTagContainer     AbilityTags;                                       // 0xE8(0x20)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct GameplayTags_GameplayTagContainer     DamageSourceTags;                                  // 0x108(0x20)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                         bCountPlayers;                                     // 0x128(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCountBots;                                        // 0x129(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bKillingBlowsOnly;                                 // 0x12A(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDirectHitsOnly;                                   // 0x12B(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHeadshotsOnly;                                    // 0x12C(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCountPets;                                        // 0x12D(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTrackDistance;                                    // 0x12E(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_42C0[0x1];                                     // Fixing Size After Last Property  
	float                                        MinDistance;                                       // 0x130(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxDistance;                                       // 0x134(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSourceIsFalling;                                  // 0x138(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTargetIsFalling;                                  // 0x139(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIncrementByDamageAmount;                          // 0x13A(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_42CA[0x5];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValActivityTracker_Damage* GetDefaultObj();

	void OnDamage(struct CoreUObject_Guid& PlayerUuid, struct Valhalla_DamageData& DamageData, class AActor* Target);
};

// 0x20 (0x160 - 0x140)
// Class Valhalla.ValActivityTracker_BotType
class UValActivityTracker_BotType : public UValActivityTracker_Damage
{
public:
	struct GameplayTags_GameplayTagContainer     BotTypes;                                          // 0x140(0x20)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UValActivityTracker_BotType* GetDefaultObj();

};

// 0x8 (0xF0 - 0xE8)
// Class Valhalla.ValActivityTracker_DogTag
class UValActivityTracker_DogTag : public UValActivityTracker
{
public:
	bool                                         bRewardReputationAmount;                           // 0xE8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_42E5[0x7];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValActivityTracker_DogTag* GetDefaultObj();

	void OnDogTagFound(bool IsFriendly, int32 Split, struct Valhalla_InventoryItem& InventoryItem, enum class EPlayerLevelType LevelType);
};

// 0x48 (0x130 - 0xE8)
// Class Valhalla.ValActivityTracker_Elimination
class UValActivityTracker_Elimination : public UValActivityTracker
{
public:
	struct GameplayTags_GameplayTagContainer     AbilityTags;                                       // 0xE8(0x20)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct GameplayTags_GameplayTagContainer     DamageSourceTags;                                  // 0x108(0x20)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                         bCountPlayers;                                     // 0x128(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCountBots;                                        // 0x129(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_42FA[0x6];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValActivityTracker_Elimination* GetDefaultObj();

	void OnElimination(struct Valhalla_DamageData& DamageData, class AActor* Target);
};

// 0x48 (0x130 - 0xE8)
// Class Valhalla.ValActivityTracker_ExtractedLoot
class UValActivityTracker_ExtractedLoot : public UValActivityTracker
{
public:
	uint8                                        Pad_4304[0x8];                                     // Fixing Size After Last Property  
	TArray<class UDataAsset*>                    LootToTrack;                                       // 0xF0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                         bValuableFlag;                                     // 0x100(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4307[0x7];                                     // Fixing Size After Last Property  
	TArray<enum class ERarity>                   RarityFilters;                                     // 0x108(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bRequireFoundInMatch;                              // 0x118(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4308[0x17];                                    // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValActivityTracker_ExtractedLoot* GetDefaultObj();

};

// 0x18 (0x100 - 0xE8)
// Class Valhalla.ValActivityTracker_Extraction
class UValActivityTracker_Extraction : public UValActivityTracker
{
public:
	bool                                         bUsedEnemyPortal;                                  // 0xE8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4317[0x7];                                     // Fixing Size After Last Property  
	TArray<struct Valhalla_StatComparison>       StatsToTrack;                                      // 0xF0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UValActivityTracker_Extraction* GetDefaultObj();

	void OnPlayerExtracted();
};

// 0x0 (0xE8 - 0xE8)
// Class Valhalla.ValActivityTracker_FirstBlood
class UValActivityTracker_FirstBlood : public UValActivityTracker
{
public:

	static class UClass* StaticClass();
	static class UValActivityTracker_FirstBlood* GetDefaultObj();

};

// 0x0 (0xE8 - 0xE8)
// Class Valhalla.ValActivityTracker_Lights
class UValActivityTracker_Lights : public UValActivityTracker
{
public:

	static class UClass* StaticClass();
	static class UValActivityTracker_Lights* GetDefaultObj();

};

// 0x0 (0xE8 - 0xE8)
// Class Valhalla.ValActivityTracker_OpenCrate
class UValActivityTracker_OpenCrate : public UValActivityTracker
{
public:

	static class UClass* StaticClass();
	static class UValActivityTracker_OpenCrate* GetDefaultObj();

	void OnCrateOpened();
};

// 0x8 (0xF0 - 0xE8)
// Class Valhalla.ValActivityTracker_Stat
class UValActivityTracker_Stat : public UValActivityTracker
{
public:
	enum class EGameStatType                     StatToTrack;                                       // 0xE8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4330[0x7];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValActivityTracker_Stat* GetDefaultObj();

};

// 0x70 (0xA0 - 0x30)
// Class Valhalla.ValActivityConfigData
class UValActivityConfigData : public UDataAsset
{
public:
	int32                                        DailyActivitiesPerDay;                             // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BonusVIPActivities;                                // 0x34(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxDailyActivities;                                // 0x38(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BonusVIPMaxActivities;                             // 0x3C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxDailyContractRewards;                           // 0x40(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4334[0x4];                                     // Fixing Size After Last Property  
	TArray<struct Valhalla_DailyContractLootMapping> DailyContractLootPools;                            // 0x48(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UDataAsset>>     SeasonChallenges;                                  // 0x58(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UDataAsset>>     DailyContracts;                                    // 0x68(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UDataAsset>>     AgentMissions;                                     // 0x78(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UDataAsset>>     Accolades;                                         // 0x88(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	int32                                        MissionProgressRewardXp;                           // 0x98(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_433A[0x4];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValActivityConfigData* GetDefaultObj();

};

// 0x100 (0x130 - 0x30)
// Class Valhalla.ValMissionConfig
class UValMissionConfig : public UDataAsset
{
public:
	TMap<enum class EMissionDiffuclty, struct Valhalla_MissionReward> MissionRewards;                                    // 0x30(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                        MinimumMissionScoring;                             // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumOfMissionsRolled;                               // 0x84(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UValActivityAsset*                     MissionAsset;                                      // 0x88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<enum class EMissionDiffuclty, int32>    DifficultyMap;                                     // 0x90(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<struct GameplayTags_GameplayTag, struct Valhalla_WorldMissionConfig> WorldConfigs;                                      // 0xE0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValMissionConfig* GetDefaultObj();

};

// 0x68 (0x98 - 0x30)
// Class Valhalla.ValMissionSequenceAsset
class UValMissionSequenceAsset : public UDataAsset
{
public:
	int32                                        DifficultyRating;                                  // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              AgentTag;                                          // 0x34(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_436B[0x4];                                     // Fixing Size After Last Property  
	struct Valhalla_MissionSequenceElement       MissionElement;                                    // 0x40(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         RequiresSubsequentMission;                         // 0x70(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_436E[0x7];                                     // Fixing Size After Last Property  
	TArray<class UValMissionSequenceAsset*>      SubsequentMissions;                                // 0x78(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UValMissionSequenceAsset*>      BlockedMissions;                                   // 0x88(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValMissionSequenceAsset* GetDefaultObj();

};

// 0x110 (0x140 - 0x30)
// Class Valhalla.ValAgentConfig
class UValAgentConfig : public UPrimaryDataAsset
{
public:
	class FText                                  DisplayName;                                       // 0x30(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             InfoPanelIcon;                                     // 0x48(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             MissionRowIcon;                                    // 0x70(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             PortraitIcon;                                      // 0x98(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             PortraitIconHighlighted;                           // 0xC0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             NotificationIcon;                                  // 0xE8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              AgentTag;                                          // 0x110(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UValEquipmentAsset>     CurrencyItem;                                      // 0x118(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValAgentConfig* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Valhalla.ValAIBlueprintHelperLibrary
class UValAIBlueprintHelperLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UValAIBlueprintHelperLibrary* GetDefaultObj();

	void UpdatePerceptionSightConfig(class AAIController* Controller, float SightRadius, float LoseSightRadius, float PeripheralVisionAngleDegrees);
	void UpdatePerceptionHearingConfig(class AAIController* Controller, float HearingRadius);
	void UnregisterAsCoverWithSightManager(class UObject* WorldContextObject, class AActor* InActor);
	void SyncLoadBotData(class UValBotData* BotData);
	void SpawnBotGroup(class UObject* WorldContextObject, class UValBotWaveConfig* SpawnConfig, TArray<struct CoreUObject_Transform>& SpawnLocations, bool bTreatNullBotDataAsValid, TArray<class AValCharacter*>* OutBots, class AValBotSpawnVolume* OwningVolume);
	class APawn* SpawnAIFromClassWithData(class UObject* WorldContextObject, TSubclassOf<class APawn> PawnClass, class UValBotData* ConfigData, class UBehaviorTree* BehaviorTree, const struct CoreUObject_Vector& Location, const struct CoreUObject_Rotator& Rotation, bool bNoCollisionFail, class AActor* Owner);
	void SetCanEverAffectNavigation(class UActorComponent* Component, bool bCanAffectNavigation);
	void RegisterAsCoverWithSightManager(class UObject* WorldContextObject, class AActor* InActor);
	struct CoreUObject_Vector PredictTargetLocation(class UObject* WorldContextObject, class AActor* TargetActor, float PredictionTime);
	bool IsLocationWithinBuilding(class UObject* WorldContextObject, const struct CoreUObject_Vector& InLocation);
	bool IsLocationOnNavMesh(class UObject* WorldContextObject, const struct CoreUObject_Vector& InLocation, struct CoreUObject_Vector* OutClosestNavMeshLocation);
	bool IsCybridTeamID(class UObject* WorldContextObject, int32 TeamNum);
	bool IsCybridCalmTowardsTarget(class AActor* CybridActor, class AActor* TargetActor);
	bool HasEffectiveAim(class UObject* WorldContextObject, const struct CoreUObject_Vector& MuzzleLocation, class AActor* TargetActor, struct CoreUObject_Vector* EffectiveAimLocation, const struct CoreUObject_Vector& PredictedLocation);
	void GetSpawnBotGroupData(class UObject* WorldContextObject, class UValBotWaveConfig* SpawnConfig, TMap<struct GameplayTags_GameplayTag, struct Valhalla_BotTransformData>* SpawnLocations, bool bTreatNullBotDataAsValid, float SpawnPercentModifier, TArray<struct Valhalla_ValBotWaveSetSpawnData>* OutBotData);
	bool GetSlopeAngleFromActor(class AActor* SourceActor, const struct CoreUObject_Vector& EndOffsetFromActorLocation, float* OutSlopeAngle);
	bool GetSlopeAngle(struct CoreUObject_Vector& TraceStart, struct CoreUObject_Vector& TraceEnd, class AActor* SourceActor, float* OutSlopeAngle);
	bool GetRotationTowardsTarget(class AValCharacter* ValOwner, struct CoreUObject_Rotator* Rotation);
	float GetPerceptionHearingRadius(class AAIController* Controller);
	class ATeamState* GetHazardsTeam(class UObject* WorldContextObject);
	bool GetDoorExitPoints(class UObject* WorldContextObject, TSubclassOf<class AActor> ActorClass, TArray<class AActor*>* OutActors);
	bool GetAlarmSpawnWave(class UObject* WorldContextObject, class AValUtopiaConstructor* OwningConstructor, TArray<class UValBotWaveConfig*>* SpawnWaves);
	class UValBotWaveConfig* GetAlarmSpawnConfig(class UObject* WorldContextObject, class AValUtopiaConstructor* OwningConstructor);
	class ATeamState* GetAITeam(class UObject* WorldContextObject);
	struct CoreUObject_Vector GetActorPredictedHeadLocation(class AActor* Actor, struct CoreUObject_Vector& PredictedLocation);
	struct CoreUObject_Vector GetActorHeadLocation(class AActor* Actor);
	struct CoreUObject_Vector GetAccelerationFromJetpack(class UObject* WorldContextObject, class AActor* TargetActor, float PredictionTime);
	struct CoreUObject_Vector GetAccelerationFromFalling(class UObject* WorldContextObject, class AActor* TargetActor, float PredictionTime);
	void FindNearbyCoverFromSightManager(class UObject* WorldContextObject, const struct CoreUObject_Vector& Location, float Radius, TArray<class AActor*>* OutCoverActors);
	bool DoesPathExistToTarget(class UObject* WorldContextObject, class AActor* SourceActor, class AActor* TargetActor);
	bool DoesPathExistToLocation(class UObject* WorldContextObject, class AActor* SourceActor, struct CoreUObject_Vector& TargetLocation);
	float CalculateBotReactionTimeForTarget(class UValBotData* BotData, class AValCharacter* Target);
	float CalculateBotAccuracyForTarget(class UValBotData* BotData, class AValCharacter* Target);
};

// 0x98 (0x458 - 0x3C0)
// Class Valhalla.ValAIController
class AValAIController : public AAIController
{
public:
	uint8                                        Pad_4530[0x8];                                     // Fixing Size After Last Property  
	bool                                         bIsInBuilding;                                     // 0x3C8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4532[0x7];                                     // Fixing Size After Last Property  
	FMulticastInlineDelegateProperty_            OnLoadoutChange;                                   // 0x3D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPredictedLocationSet;                            // 0x3E0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFocusChanged;                                    // 0x3F0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBuildingStatusChanged;                           // 0x400(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBlackboardReady;                                 // 0x410(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bHasOverriddenBehaviorTree;                        // 0x420(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4539[0x7];                                     // Fixing Size After Last Property  
	struct Engine_TimerHandle                    RespawnAITimer;                                    // 0x428(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AValReviveBeacon>> RevivableTeammates;                                // 0x430(0x10)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                         bUpdateControlRotation;                            // 0x440(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_453C[0x7];                                     // Fixing Size After Last Property  
	class UValBotData*                           BotConfigData;                                     // 0x448(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TurnRateInDegPerSec;                               // 0x450(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_453E[0x4];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class AValAIController* GetDefaultObj();

	void UpdateReviveBeaconTarget();
	void UpdateBlackboardKeyValueAsVector(class FName Key, const struct CoreUObject_Vector& Value);
	void UpdateBlackboardKeyValueAsObject(class FName Key, class UObject* Value);
	void UpdateBlackboardKeyValueAsEnum(class FName Key, uint8 Value);
	void UpdateBlackboardKeyValueAsBool(class FName Key, bool Value);
	void ToggleTargetingAllAI();
	void ToggleShootingAllAI();
	void TogglePauseAllAI();
	void SetTetherRadius(float Radius);
	void SetIsCurrentlyInBuilding();
	void SetBotLeader(class AValCharacter* Leader);
	void RespawnAIDeferred(float Time, bool bFindRespawnPoint);
	void Respawn(bool bFindRespawnPoint);
	void OnTeamChanged(int32 OldTeamId, int32 NewTeamId);
	void OnReviveBeaconStarted(class AValReviveBeacon* Beacon);
	void OnReviveBeaconDestroyed(class AActor* Actor);
	void OnReviveBeacon(class AValReviveBeacon* Beacon);
	void OnPortalState(enum class EGameObjectiveState PortalState);
	void OnLegendaryArtifact();
	void OnExtractionPodsUpdated();
	void OnCharacterSetupComplete(class AValCharacter* Bot);
	void OnBotLoadoutChanged();
	void OnBotLeaderSet(class AValCharacter* Leader);
	void OnActivePortals();
	void OnActiveLootExtractions();
	bool IsPlayerBotController();
	bool IsInBuilding();
	class AValCharacter* GetValCharacter();
	class UValBotData* GetBotConfigData();
	void EnableControlRotation();
	void EnableAI();
	void DisableControlRotation();
	void DisableAI();
	void DebugDump();
	void AddNewReviveBeacon(class AValReviveBeacon* Beacon);
};

// 0x0 (0x458 - 0x458)
// Class Valhalla.ValAIController_NPC
class AValAIController_NPC : public AValAIController
{
public:

	static class UClass* StaticClass();
	static class AValAIController_NPC* GetDefaultObj();

	void StartBehaviorTree(class AValCharacter* ValChar);
};

// 0xE0 (0x108 - 0x28)
// Class Valhalla.ValAIFSM
class UValAIFSM : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnStateChangedDel;                                 // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              Tag;                                               // 0x38(0x8)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                DebugDisplayName;                                  // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UValAIFSM_State>           StartingStateClass;                                // 0x50(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct GameplayTags_GameplayTag              TimeoutTag;                                        // 0x58(0x8)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDebug;                                            // 0x60(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_45A2[0x3];                                     // Fixing Size After Last Property  
	TWeakObjectPtr<class AValCharacter>          Character;                                         // 0x64(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_45A4[0x4];                                     // Fixing Size After Last Property  
	class UValAIFSM_State*                       StartingState;                                     // 0x70(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UValAIFSM_State*                       CurrentState;                                      // 0x78(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct GameplayTags_GameplayTag, class UValAIFSM_State*> StateMap;                                          // 0x80(0x50)(Transient, Protected, NativeAccessSpecifierProtected)
	struct GameplayTags_GameplayTagContainer     ActiveTransitionTags;                              // 0xD0(0x20)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	bool                                         bRespectingMinStateTime;                           // 0xF0(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_45A9[0x3];                                     // Fixing Size After Last Property  
	TWeakObjectPtr<class UValAIFSMComponent>     FSMComp;                                           // 0xF4(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_45AA[0xC];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAIFSM* GetDefaultObj();

	void StopMachineBP();
	void StopMachine();
	void StateTimerExpired();
	void StartMachineWithStartStateOverride(class AValCharacter* InBot, const struct GameplayTags_GameplayTag& StartStateOverrideTag);
	void StartMachineBP();
	void StartMachine(class AValCharacter* InBot);
	void ReevaluateTransition();
	bool IsStarted();
	bool IsDebug();
	void InitializeBP();
	void Initialize();
	void GotoState(const struct GameplayTags_GameplayTag& NextStateTag, bool bForce);
	struct GameplayTags_GameplayTag GetTag();
	class UValAIFSM_State* GetState(const struct GameplayTags_GameplayTag& InTag);
	void GetDebugDisplayNameBP(class FString* OutDisplayName);
	class AValCharacter* GetCharacter();
	void GenerateActiveTransitionTags();
	void DebugDump();
	void DebugDisplayLayout();
	void CollectChildFSMsAndSelf(TArray<class UValAIFSM*>* OutAllFSMs);
	void CheckForTransition();
};

// 0xD0 (0xF8 - 0x28)
// Class Valhalla.ValAIFSM_State
class UValAIFSM_State : public UObject
{
public:
	struct GameplayTags_GameplayTag              Tag;                                               // 0x28(0x8)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                DebugDisplayName;                                  // 0x30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct Valhalla_AIFSM_StateTransitionData> TransitionData;                                    // 0x40(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        MinTimeInState;                                    // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxTimeInState;                                    // 0x54(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeInStateVariance;                               // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_45D6[0x4];                                     // Fixing Size After Last Property  
	TSubclassOf<class UValAIFSM>                 ChildFSMClass;                                     // 0x60(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UBehaviorTree>          BehaviorTreeClass;                                 // 0x68(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UGameplayEffect>>   EffectsToApply;                                    // 0x90(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UValAIFSM*                             OwningFSM;                                         // 0xA0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UValAIFSM*                             ChildFSM;                                          // 0xA8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UBehaviorTree>          OverwriteBehaviorTreeClass;                        // 0xB0(0x28)(BlueprintVisible, Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsActive;                                         // 0xD8(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_45DB[0x7];                                     // Fixing Size After Last Property  
	TArray<struct GameplayAbilities_ActiveGameplayEffectHandle> ActiveEffectHandles;                               // 0xE0(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_45DC[0x8];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAIFSM_State* GetDefaultObj();

	void TimeoutTimerExpired();
	void StartStateBP();
	void ResetStateTimeout(float NewTimeoutTime);
	void OverwriteTimeInStateVariables();
	void OverwritePersonalityBehaviorTree();
	void OverwriteBehaviorTreeBP();
	bool IsActive();
	struct GameplayTags_GameplayTag GetTag();
	float GetMinTimeInState();
	class AValCharacter* GetCharacter();
	void EndStateBP();
	void DebugDump();
	void DebugDisplayLayout();
	void CheckForTransition(struct GameplayTags_GameplayTagContainer& ActiveTransitionTags);
	void AddActiveEffectToRemovalList(struct GameplayAbilities_ActiveGameplayEffectHandle& ActiveHandle);
};

// 0x98 (0x138 - 0xA0)
// Class Valhalla.ValAIFSMComponent
class UValAIFSMComponent : public UActorComponent
{
public:
	TSubclassOf<class UValAIFSM>                 FSMClass;                                          // 0xA0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UValAIAudioCueAgent>       AIAudioCueAgentClass;                              // 0xA8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UValAIFSM*                             FSM;                                               // 0xB0(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UValAIAudioCueAgent*                   AIAudioCueAgent;                                   // 0xB8(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct Valhalla_ValFSMStateData>      R_CurrentStates;                                   // 0xC0(0x10)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, RepNotify, Protected, NativeAccessSpecifierProtected)
	TMap<struct GameplayTags_GameplayTag, struct GameplayTags_GameplayTag> LastStateMap;                                      // 0xD0(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<struct Valhalla_ValFSMDelegateData>   DelegateData;                                      // 0x120(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                         bStartRequested;                                   // 0x130(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4609[0x7];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAIFSMComponent* GetDefaultObj();

	void StopMachine();
	void StartMachineWithStartStateOverride(const struct GameplayTags_GameplayTag& StartStateOverrideTag);
	void StartMachine();
	void RegisterStartStateHandler(const struct GameplayTags_GameplayTag& FSM, const struct GameplayTags_GameplayTag& State, FDelegateProperty_ HandlerDelegate);
	void RegisterEndStateHandler(const struct GameplayTags_GameplayTag& FSM, const struct GameplayTags_GameplayTag& State, FDelegateProperty_ HandlerDelegate);
	void OnRep_CurrentStates();
	bool IsStarted();
	void GetAllFSMs(TArray<class UValAIFSM*>* OutAllFSMs);
	class UValAIAudioCueAgent* GetAIAudioCueAgent();
	void DebugDump();
};

// 0x48 (0x208 - 0x1C0)
// Class Valhalla.ValAimAssistComponent
class UValAimAssistComponent : public UUASAimAssistComponent
{
public:
	bool                                         bEnableSnapToTarget;                               // 0x1C0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4613[0x47];                                    // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAimAssistComponent* GetDefaultObj();

	void OnPawnChanged(class APawn* Pawn);
	void OnOwnerEquippedWeaponUpdated(const struct GameplayTags_GameplayTag& EquipSlot);
};

// 0x18 (0x250 - 0x238)
// Class Valhalla.ValAimAssistConfigDataAsset
class UValAimAssistConfigDataAsset : public UUASAimAssistConfigDataAsset
{
public:
	bool                                         bSnapToTargetConfig;                               // 0x238(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4615[0x3];                                     // Fixing Size After Last Property  
	struct Valhalla_ValSnapToTargetConfig        SnapToTargetConfig;                                // 0x23C(0xC)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bLeadTargets;                                      // 0x248(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4617[0x7];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAimAssistConfigDataAsset* GetDefaultObj();

};

// 0x0 (0xC0 - 0xC0)
// Class Valhalla.ValAimAssistTargetComponent
class UValAimAssistTargetComponent : public UUASAimAssistTargetComponent
{
public:

	static class UClass* StaticClass();
	static class UValAimAssistTargetComponent* GetDefaultObj();

};

// 0x10 (0xB0 - 0xA0)
// Class Valhalla.ValVisibleToAIComponent
class UValVisibleToAIComponent : public UActorComponent
{
public:
	struct CoreUObject_IntPoint                  CurrentCoordinates;                                // 0xA0(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  VisibilityType;                                    // 0xA8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UValVisibleToAIComponent* GetDefaultObj();

	void SetVisibilityType(class FName NewType);
	bool IsVisibleTo(class FName SupportedType);
	class FName GetVisibilityType();
};

// 0x0 (0xA0 - 0xA0)
// Class Valhalla.ValAICoverComponent
class UValAICoverComponent : public UActorComponent
{
public:

	static class UClass* StaticClass();
	static class UValAICoverComponent* GetDefaultObj();

	void OnSightManagerReady(class AValSightManager* PSightManager);
};

// 0x18 (0xB8 - 0xA0)
// Class Valhalla.ValAIVisionObscurerComponent
class UValAIVisionObscurerComponent : public UActorComponent
{
public:
	int32                                        PartitionX0;                                       // 0xA0(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PartitionY0;                                       // 0xA4(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PartitionX1;                                       // 0xA8(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PartitionY1;                                       // 0xAC(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0xB0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ECollisionChannel                 CollisionChannel;                                  // 0xB4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4637[0x3];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAIVisionObscurerComponent* GetDefaultObj();

	void OnSightManagerReady(class AValSightManager* PSightManager);
};

// 0xA0 (0x338 - 0x298)
// Class Valhalla.ValSightManager
class AValSightManager : public AActor
{
public:
	int32                                        MapSizeInTilesX;                                   // 0x298(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MapSizeInTilesY;                                   // 0x29C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct Valhalla_SightSpacePartition>  Partitions;                                        // 0x2A0(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class UValVisibleToAIComponent>> AllTrackedComponents;                              // 0x2B0(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct Valhalla_LevelGrid                    LevelGrid;                                         // 0x2C0(0x50)(Edit, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        DebugVisualizeRange;                               // 0x310(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DebugVisualizeUpdateDistance;                      // 0x314(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDebugVisualizeCover;                              // 0x318(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_463F[0x7];                                     // Fixing Size After Last Property  
	struct CoreUObject_Vector                    DebugLastVisualizeLocation;                        // 0x320(0x18)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AValSightManager* GetDefaultObj();

};

// 0x180 (0x220 - 0xA0)
// Class Valhalla.ValAISightComponent
class UValAISightComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnBotSightGainedDel;                               // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBotSightLostDel;                                 // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EVisionShape                      VisionShape;                                       // 0xC0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_467F[0x3];                                     // Fixing Size After Last Property  
	class FName                                  VisionTypeToSee;                                   // 0xC4(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DefaultSightRadius;                                // 0xCC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SightRadius;                                       // 0xD0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LoseSightRadius;                                   // 0xD4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SprintDetectionRadius;                             // 0xD8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PeripheralVisionAngle;                             // 0xDC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        VisionPlaneHalfWidth;                              // 0xE0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        NearClippingRadius;                                // 0xE4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PointOfViewBackwardOffset;                         // 0xE8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SightUpdateTimeInSec;                              // 0xEC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxVisibilityDecayTime;                            // 0xF0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MinDistanceChangeForViewCheck;                     // 0xF4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxNoCheckTime;                                    // 0xF8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxSimultaneousAsyncTraces;                        // 0xFC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanSee;                                           // 0x100(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseCustomViewRotation;                            // 0x101(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4685[0x2];                                     // Fixing Size After Last Property  
	float                                        CustomViewLocationOffset;                          // 0x104(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct GameplayTags_GameplayTagContainer     SightInvisibleTags;                                // 0x108(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                         bDisplayDebug;                                     // 0x128(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4687[0x3];                                     // Fixing Size After Last Property  
	int32                                        BlindnessStacks;                                   // 0x12C(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4688[0xF0];                                    // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAISightComponent* GetDefaultObj();

	bool UpdateSightRadius(float NewSightRadius);
	bool UpdatePeripheralVisionAngle(float NewPeripheralVisionAngleDegrees);
	bool UpdateLoseSightRadius(float NewLoseSightRadius);
	void SightCheckHandler(class AActor* Target, TArray<TWeakObjectPtr<class UValAIVisionObscurerComponent>>& VisionObscurers);
	bool ShouldSee();
	void SetVisionType(class FName NewType);
	void SetCustomViewLocationOffset(float Value);
	void SetCanSee(bool bInCanSee);
	void RemoveBlindnessStack();
	void OnViewedActorTagChanged(const struct GameplayTags_GameplayTag& InTag, int32 NewCount);
	void OnViewedActorDied(float TimeToRespawn, class AValCharacter* Pawn);
	bool IsBlinded();
	class FName GetVisionType();
	float GetPeripheralVisionAngle();
	float GetNearClippingRadius();
	float GetMinRange();
	float GetMaxRange();
	float GetLoseSightRadius();
	float GetDefaultSightRadius();
	void DebugDump();
	void ClearGameplayTagEvents(class AActor* LostActor);
	void BindGameplayTagEvents(class AActor* ViewedActor);
	void AddBlindnessStack();
};

// 0x88 (0xB0 - 0x28)
// Class Valhalla.ValSquad
class UValSquad : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnSquadReachedWaypoint;                            // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_469F[0x10];                                    // Fixing Size After Last Property  
	float                                        TooCloseToLastWaypointDistance;                    // 0x48(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TooCloseToFogDistance;                             // 0x4C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDebug;                                            // 0x50(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bRecord;                                           // 0x51(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_46A0[0x2];                                     // Fixing Size After Last Property  
	float                                        RecordRate;                                        // 0x54(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AValCharacter>>  Members;                                           // 0x58(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class AValDungeonGenerator*                  DungeonLayout;                                     // 0x68(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct CoreUObject_IntPoint>          VisitedQuadrants;                                  // 0x70(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<struct CoreUObject_Vector>            LocationRecord;                                    // 0x80(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	struct CoreUObject_Vector                    LastLocationRecord;                                // 0x90(0x18)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LastRecordTime;                                    // 0xA8(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_46A5[0x4];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValSquad* GetDefaultObj();

	void UpdateForMember(class AValCharacter* InMember);
	void ToggleRecord(bool bOn);
	class AValCharacter* GetLeader();
	void DumpLocationRecord(TArray<struct CoreUObject_Vector>* OutLocationCache);
	bool ChooseNextWaypoint(class AValCharacter* InMember, bool bMeanderToCenter, struct CoreUObject_Vector* OutWaypoint);
};

// 0x28 (0x58 - 0x30)
// Class Valhalla.ValBotWaveConfig
class UValBotWaveConfig : public UDataAsset
{
public:
	TArray<struct Valhalla_ValBotGroupConfig>    SpawnSet;                                          // 0x30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        PreSpawnDelayInSec;                                // 0x40(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PostSpawnDelayInSec;                               // 0x44(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalSpawnPoints;                                  // 0x48(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalSpawnPointsSolos;                             // 0x4C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseGroupNumber;                                   // 0x50(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_46B1[0x7];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValBotWaveConfig* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Valhalla.ValAkRoomObject
class IValAkRoomObject : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IValAkRoomObject* GetDefaultObj();

	void SetAssociatedAkRoom(class AValAkRoom* Room);
	struct CoreUObject_Vector AkGetLocation();
	void AkEnable();
	void AkDisable();
};

// 0x0 (0x38 - 0x38)
// Class Valhalla.ValAnimNotifyInitRagdoll
class UValAnimNotifyInitRagdoll : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UValAnimNotifyInitRagdoll* GetDefaultObj();

};

// 0x78 (0x310 - 0x298)
// Class Valhalla.ValArtifactDeposit
class AValArtifactDeposit : public AActor
{
public:
	uint8                                        Pad_46E3[0x8];                                     // Fixing Size After Last Property  
	class USceneComponent*                       SceneComponent;                                    // 0x2A0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USphereComponent*                      InteractCollisionComp;                             // 0x2A8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  InteractText;                                      // 0x2B0(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AValCharacter>          CachedInitiator;                                   // 0x2C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct Valhalla_PendingItem>          R_DepositedItems;                                  // 0x2D0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, RepNotify, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_46E4[0x18];                                    // Fixing Size After Last Property  
	TArray<class AValCharacter*>                 CharactersThatCanInteract;                         // 0x2F8(0x10)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                        CreditCost;                                        // 0x308(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_46E5[0x4];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class AValArtifactDeposit* GetDefaultObj();

	void OnRep_DepositedItems();
	void OnDepositComplete(TArray<struct Valhalla_PendingItem>& ItemsDeposited);
	void Interact(class AValCharacter* Initiator);
	enum class EInteractType GetInteractType();
	class FText GetInteractText();
	class UPrimitiveComponent* GetInteractComponent();
	bool CanInteract(class AValCharacter* Initiator);
};

// 0x0 (0xA0 - 0xA0)
// Class Valhalla.ValClassComponentBase
class UValClassComponentBase : public UActorComponent
{
public:

	static class UClass* StaticClass();
	static class UValClassComponentBase* GetDefaultObj();

	bool HasModsForTag(const struct GameplayTags_GameplayTag& TagToCheck);
	class AValCharacter* GetValCharacter();
	void GetPassivePropertyModValues(const struct GameplayTags_GameplayTag& PassiveIdTag, const struct GameplayTags_GameplayTag& PropertyTag, TArray<float>* OutValues);
	void CalcPropertyModifiers();
	void ApplyDamageResistanceModifier(float& OutPercentModifier, float& OutFlatModifier, float& OutShieldModifier, float Damage, struct GameplayAbilities_GameplayEffectContextHandle& DamageContext);
	void ApplyDamageOutputModifier(float& OutPercentModifier, float& OutFlatModifier, float Damage, struct GameplayAbilities_GameplayEffectContextHandle& DamageContext);
};

// 0x0 (0xA0 - 0xA0)
// Class Valhalla.ValAssaultClassComponent
class UValAssaultClassComponent : public UValClassComponentBase
{
public:

	static class UClass* StaticClass();
	static class UValAssaultClassComponent* GetDefaultObj();

};

// 0x0 (0x570 - 0x570)
// Class Valhalla.ValAssetManager
class UValAssetManager : public URH_AssetManager
{
public:

	static class UClass* StaticClass();
	static class UValAssetManager* GetDefaultObj();

};

// 0x398 (0x458 - 0xC0)
// Class Valhalla.ValEquipmentAsset
class UValEquipmentAsset : public URH_ItemAsset
{
public:
	struct GameplayTags_GameplayTag              EquipSlot;                                         // 0xC0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayAbility>          AbilityClass;                                      // 0xC8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBeStashed;                                     // 0xD0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_471F[0x7];                                     // Fixing Size After Last Property  
	class UDataAsset*                            Mesh;                                              // 0xD8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                    Material;                                          // 0xE0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct Valhalla_EquipmentModParamsList       StaticModParams;                                   // 0xE8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct Valhalla_EquipmentModParamsList       AvailableModParams;                                // 0xF8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  Lore;                                              // 0x108(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              AppearanceSlot;                                    // 0x120(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERarity                           Rarity;                                            // 0x128(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4720[0x7];                                     // Fixing Size After Last Property  
	TSoftObjectPtr<class UTexture2D>             InventoryIcon;                                     // 0x130(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             TooltipIcon;                                       // 0x158(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>            PickupMesh;                                        // 0x180(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PreviewScale;                                      // 0x1A8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4722[0x4];                                     // Fixing Size After Last Property  
	TSoftObjectPtr<class UAnimSequence>          PreviewAnimation;                                  // 0x1B0(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         GenerateRarity;                                    // 0x1D8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         GenerateOffensivePower;                            // 0x1D9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         GenerateDefensivePower;                            // 0x1DA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4723[0x5];                                     // Fixing Size After Last Property  
	TMap<enum class ERarity, struct Valhalla_EquipmentModParamsList> StaticRarityModParams;                             // 0x1E0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<enum class ERarity, struct Valhalla_EquipmentModParamsList> AvailableRarityModParams;                          // 0x230(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<enum class ERarity, struct Valhalla_EquipmentModParamsList> SpecialtyRarityModParams;                          // 0x280(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<enum class ERarity, struct Valhalla_EquipmentAssetParams> ChildAssetParams;                                  // 0x2D0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<int32>                                AvailableStackSizes;                               // 0x320(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct Valhalla_EquipmentPassiveEffect> PassiveEffectInfo;                                 // 0x330(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<enum class EPlayerProperty, int32>      PlayerPropertyUnlockRequirements;                  // 0x340(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class EAbilityType                      AbilityType;                                       // 0x390(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4725[0x7];                                     // Fixing Size After Last Property  
	TArray<TSoftObjectPtr<class UDataAsset>>     ChildAssets;                                       // 0x398(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<struct GameplayTags_GameplayTag, struct Valhalla_ValAbilityPropertyModContainer> AbilityPropertyMods;                               // 0x3A8(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                        BuyPrice;                                          // 0x3F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SellPrice;                                         // 0x3FC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOnlyBuyInBundles;                                 // 0x400(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4727[0x7];                                     // Fixing Size After Last Property  
	TArray<struct Valhalla_VendorItemBundle>     AvailableBundles;                                  // 0x408(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        PriceMultipliersPerRarity[0x8];                    // 0x418(0x20)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct Valhalla_CraftingRecipeComponent> CraftingRecipe;                                    // 0x438(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct Valhalla_CraftingRecipeComponent> SalvageRecipe;                                     // 0x448(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UValEquipmentAsset* GetDefaultObj();

	bool OnlyBuyInBundles();
	int32 GetBuyPrice(enum class ERarity InRarity);
	void GetAvailableBundles(TArray<struct Valhalla_VendorItemBundle>* OutAvailableBundles, enum class ERarity InRarity);
};

// 0x8 (0x460 - 0x458)
// Class Valhalla.ValItemAsset
class UValItemAsset : public UValEquipmentAsset
{
public:
	float                                        StackWeight;                                       // 0x458(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_472D[0x4];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValItemAsset* GetDefaultObj();

};

// 0x78 (0x138 - 0xC0)
// Class Valhalla.ValEquipmentModAsset
class UValEquipmentModAsset : public URH_ItemAsset
{
public:
	float                                        AbilityValue;                                      // 0xC0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_472E[0x4];                                     // Fixing Size After Last Property  
	TSubclassOf<class UGameplayAbility>          AbilityClass;                                      // 0xC8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct Valhalla_EquipmentEffect>      AbilityEffects;                                    // 0xD0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<struct GameplayTags_GameplayTag, struct Valhalla_ValAbilityPropertyModContainer> AbilityPropertyMods;                               // 0xE0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	enum class EMagnitudeValueType               ValueType;                                         // 0x130(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4731[0x7];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValEquipmentModAsset* GetDefaultObj();

};

// 0x0 (0x138 - 0x138)
// Class Valhalla.ValItemModAsset
class UValItemModAsset : public UValEquipmentModAsset
{
public:

	static class UClass* StaticClass();
	static class UValItemModAsset* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Valhalla.ValActivityPrerequisite
class UValActivityPrerequisite : public UDataAsset
{
public:

	static class UClass* StaticClass();
	static class UValActivityPrerequisite* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Valhalla.ValActivityRequirement
class UValActivityRequirement : public UDataAsset
{
public:

	static class UClass* StaticClass();
	static class UValActivityRequirement* GetDefaultObj();

};

// 0x120 (0x3B8 - 0x298)
// Class Valhalla.ValAttributeActorBase
class AValAttributeActorBase : public AActor
{
public:
	uint8                                        Pad_4754[0x30];                                    // Fixing Size After Last Property  
	FMulticastInlineDelegateProperty_            OnHealthChanged;                                   // 0x2C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnHealthMaxChanged;                                // 0x2D8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnHealthPercentChanged;                            // 0x2E8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAttributesInitialized;                           // 0x2F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDied;                                            // 0x308(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UValAbilitySystemComponent*            AbilitySystemComponent;                            // 0x318(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UValAttributeSet*                      Attributes;                                        // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>           DefaultAttributeEffect;                            // 0x328(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UValGameplayAbility>> DefaultAbilities;                                  // 0x330(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct CoreUObject_Vector                    DefaultTargetOffset;                               // 0x340(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AValPlayerState*                       MostRecentDamager;                                 // 0x358(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAlwaysDamageable;                                 // 0x360(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDoesNotDie;                                       // 0x361(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAwardOnDeath;                                     // 0x362(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4759[0x5];                                     // Fixing Size After Last Property  
	FMulticastInlineDelegateProperty_            OnDamagedDel;                                      // 0x368(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bCanBeHealedByRepairTool;                          // 0x378(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_475B[0x3];                                     // Fixing Size After Last Property  
	int32                                        R_TeamId;                                          // 0x37C(0x4)(Edit, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<FDelegateProperty_>                   TeamChangedDelegates;                              // 0x380(0x10)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	bool                                         bShowTeamColor;                                    // 0x390(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAttributeActorTeamMode           TeamMode;                                          // 0x391(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_475E[0x2];                                     // Fixing Size After Last Property  
	struct CoreUObject_LinearColor               FriendlyTeamColor;                                 // 0x394(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct CoreUObject_LinearColor               EnemyTeamColor;                                    // 0x3A4(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4760[0x4];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class AValAttributeActorBase* GetDefaultObj();

	void UpdateTeamColor();
	void SetHealth(float Value);
	void OnRep_TeamId(int32 OldTeamId);
	void OnDamaged(const struct Valhalla_DamageData& DamageData);
	bool IsAlive();
	void GiveDefaultAbilities();
	int32 GetTemporaryShields();
	int32 GetTemporaryHealth();
	int32 GetShieldsMax();
	int32 GetShields();
	float GetShieldPercent();
	float GetHealthPercent();
	int32 GetHealthMax();
	int32 GetHealth();
	class UValAttributeSet* GetAttributes();
	void EventTornOff();
	void EventDied();
	void Die();
	bool CanBeHealed();
	bool CanBeDamaged();
	bool AlwaysDamageable();
};

// 0x18 (0x3D0 - 0x3B8)
// Class Valhalla.ValAttributeActor
class AValAttributeActor : public AValAttributeActorBase
{
public:
	class USkeletalMeshComponent*                DefaultMesh;                                       // 0x3B8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCapsuleComponent*                     CapsuleComponent;                                  // 0x3C0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIgnoreCollisionWithTeammates;                     // 0x3C8(0x1)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4772[0x7];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class AValAttributeActor* GetDefaultObj();

	void UpdateCollisionMask();
	class USkeletalMeshComponent* GetMesh();
	class UCapsuleComponent* GetCapsuleComponent();
};

// 0x8 (0x3C0 - 0x3B8)
// Class Valhalla.ValAttributeActor_StaticMesh
class AValAttributeActor_StaticMesh : public AValAttributeActorBase
{
public:
	class UStaticMeshComponent*                  DefaultMesh;                                       // 0x3B8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AValAttributeActor_StaticMesh* GetDefaultObj();

};

// 0x960 (0x990 - 0x30)
// Class Valhalla.ValAttributeSet
class UValAttributeSet : public UAttributeSet
{
public:
	struct GameplayAbilities_GameplayAttributeData Health;                                            // 0x30(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData HealthMax;                                         // 0x40(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData TemporaryHealth;                                   // 0x50(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData Shield;                                            // 0x60(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ShieldMax;                                         // 0x70(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData TemporaryShield;                                   // 0x80(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData HealthRegenAmount;                                 // 0x90(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData HealReductionModifier;                             // 0xA0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ShieldRegenAmount;                                 // 0xB0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData BlockTime;                                         // 0xC0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AttackSpreadReductionModifier;                     // 0xD0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AttackSpread;                                      // 0xE0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AimingSpread;                                      // 0xF0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData MovingSpread;                                      // 0x100(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData CrouchingSpread;                                   // 0x110(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData FallingSpread;                                     // 0x120(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AttackSpreadIncrement;                             // 0x130(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AttackSpreadMax;                                   // 0x140(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AttackSpreadRecovery;                              // 0x150(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AttackDamage;                                      // 0x160(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AttackDamagePerEnergy;                             // 0x170(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData GlobalDamageMultiplier;                            // 0x180(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData GlobalPrimaryDamageMultiplier;                     // 0x190(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData GlobalSecondaryDamageMultiplier;                   // 0x1A0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData GlobalMeleeDamageMultiplier;                       // 0x1B0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData GlobalAOEDamageMultiplier;                         // 0x1C0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData GlobalStaggerMultiplier;                           // 0x1D0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ItemRarityDamageMultiplier;                        // 0x1E0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ItemRarityMitigationMultiplier;                    // 0x1F0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AOEDamageMitigationModifier;                       // 0x200(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData RangedDamageMitigationModifier;                    // 0x210(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData MeleeDamageMitigationModifier;                     // 0x220(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData HeadshotDamageMitigationMultiplier;                // 0x230(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ShieldPenetrationMitigationMultiplier;             // 0x240(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData TrapDamageMitigationMultiplier;                    // 0x250(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData CybridDamageMitigationModifier;                    // 0x260(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData SelfDamageMitigationModifier;                      // 0x270(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AttackRate;                                        // 0x280(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData PrefireTime;                                       // 0x290(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData TimeBetweenBursts;                                 // 0x2A0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ReloadSpeed;                                       // 0x2B0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ReloadMinimum;                                     // 0x2C0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData TimeUntilPassiveReload;                            // 0x2D0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ADSTime;                                           // 0x2E0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ADSTimeMultiplier;                                 // 0x2F0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ReloadTimeMultiplier;                              // 0x300(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData DrawSpeedMultiplier;                               // 0x310(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData HolsterSpeedMultiplier;                            // 0x320(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData BurstShots;                                        // 0x330(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ShotsPerFire;                                      // 0x340(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ThrownSpeedMultiplier;                             // 0x350(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ShieldPenetration;                                 // 0x360(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData MovementSpeed;                                     // 0x370(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData BackwardMovementSpeedReductionMultiplier;          // 0x380(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData HitDebuffGroundSpeedMultiplier;                    // 0x390(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData CharacterMass;                                     // 0x3A0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData SkiInitialImpulse;                                 // 0x3B0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData EnergyRegenRate;                                   // 0x3C0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData EnergyMax;                                         // 0x3D0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AirControl;                                        // 0x3E0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData StimSpeedMultiplier;                               // 0x3F0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData MaxGroundSpeedMultiplier;                          // 0x400(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData SprintSpeedMultiplier;                             // 0x410(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData SlideSpeedMultiplier;                              // 0x420(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData JumpHeightMultiplier;                              // 0x430(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData CharacterMassModifier;                             // 0x440(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ClipAmmoMax;                                       // 0x450(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ReserveAmmoMax;                                    // 0x460(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData StartingReserveAmmo;                               // 0x470(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData StartingClipAmmo;                                  // 0x480(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData PrimaryAmmoPickupMultiplier;                       // 0x490(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData SpecialtyAmmoPickupMultiplier;                     // 0x4A0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AmmoUsedPerShot;                                   // 0x4B0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ScrapPickupMultiplier;                             // 0x4C0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData LootUpgradeChance;                                 // 0x4D0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ProjectileSpeedMultiplier;                         // 0x4E0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData JetpackVerticalBoost;                              // 0x4F0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData JetpackEnergyConsumptionRate;                      // 0x500(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData StealthEnergyConsumptionRate;                      // 0x510(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData HeavyShieldEnergyConsumptionRate;                  // 0x520(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData MediumShieldEnergyConsumptionRate;                 // 0x530(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData JetpackOverburnDuration;                           // 0x540(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AimingMaxSpeedMultiplier;                          // 0x550(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData HeadshotDamageModifier;                            // 0x560(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData DirectHitDamageModifier;                           // 0x570(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData CybridDamageModifier;                              // 0x580(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData BackstabDamageModifier;                            // 0x590(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ShieldBroke;                                       // 0x5A0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData FlinchPitchIntensity;                              // 0x5B0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData FlinchRollIntensity;                               // 0x5C0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ShieldDamageOutputModifier;                        // 0x5D0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData KickbackModifier;                                  // 0x5E0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData FalloffModifier;                                   // 0x5F0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ChargeTimeModifier;                                // 0x600(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AimSwayModifier;                                   // 0x610(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AimFOVModifier;                                    // 0x620(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AOEModifier;                                       // 0x630(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AbilityAOEModifier;                                // 0x640(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData EMPStunModifier;                                   // 0x650(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AbilityDamageMultiplier;                           // 0x660(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData GrenadeDamageMultiplier;                           // 0x670(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData FlagHolderDamageMultiplier;                        // 0x680(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData NonPlayerDamageModifier;                           // 0x690(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData SoundDetectableRange;                              // 0x6A0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData GlobalMitigationModifier;                          // 0x6B0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData OverallDamageModifier;                             // 0x6C0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData HealthPackMax;                                     // 0x6D0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData HealthPackModifier;                                // 0x6E0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ShieldPackModifier;                                // 0x6F0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ShieldPackMax;                                     // 0x700(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData QuickMeleeDamage;                                  // 0x710(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData StaggerImpact;                                     // 0x720(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData StaggerResistance;                                 // 0x730(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData DetectionRadius;                                   // 0x740(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData PendingBoostMax;                                   // 0x750(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData PrimaryFireInputBufferTime;                        // 0x760(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData FabricatorCostMultiplier;                          // 0x770(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData InteractTimeMultiplier;                            // 0x780(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData DoorInteractTimeMultiplier;                        // 0x790(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ItemEquipTimeMultiplier;                           // 0x7A0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData OxygenMaximum;                                     // 0x7B0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData OxygenConsumeRate;                                 // 0x7C0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData OxygenConsumeRateMultiplier;                       // 0x7D0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData MarkedDamageModifier;                              // 0x7E0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData AIAcquireTargetTime;                               // 0x7F0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData PerceptionSightDistance;                           // 0x800(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData PerceptionHearingDistance;                         // 0x810(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData PerceptionPeripheralVisionHalfAngle;               // 0x820(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData PerceptionLoseSightDistance;                       // 0x830(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData CybridBeamDistance;                                // 0x840(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData CybridAlertStateTime;                              // 0x850(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData CybridTetherStateTime;                             // 0x860(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData CybridDriveByDistance;                             // 0x870(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData CybridLatchDuration;                               // 0x880(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData CybridCriticalHealthThresholdPct;                  // 0x890(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData TauntAggroRange;                                   // 0x8A0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData HealthPackUseSpeedModifier;                        // 0x8B0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ShieldPackUseSpeedModifier;                        // 0x8C0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData DamageBoostUseSpeedModifier;                       // 0x8D0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData FlashlightIntensityModifier;                       // 0x8E0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData FlashlightRangeModifier;                           // 0x8F0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData StealthDurationModifier;                           // 0x900(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData PickupRangeMultiplier;                             // 0x910(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData PortalInteractTimeMultiplier;                      // 0x920(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData ChestInteractTimeMultiplier;                       // 0x930(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData RespawnPointInteractTimeMultiplier;                // 0x940(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData UniversalAbilityCooldownModifier;                  // 0x950(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData GlobalCybridDamageModifier;                        // 0x960(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData IncomingKnockbackModifier;                         // 0x970(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct GameplayAbilities_GameplayAttributeData DamageToEnergyConversionRate;                      // 0x980(0x10)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValAttributeSet* GetDefaultObj();

	void OnRep_UniversalAbilityCooldownModifier(struct GameplayAbilities_GameplayAttributeData& OldUniversalAbilityCooldownModifier);
	void OnRep_TrapDamageMitigationMultiplier(struct GameplayAbilities_GameplayAttributeData& OldTrapDamageMitigationMultiplier);
	void OnRep_TimeUntilPassiveReload(struct GameplayAbilities_GameplayAttributeData& OldTimeUntilPassiveReload);
	void OnRep_TimeBetweenBursts(struct GameplayAbilities_GameplayAttributeData& OldTimeBetweenBursts);
	void OnRep_ThrownSpeedMultiplier(struct GameplayAbilities_GameplayAttributeData& OldThrowSpeed);
	void OnRep_TemporaryShield(struct GameplayAbilities_GameplayAttributeData& OldTemporaryShield);
	void OnRep_TemporaryHealth(struct GameplayAbilities_GameplayAttributeData& OldTemporaryHealth);
	void OnRep_TauntAggroRange(struct GameplayAbilities_GameplayAttributeData& OldTauntAggroRange);
	void OnRep_StimSpeedMultiplier(struct GameplayAbilities_GameplayAttributeData& OldStimSpeedMultiplier);
	void OnRep_StealthEnergyConsumptionRate(struct GameplayAbilities_GameplayAttributeData& OldStealthEnergyConsumptionRate);
	void OnRep_StealthDurationModifier(struct GameplayAbilities_GameplayAttributeData& OldStealthDurationModifier);
	void OnRep_StartingReserveAmmo(struct GameplayAbilities_GameplayAttributeData& OldStartingReserveAmmo);
	void OnRep_StartingClipAmmo(struct GameplayAbilities_GameplayAttributeData& OldStartingClipAmmo);
	void OnRep_StaggerResistance(struct GameplayAbilities_GameplayAttributeData& OldStaggerResistance);
	void OnRep_StaggerImpact(struct GameplayAbilities_GameplayAttributeData& OldStaggerImpact);
	void OnRep_SprintSpeedMultiplier(struct GameplayAbilities_GameplayAttributeData& OldSprintSpeedMultiplier);
	void OnRep_SpecialtyAmmoPickupMultiplier(struct GameplayAbilities_GameplayAttributeData& OldSpecialtyAmmoPickupMultiplier);
	void OnRep_SoundDetectableRange(struct GameplayAbilities_GameplayAttributeData& OldSoundDetectableRange);
	void OnRep_SlideSpeedMultiplier(struct GameplayAbilities_GameplayAttributeData& OldSlideSpeedMultiplier);
	void OnRep_SkiInitialImpulse(struct GameplayAbilities_GameplayAttributeData& OldSkiInitialImpulse);
	void OnRep_ShotsPerFire(struct GameplayAbilities_GameplayAttributeData& OldShotsPerFire);
	void OnRep_ShieldRegenAmount(struct GameplayAbilities_GameplayAttributeData& OldShieldRegenAmount);
	void OnRep_ShieldPenetrationMitigationMultiplier(struct GameplayAbilities_GameplayAttributeData& OldShieldPenetrationMitigationMultiplier);
	void OnRep_ShieldPenetration(struct GameplayAbilities_GameplayAttributeData& OldShieldPenetrationMultiplier);
	void OnRep_ShieldPackUseSpeedModifier(struct GameplayAbilities_GameplayAttributeData& OldShieldPackUseSpeedModifier);
	void OnRep_ShieldPackModifier(struct GameplayAbilities_GameplayAttributeData& OldShieldPackModifier);
	void OnRep_ShieldPackMax(struct GameplayAbilities_GameplayAttributeData& OldShieldPackMax);
	void OnRep_ShieldMax(struct GameplayAbilities_GameplayAttributeData& OldShieldMax);
	void OnRep_ShieldDamageOutputModifier(struct GameplayAbilities_GameplayAttributeData& OldShieldDamageOutputModifier);
	void OnRep_ShieldBroke(struct GameplayAbilities_GameplayAttributeData& OldShieldBroke);
	void OnRep_Shield(struct GameplayAbilities_GameplayAttributeData& OldShield);
	void OnRep_SelfDamageMitigationModifier(struct GameplayAbilities_GameplayAttributeData& OldSelfDamageMitigationModifier);
	void OnRep_ScrapPickupMultiplier(struct GameplayAbilities_GameplayAttributeData& OldScrapPickupMultiplier);
	void OnRep_RespawnPointInteractTimeMultiplier(struct GameplayAbilities_GameplayAttributeData& OldRespawnPointInteractTimeMultiplier);
	void OnRep_ReserveAmmoMax(struct GameplayAbilities_GameplayAttributeData& OldReserveAmmoMax);
	void OnRep_ReloadTimeMultiplier(struct GameplayAbilities_GameplayAttributeData& OldReloadTimeMultiplier);
	void OnRep_ReloadSpeed(struct GameplayAbilities_GameplayAttributeData& OldReloadSpeed);
	void OnRep_ReloadMinimum(struct GameplayAbilities_GameplayAttributeData& OldReloadMinimum);
	void OnRep_RangedDamageMitigationModifier(struct GameplayAbilities_GameplayAttributeData& OldRangedDamageMitigationModifier);
	void OnRep_QuickMeleeDamage(struct GameplayAbilities_GameplayAttributeData& OldQuickMeleeDamage);
	void OnRep_ProjectileSpeedMultiplier(struct GameplayAbilities_GameplayAttributeData& OldProjectileSpeedMultiplier);
	void OnRep_PrimaryFireInputBufferTime(struct GameplayAbilities_GameplayAttributeData& OldPrimaryFireInputBufferTime);
	void OnRep_PrimaryAmmoPickupMultiplier(struct GameplayAbilities_GameplayAttributeData& OldPrimaryAmmoPickupMultiplier);
	void OnRep_PrefireTime(struct GameplayAbilities_GameplayAttributeData& OldPrefireTime);
	void OnRep_PortalInteractTimeMultiplier(struct GameplayAbilities_GameplayAttributeData& OldInteractTimeMultiplier);
	void OnRep_PickupRangeMultiplier(struct GameplayAbilities_GameplayAttributeData& OldPickupRangeMultiplier);
	void OnRep_PerceptionSightDistance(struct GameplayAbilities_GameplayAttributeData& OldPerceptionSightDistance);
	void OnRep_PerceptionPeripheralVisionHalfAngle(struct GameplayAbilities_GameplayAttributeData& OldPerceptionPeripheralVisionHalfAngle);
	void OnRep_PerceptionLoseSightDistance(struct GameplayAbilities_GameplayAttributeData& OldPerceptionLoseSightDistance);
	void OnRep_PerceptionHearingDistance(struct GameplayAbilities_GameplayAttributeData& OldPerceptionHearingDistance);
	void OnRep_PendingBoostMax(struct GameplayAbilities_GameplayAttributeData& OldPendingBoostMax);
	void OnRep_OxygenMaximum(struct GameplayAbilities_GameplayAttributeData& OldOxygenMaximum);
	void OnRep_OxygenConsumeRateMultiplier(struct GameplayAbilities_GameplayAttributeData& OldOxygenConsumeRateMultiplier);
	void OnRep_OxygenConsumeRate(struct GameplayAbilities_GameplayAttributeData& OldOxygenConsumeRate);
	void OnRep_OverallDamageModifier(struct GameplayAbilities_GameplayAttributeData& OldOverallDamageModifier);
	void OnRep_NonPlayerDamageModifier(struct GameplayAbilities_GameplayAttributeData& OldNonPlayerDamageModifier);
	void OnRep_MovingSpread(struct GameplayAbilities_GameplayAttributeData& OldMovingSpread);
	void OnRep_MovementSpeed(struct GameplayAbilities_GameplayAttributeData& OldMovementSpeed);
	void OnRep_MeleeDamageMitigationModifier(struct GameplayAbilities_GameplayAttributeData& OldMeleeDamageMitigationModifier);
	void OnRep_MediumShieldEnergyConsumptionRate(struct GameplayAbilities_GameplayAttributeData& OldMediumShieldEnergyConsumptionRate);
	void OnRep_MaxGroundSpeedMultiplier(struct GameplayAbilities_GameplayAttributeData& OldMaxGroundSpeedMultiplier);
	void OnRep_MarkedDamageModifier(struct GameplayAbilities_GameplayAttributeData& OldMarkedDamageModifier);
	void OnRep_LootUpgradeChance(struct GameplayAbilities_GameplayAttributeData& OldLootUpgradeChance);
	void OnRep_KickbackModifier(struct GameplayAbilities_GameplayAttributeData& OldKickbackModifier);
	void OnRep_JumpHeightMultiplier(struct GameplayAbilities_GameplayAttributeData& OldJumpHeightMultiplier);
	void OnRep_JetpackVerticalBoost(struct GameplayAbilities_GameplayAttributeData& OldJetpackVerticalBoost);
	void OnRep_JetpackOverburnDuration(struct GameplayAbilities_GameplayAttributeData& OldJetpackOverburnDuration);
	void OnRep_JetpackEnergyConsumptionRate(struct GameplayAbilities_GameplayAttributeData& OldJetpackEnergyConsumptionRate);
	void OnRep_ItemRarityMitigationMultiplier(struct GameplayAbilities_GameplayAttributeData& OldItemRarityMitigationMultiplier);
	void OnRep_ItemRarityDamageMultiplier(struct GameplayAbilities_GameplayAttributeData& OldItemRarityDamageMultiplier);
	void OnRep_ItemEquipTimeMultiplier(struct GameplayAbilities_GameplayAttributeData& OldItemEquipTimeMultiplier);
	void OnRep_InteractTimeMultiplier(struct GameplayAbilities_GameplayAttributeData& OldInteractTimeMultiplier);
	void OnRep_IncomingKnockbackModifier(struct GameplayAbilities_GameplayAttributeData& OldIncomingKnockbackModifier);
	void OnRep_HolsterSpeedMultiplier(struct GameplayAbilities_GameplayAttributeData& OldHolsterSpeedMultiplier);
	void OnRep_HitDebuffGroundSpeedMultiplier(struct GameplayAbilities_GameplayAttributeData& OldHitDebuffGroundSpeedMultiplier);
	void OnRep_HeavyShieldEnergyConsumptionRate(struct GameplayAbilities_GameplayAttributeData& OldHeavyShieldEnergyConsumptionRate);
	void OnRep_HealthRegenAmount(struct GameplayAbilities_GameplayAttributeData& OldHealthRegenAmount);
	void OnRep_HealthPackUseSpeedModifier(struct GameplayAbilities_GameplayAttributeData& OldHealthPackUseSpeedModifier);
	void OnRep_HealthPackModifier(struct GameplayAbilities_GameplayAttributeData& OldHealthPackModifier);
	void OnRep_HealthPackMax(struct GameplayAbilities_GameplayAttributeData& OldHealthPackMax);
	void OnRep_HealthMax(struct GameplayAbilities_GameplayAttributeData& OldHealthMax);
	void OnRep_Health(struct GameplayAbilities_GameplayAttributeData& OldHealth);
	void OnRep_HealReductionModifier(struct GameplayAbilities_GameplayAttributeData& OldHealReductionModifier);
	void OnRep_HeadshotDamageModifier(struct GameplayAbilities_GameplayAttributeData& OldHeadshotDamageModifier);
	void OnRep_HeadshotDamageMitigationMultiplier(struct GameplayAbilities_GameplayAttributeData& OldHeadshotDamageMitigationMultiplier);
	void OnRep_GrenadeDamageMultiplier(struct GameplayAbilities_GameplayAttributeData& OldGrenadeDamageMultiplier);
	void OnRep_GlobalStaggerMultiplier(struct GameplayAbilities_GameplayAttributeData& OldGlobalStaggerMultiplier);
	void OnRep_GlobalSecondaryDamageMultiplier(struct GameplayAbilities_GameplayAttributeData& OldGlobalSecondaryDamageMultiplier);
	void OnRep_GlobalPrimaryDamageMultiplier(struct GameplayAbilities_GameplayAttributeData& OldGlobalPrimaryDamageMultiplier);
	void OnRep_GlobalMitigationModifier(struct GameplayAbilities_GameplayAttributeData& OldGlobalMitigationModifier);
	void OnRep_GlobalMeleeDamageMultiplier(struct GameplayAbilities_GameplayAttributeData& OldGlobalMeleeDamageMultiplier);
	void OnRep_GlobalDamageMultiplier(struct GameplayAbilities_GameplayAttributeData& OldGlobalDamageMultiplier);
	void OnRep_GlobalCybridDamageModifier(struct GameplayAbilities_GameplayAttributeData& OldGlobalCybridDamageModifier);
	void OnRep_GlobalAOEDamageMultiplier(struct GameplayAbilities_GameplayAttributeData& OldGlobalAOEDamageMultiplier);
	void OnRep_FlinchRollIntensity(struct GameplayAbilities_GameplayAttributeData& OldFlinchRollIntensity);
	void OnRep_FlinchPitchIntensity(struct GameplayAbilities_GameplayAttributeData& OldFlinchPitchIntensity);
	void OnRep_FlashlightRangeModifier(struct GameplayAbilities_GameplayAttributeData& OldFlashlightRangeModifier);
	void OnRep_FlashlightIntensityModifier(struct GameplayAbilities_GameplayAttributeData& OldFlashlightIntensityModifier);
	void OnRep_FlagHolderDamageMultiplier(struct GameplayAbilities_GameplayAttributeData& OldFlagHolderDamageMultiplier);
	void OnRep_FalloffModifier(struct GameplayAbilities_GameplayAttributeData& OldFalloffModifier);
	void OnRep_FallingSpread(struct GameplayAbilities_GameplayAttributeData& OldFallingSpread);
	void OnRep_FabricatorCostMultiplier(struct GameplayAbilities_GameplayAttributeData& OldFabricatorCostMultiplier);
	void OnRep_EnergyRegenRate(struct GameplayAbilities_GameplayAttributeData& OldEnergyRegenRate);
	void OnRep_EnergyMax(struct GameplayAbilities_GameplayAttributeData& OldEnergyMax);
	void OnRep_EmpStunModifier(struct GameplayAbilities_GameplayAttributeData& OldEMPStunModifier);
	void OnRep_DrawSpeedMultiplier(struct GameplayAbilities_GameplayAttributeData& OldDrawSpeedMultiplier);
	void OnRep_DoorInteractTimeMultiplier(struct GameplayAbilities_GameplayAttributeData& OldDoorInteractTimeMultiplier);
	void OnRep_DirectHitDamageModifier(struct GameplayAbilities_GameplayAttributeData& OldDirectHitDamageModifier);
	void OnRep_DetectionRadius(struct GameplayAbilities_GameplayAttributeData& OldDetectionRadius);
	void OnRep_DamageToEnergyConversionRate(struct GameplayAbilities_GameplayAttributeData& OldDamageToEnergyConversionRate);
	void OnRep_DamageBoostUseSpeedModifier(struct GameplayAbilities_GameplayAttributeData& OldDamageBoostUseSpeedModifier);
	void OnRep_CybridTetherStateTime(struct GameplayAbilities_GameplayAttributeData& OldCybridTetherStateTime);
	void OnRep_CybridLatchDuration(struct GameplayAbilities_GameplayAttributeData& OldCybridLatchDuration);
	void OnRep_CybridDriveByDistance(struct GameplayAbilities_GameplayAttributeData& OldCybridDriveByDistance);
	void OnRep_CybridDamageModifier(struct GameplayAbilities_GameplayAttributeData& OldCybridDamageModifier);
	void OnRep_CybridDamageMitigationModifier(struct GameplayAbilities_GameplayAttributeData& OldCybridDamageMitigationModifier);
	void OnRep_CybridCriticalHealthThresholdPct(struct GameplayAbilities_GameplayAttributeData& OldCybridCriticalHealthThresholdPct);
	void OnRep_CybridBeamDistance(struct GameplayAbilities_GameplayAttributeData& OldCybridBeamDistance);
	void OnRep_CybridAlertStateTime(struct GameplayAbilities_GameplayAttributeData& OldCybridAlertStateTime);
	void OnRep_CrouchingSpread(struct GameplayAbilities_GameplayAttributeData& OldCrouchingSpread);
	void OnRep_ClipAmmoMax(struct GameplayAbilities_GameplayAttributeData& OldClipAmmoMax);
	void OnRep_ChestInteractTimeMultiplier(struct GameplayAbilities_GameplayAttributeData& OldChestInteractTimeMultiplier);
	void OnRep_ChargeTimeModifier(struct GameplayAbilities_GameplayAttributeData& OldChargeTimeModifier);
	void OnRep_CharacterMassModifier(struct GameplayAbilities_GameplayAttributeData& OldCharacterMassModifier);
	void OnRep_CharacterMass(struct GameplayAbilities_GameplayAttributeData& OldCharacterMass);
	void OnRep_BurstShots(struct GameplayAbilities_GameplayAttributeData& OldBurstShots);
	void OnRep_BlockTime(struct GameplayAbilities_GameplayAttributeData& OldBlockTime);
	void OnRep_BackwardMovementSpeedReductionMultiplier(struct GameplayAbilities_GameplayAttributeData& OldBackwardMovementSpeedReductionMultiplier);
	void OnRep_BackstabDamageModifier(struct GameplayAbilities_GameplayAttributeData& OldBackstabDamageModifier);
	void OnRep_AttackSpreadReductionModifier(struct GameplayAbilities_GameplayAttributeData& OldAttackSpreadReductionModifier);
	void OnRep_AttackSpreadRecovery(struct GameplayAbilities_GameplayAttributeData& OldAttackSpreadRecovery);
	void OnRep_AttackSpreadMax(struct GameplayAbilities_GameplayAttributeData& OldAttackSpreadMax);
	void OnRep_AttackSpreadIncrement(struct GameplayAbilities_GameplayAttributeData& OldAttackSpreadIncrement);
	void OnRep_AttackSpread(struct GameplayAbilities_GameplayAttributeData& OldAttackSpread);
	void OnRep_AttackRate(struct GameplayAbilities_GameplayAttributeData& OldAttackRate);
	void OnRep_AttackDamagePerEnergy(struct GameplayAbilities_GameplayAttributeData& OldAttackDamagePerEnergy);
	void OnRep_AttackDamage(struct GameplayAbilities_GameplayAttributeData& OldAttackDamage);
	void OnRep_AOEModifier(struct GameplayAbilities_GameplayAttributeData& OldAOEModifier);
	void OnRep_AOEDamageMitigationModifier(struct GameplayAbilities_GameplayAttributeData& OldAOEDamageMitigationModifier);
	void OnRep_AmmoUsedPerShot(struct GameplayAbilities_GameplayAttributeData& OldAmmoUsedPerShot);
	void OnRep_AirControl(struct GameplayAbilities_GameplayAttributeData& OldAirControl);
	void OnRep_AimSwayModifier(struct GameplayAbilities_GameplayAttributeData& OldAimSwayModifier);
	void OnRep_AimingSpread(struct GameplayAbilities_GameplayAttributeData& OldAimingSpread);
	void OnRep_AimingMaxSpeedMultiplier(struct GameplayAbilities_GameplayAttributeData& OldAimingMaxSpeedMultiplier);
	void OnRep_AimFOVModifier(struct GameplayAbilities_GameplayAttributeData& OldAimFOVModifier);
	void OnRep_AIAcquireTargetTime(struct GameplayAbilities_GameplayAttributeData& OldAIAcquireTargetTime);
	void OnRep_ADSTimeMultiplier(struct GameplayAbilities_GameplayAttributeData& OldADSTimeMultiplier);
	void OnRep_ADSTime(struct GameplayAbilities_GameplayAttributeData& OldADSTime);
	void OnRep_AbilityDamageMultiplier(struct GameplayAbilities_GameplayAttributeData& OldAbilityDamageMultiplier);
	void OnRep_AbilityAOEModifier(struct GameplayAbilities_GameplayAttributeData& OldAbilityAOEModifier);
	void GetPlayerType(class AValCharacter* Character, enum class EPlayerType* PlayerType);
	void GetPlayerStatus(class AValCharacter* Character, struct Valhalla_PlayerStatus* PlayerStatus);
	void GetPlayerId(class AValCharacter* Character, int32* PlayerId);
};

// 0x70 (0xA0 - 0x30)
// Class Valhalla.ValAT_CooldownChanged
class UValAT_CooldownChanged : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnCooldownBegin;                                   // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCooldownEnd;                                     // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCooldownModified;                                // 0x50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCooldownActive;                                  // 0x60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*               ASC;                                               // 0x70(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4AE0[0x28];                                    // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAT_CooldownChanged* GetDefaultObj();

	void OnActiveEffectDurationChange(struct GameplayAbilities_ActiveGameplayEffect& Effect);
	class UValAT_CooldownChanged* ListenForCooldownChange(class UAbilitySystemComponent* AbilitySystemComponent, const struct GameplayTags_GameplayTagContainer& CooldownTags, bool UseServerCooldown);
	void EndTask();
};

// 0x48 (0x78 - 0x30)
// Class Valhalla.ValAT_GameplayTagAddedRemoved
class UValAT_GameplayTagAddedRemoved : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            OnTagAdded;                                        // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTagRemoved;                                      // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*               ASC;                                               // 0x50(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4AF4[0x20];                                    // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAT_GameplayTagAddedRemoved* GetDefaultObj();

	class UValAT_GameplayTagAddedRemoved* ListenForGameplayTagAddedOrRemoved(class UAbilitySystemComponent* AbilitySystemComponent, const struct GameplayTags_GameplayTagContainer& Tags);
	void EndTask();
};

// 0xD0 (0x150 - 0x80)
// Class Valhalla.ValAT_PlayMontageForMeshAndWait
class UValAT_PlayMontageForMeshAndWait : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnCompleted;                                       // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBlendOut;                                        // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnInterrupted;                                     // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCancelled;                                       // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            EventReceived;                                     // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                Mesh;                                              // 0xD0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                          MontageToPlay;                                     // 0xD8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct GameplayTags_GameplayTagContainer     EventTags;                                         // 0xE0(0x20)(NativeAccessSpecifierPrivate)
	float                                        Rate;                                              // 0x100(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  StartSection;                                      // 0x104(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        AnimRootMotionTranslationScale;                    // 0x10C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bStopWhenAbilityEnds;                              // 0x110(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bReplicateMontage;                                 // 0x111(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4B02[0x2];                                     // Fixing Size After Last Property  
	float                                        OverrideBlendOutTimeForCancelAbility;              // 0x114(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        OverrideBlendOutTimeForStopWhenEndAbility;         // 0x118(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4B03[0x34];                                    // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAT_PlayMontageForMeshAndWait* GetDefaultObj();

	class UValAT_PlayMontageForMeshAndWait* PlayMontageForMeshAndWait(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class USkeletalMeshComponent* Mesh, class UAnimMontage* MontageToPlay, const struct GameplayTags_GameplayTagContainer& EventTags, float Rate, class FName StartSection, bool bStopWhenAbilityEnds, float AnimRootMotionTranslationScale, bool bReplicateMontage, float OverrideBlendOutTimeForCancelAbility, float OverrideBlendOutTimeForStopWhenEndAbility);
};

// 0x18 (0x98 - 0x80)
// Class Valhalla.ValAT_ServerWaitForClientTargetData
class UValAT_ServerWaitForClientTargetData : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            ValidData;                                         // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_4B11[0x8];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAT_ServerWaitForClientTargetData* GetDefaultObj();

	class UValAT_ServerWaitForClientTargetData* ServerWaitForClientTargetData(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, bool TriggerOnce);
	void OnTargetDataReplicatedCallback(struct GameplayAbilities_GameplayAbilityTargetDataHandle& Data, const struct GameplayTags_GameplayTag& ActivationTag);
};

// 0x20 (0xA0 - 0x80)
// Class Valhalla.ValAT_WaitAiming
class UValAT_WaitAiming : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            OnAimingFinished;                                  // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_4B24[0x10];                                    // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAT_WaitAiming* GetDefaultObj();

	class UValAT_WaitAiming* WaitAiming(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class AValCharacter* Character, bool bWantsToAim);
};

// 0x38 (0xB8 - 0x80)
// Class Valhalla.ValAT_WaitTargetDataUsingActor
class UValAT_WaitTargetDataUsingActor : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            ValidData;                                         // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            Cancelled;                                         // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AGameplayAbilityTargetActor*           TargetActor;                                       // 0xA0(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4B5D[0x10];                                    // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValAT_WaitTargetDataUsingActor* GetDefaultObj();

	class UValAT_WaitTargetDataUsingActor* WaitTargetDataWithReusableActor(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, enum class EGameplayTargetingConfirmation ConfirmationType, class AGameplayAbilityTargetActor* InTargetActor, bool bCreateKeyIfNotValidForMorePredicting);
	void OnTargetDataReplicatedCancelledCallback();
	void OnTargetDataReplicatedCallback(struct GameplayAbilities_GameplayAbilityTargetDataHandle& Data, const struct GameplayTags_GameplayTag& ActivationTag);
	void OnTargetDataReadyCallback(struct GameplayAbilities_GameplayAbilityTargetDataHandle& Data);
	void OnTargetDataCancelledCallback(struct GameplayAbilities_GameplayAbilityTargetDataHandle& Data);
};

// 0x0 (0x28 - 0x28)
// Class Valhalla.ValAudioRoomCollection
class IValAudioRoomCollection : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IValAudioRoomCollection* GetDefaultObj();

	void SetRoomAkEvent(struct CoreUObject_Vector& Location, class UAkAudioEvent* Event);
	void OnAudioRoomRequestUnLoad(bool bDisableOnlyObjects);
	void OnAudioRoomRequestLoad(bool bEnableObjects);
	void GetAkRooms(TArray<class AValAkRoom*>* OutRooms);
	class AValAkRoom* GetAkRoomAtLocation(struct CoreUObject_Vector& Location);
	void AddAkRoom(class AValAkRoom* Room);
	void AddAkObject(class UObject* Object);
};

// 0x0 (0x38 - 0x38)
// Class Valhalla.ValBackendScripting
class UValBackendScripting : public UBSScripting
{
public:

	static class UClass* StaticClass();
	static class UValBackendScripting* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class Valhalla.ValBackendService
class UValBackendService : public UBackendService
{
public:

	static class UClass* StaticClass();
	static class UValBackendService* GetDefaultObj();

	class UValBackendScripting* GetValScriptingInterface();
};

// 0x0 (0x28 - 0x28)
// Class Valhalla.ValBlueprintLibrary
class UValBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UValBlueprintLibrary* GetDefaultObj();

	struct GameplayAbilities_GameplayAbilityTargetDataHandle ValidateMeleeHitList(class AActor* OwningActor, enum class ECollisionChannel TestCollisionChannel, TArray<struct Engine_HitResult>& InputHits, bool bDrawDebug);
	void UpdateContractTaskProgress(class UObject* WorldContextObject, const class FString& ContractId, class FName& TaskId, int32 Progress);
	bool TryComputeBotJumpVector(class UObject* WorldContextObject, struct Valhalla_JumpTrajectoryPredictionParams& JumpParams, struct CoreUObject_Vector* OutJumpVector);
	bool SphereOverlapHitResults(class UObject* WorldContextObject, TArray<struct Engine_HitResult>* OutHitResults, const struct CoreUObject_Vector& Origin, const struct CoreUObject_Rotator& Rotation, const struct Engine_CollisionProfileName& InTraceProfile, class AActor* Instigator, TArray<class AActor*>& ActorsToIgnore, bool bIgnoreFriendly, int32 MaxHitResults, bool bDrawDebug, float SphereRadius, float SphereRange);
	class AValProjectile* SpawnProjectileDeferred(class UClass* Class, struct CoreUObject_Transform& SpawnTransform, class AActor* Owner, struct Valhalla_ValGameplayEffectContainerSpec& EffectSpec, struct CoreUObject_Vector& ProjectileOrigin, float ExplosionRadius, float ProjectileSpeedModify, int32 BotMuzzleSocketIndex, class AController* InstigatorController, int32 PredictionID, class APawn* Instigator);
	class AValPickup_Item* SpawnPickupItemWithData(class UObject* WorldContextObject, TSubclassOf<class AValPickup_Item> PickupClass, struct Valhalla_PendingItem& ItemData, struct CoreUObject_Transform& SpawnTransform, class AActor* Owner, class APawn* Instigator);
	void SortContracts(TArray<struct Valhalla_ContractSortData>& Contracts, TArray<struct Valhalla_ContractSortData>* SortedContracts);
	void SortAbilities(TArray<struct Valhalla_AbilitySortData>& Abilities, TArray<struct Valhalla_AbilitySortData>* SortedAbilities);
	void SetCullDistanceVolumeEnabled(class ACullDistanceVolume* Volume, bool bEnabled);
	void SetComponentNetAddressable(class UActorComponent* Comp);
	void SetComponentIsNetStartup(class UActorComponent* Comp, bool bNewIsNetStartup);
	void SetCollisionMaskForPrimitiveByTeam(class UPrimitiveComponent* Primitive, int32 TeamNum);
	void SetActorIsNetStartup(class AActor* A, bool bNewIsNetStartup, const class FString& RenameSuffix);
	void RemovePlayerContract(class UObject* WorldContextObject, class FName& ContractId);
	void PrintToVerboseLogTemp(class UObject* WorldContextObject, const class FString& InString);
	void PrintStringInShipping(class UObject* WorldContextObject, const class FString& InString, bool bPrintToScreen, bool bPrintToLog, const struct CoreUObject_LinearColor& TextColor, float Duration, bool bPrintOnlyInHighVerbosity);
	void OnStoreContractsLoaded(class UObject* WorldContextObject, TArray<struct Valhalla_ContractData>& ShopContracts, const struct CoreUObject_DateTime& ShopRerollTime);
	void OnShopRerolled(class UObject* WorldContextObject, TArray<struct Valhalla_ContractData>& ShopContracts);
	void OnPlayerContractsLoaded(class UObject* WorldContextObject, TArray<struct Valhalla_ContractData>& Contracts);
	void OnContractPurchased(class UObject* WorldContextObject, struct Valhalla_ContractData& ContractId);
	void MarkQuadrantAsUsed(const struct CoreUObject_IntPoint& CellCount, const struct CoreUObject_IntPoint& QuadrantCellSize, const struct CoreUObject_IntPoint& Quadrant, TArray<struct CoreUObject_IntPoint>& UsedCoordinates);
	void LogTimeOfDay(float TimeOfDay, float RepTimeOfDay);
	void LineOfSightMultiTrace(class UObject* WorldContextObject, const struct CoreUObject_Vector& StartPoint, TArray<struct CoreUObject_Vector>& EndPoints, enum class ECollisionChannel TraceChannel, class AActor* IgnoreActor, bool* OutFoundClearLoS);
	bool JetpackCheck(class UObject* WorldContextObject, enum class ECollisionChannel TraceChannel, class AActor* SourceActor, const struct CoreUObject_Vector& TargetLocation, float SearchDistance, int32 Iterations, float HeightInterval, TArray<class AActor*>& IngoreActors, struct CoreUObject_Vector* OutJetpackTarget);
	bool IsTargetDataValidForSpawn(class AValCharacter* Character, struct GameplayAbilities_GameplayAbilityTargetDataHandle& TargetData, float ValidationDistanceLeeway, bool bDisallowFriendlyHit, uint8 ShotsPerFire, float MinSpread);
	bool IsOfflineMode(class UObject* WorldContextObject);
	bool IsNVIDIA();
	bool IsEditorWorld(class UObject* WorldContextObject);
	bool IsEditorBuild();
	bool IsDemoMode();
	bool IsContractComplete(class UObject* WorldContextObject, const class FString& ContractId);
	bool IsAMD();
	bool IsActorBehindOtherActor(class AActor* Source, class AActor* Target);
	bool HaveContractRequiredCurrency(class UObject* WorldContextObject, struct Valhalla_ContractData& ContractId);
	void GetStoreContracts(class UObject* WorldContextObject, TArray<struct Valhalla_ContractData>* ShopContracts, struct CoreUObject_DateTime* ShopRerollTime);
	void GetPlayerCurrencyValue(class UObject* WorldContextObject, enum class ECurrencyType Type, int32* Value);
	void GetPlayerContracts(class UObject* WorldContextObject, TArray<struct Valhalla_ContractData>* Contracts);
	class UPlayerAttributeConfig* GetPlayerAttributeConfig(class UObject* WorldContextObject);
	class AValPing* GetPingOnActor(class AActor* ActorToCheck);
	void GetPersistentLoadoutSlotTagContainer(class UObject* WorldContextObject, struct GameplayTags_GameplayTagContainer* OutTagContainer);
	float GetNextPatrolLocation(class APawn* PawnActor, class USplineComponent* SplineComponent, float DistanceAlongSpline, struct CoreUObject_Vector* OutNextLocation);
	void GetNetTimeoutStatus(class UObject* WorldContextObject, float* CompareTime, float* TimeoutDelay);
	void GetMetadata(class UAnimationAsset* AnimationAsset, TArray<class UAnimMetaData*>* MetaData);
	TArray<class UMaterialInterface*> GetMaterialsFromNiagaraComponent(class UNiagaraComponent* NiagaraComp);
	void GetLocalStoreContracts(class UObject* WorldContextObject, TArray<struct Valhalla_ContractData>* ShopContracts, struct CoreUObject_DateTime* ShopRerollTime);
	class UValSettingsSubsystem* GetLocalSettingsSubsystem(class UObject* WorldContextObject);
	class UValPlayerInventory* GetLocalPlayerInventory(class UObject* WorldContextObject);
	void GetLocalPlayerContracts(class UObject* WorldContextObject, TArray<struct Valhalla_ContractData>* Contracts);
	bool GetLocalPlayerContract(class UObject* WorldContextObject, const class FString& ContractId, struct Valhalla_ContractData* Contract);
	class AValPlayerController* GetLocalClientValPlayerController(class UObject* WorldContextObject);
	void GetJitteredCellLocations(class UObject* WorldContextObject, bool bVisualize, struct CoreUObject_IntPoint& CachedCellCount, struct CoreUObject_Vector2D& CachedCellSize, struct CoreUObject_Vector& CachedWorldLocation, struct CoreUObject_IntPoint& CachedRandomCell, float MaxJitter, int32 Retries, struct CoreUObject_RandomStream& JitterRandomStream, float MinZ, float POIRadius, float TerrainRadius, TMap<struct CoreUObject_IntPoint, struct CoreUObject_Vector>& CellJitteredLocations, float DrawDebugDuration);
	class UValItemModAsset* GetItemModAssetById(int32 ItemId);
	class UValItemAsset* GetItemAssetById(int32 ItemId);
	class AValInventoryManager* GetInventoryManager(class UObject* WorldContextObject);
	class UValDataTableManager* GetDataTableManager(class UObject* WorldContextObject);
	int32 GetCurrencyValue(class UObject* WorldContextObject, struct Valhalla_ContractData& ShopContract, enum class ECurrencyType Type);
	float GetContractTaskProgressPercent(class UObject* WorldContextObject, const class FString& ContractId, class FName& TaskId);
	int32 GetContractTaskProgress(class UObject* WorldContextObject, const class FString& ContractId, class FName& TaskId);
	float GetContractTaskDataProgressPercent(class UObject* WorldContextObject, struct Valhalla_ContractTaskData& TaskData);
	enum class ERarity GetContractRarity(class UObject* WorldContextObject, struct Valhalla_Contract& Contract);
	float GetContractProgressPercent(class UObject* WorldContextObject, const class FString& ContractId);
	class FText GetContractDisplayName(class UObject* WorldContextObject, struct Valhalla_ContractData& Contract);
	float GetContractDataProgressPercent(class UObject* WorldContextObject, struct Valhalla_ContractData& ContractData);
	class UObject* GetClassDefaultObject(TSubclassOf<class UObject> Class);
	class FName GetCharacterClosest3PSocketName(class AValCharacter* Character, const struct CoreUObject_Vector& Location);
	TArray<class UObject*> GetCachedArray(TArray<class UObject*>& InArray);
	class UValAgentConfig* GetAgentConfigByTag(class UObject* WorldContextObject, const struct GameplayTags_GameplayTag& AgentGameplayTag);
	class AValProjectile* FinishSpawningProjectile(class AValProjectile* Projectile, struct CoreUObject_Transform& Transform);
	bool FindTeleportSpot(class UObject* WorldContextObject, class AActor* TestActor, const struct CoreUObject_Rotator& TestRotation, const struct CoreUObject_Vector& TestLocation, struct CoreUObject_Vector* AdjustedLocation);
	void ExportMontageBonePositionToCurve(class UAnimMontage* AnimMontage, class FName& InBoneName, class UCurveVector* Curve);
	void ExportAnimBonePositionToCurve(class UAnimSequence* AnimSequence, class FName& InBoneName, class UCurveVector* Curve);
	void DebugCookBreak(class FString& bpName);
	enum class EObjectTypeQuery ConvertCollisionChannelToObjectType(enum class ECollisionChannel Channel);
	bool ConeOverlapHitResults(class UObject* WorldContextObject, TArray<struct Engine_HitResult>* OutHitResults, const struct CoreUObject_Vector& Origin, const struct CoreUObject_Rotator& Rotation, float Radius, float Angle, const TArray<enum class EObjectTypeQuery>& ObjectTypes, class AActor* Instigator, TArray<class AActor*>& ActorsToIgnore, bool bIgnoreFriendly, int32 MaxHitResults, enum class ECollisionChannel TestCollisionChannel, bool bDrawDebug);
	bool ConeOverlapActors(class UObject* WorldContextObject, TArray<class AActor*>* OutActors, const struct CoreUObject_Vector& Origin, const struct CoreUObject_Rotator& Rotation, float Radius, float Angle, const TArray<enum class EObjectTypeQuery>& ObjectTypes, class AActor* Instigator, TArray<class AActor*>& ActorsToIgnore, bool bIgnoreFriendly, int32 MaxHitResults, bool bDrawDebug);
	struct CoreUObject_IntPoint ComputeQuadrantFromCellCoord(const struct CoreUObject_IntPoint& Coord, const struct CoreUObject_IntPoint& QuadrantCellSize);
	bool ComputeJitteredCellLocation(class UObject* WorldContextObject, struct CoreUObject_IntPoint& CachedCellCount, struct CoreUObject_Vector2D& CachedCellSize, struct CoreUObject_Vector& POIExtent, TArray<struct CoreUObject_IntPoint>& UsedCoordinates, struct CoreUObject_RandomStream& JitterRandomStream, float MaxJitter, int32 Retries, float MinZ, float POIRadius, float TerrainRadius, bool bVisualize, float DrawDebugDuration, struct CoreUObject_Vector* OutLocation);
	int32 CleanShieldValue(float Shield);
	int32 CleanShieldMaxValue(float ShieldMax);
	int32 CleanHealthValue(float Health);
	int32 CleanHealthMaxValue(float HealthMax);
	bool ClaimShopContract(class UObject* WorldContextObject, struct Valhalla_ContractData& StoreContractID);
	struct CoreUObject_Vector CellToWorldLocation(struct CoreUObject_IntPoint& Cell, struct CoreUObject_Vector2D& CellSize, float TerrainRadius);
	int32 CalculateEntryCost(class UObject* WorldContextObject, int32 Reputation);
	int32 CalculateDisplayEntryCost(class UObject* WorldContextObject, int32 Reputation);
	bool BoxOverlapHitResults(class UObject* WorldContextObject, TArray<struct Engine_HitResult>* OutHitResults, const struct CoreUObject_Vector& Origin, const struct CoreUObject_Rotator& Rotation, const TArray<enum class EObjectTypeQuery>& ObjectTypes, class AActor* Instigator, TArray<class AActor*>& ActorsToIgnore, bool bIgnoreFriendly, int32 MaxHitResults, bool bDrawDebug, const struct CoreUObject_Vector& BoxExtent, const struct CoreUObject_Vector& BoxOffset);
	bool BoxOverlapActors(class UObject* WorldContextObject, TArray<class AActor*>* OutActors, const struct CoreUObject_Vector& Origin, const struct CoreUObject_Rotator& Rotation, const TArray<enum class EObjectTypeQuery>& ObjectTypes, class AActor* Instigator, TArray<class AActor*>& ActorsToIgnore, bool bIgnoreFriendly, int32 MaxHitResults, bool bDrawDebug, const struct CoreUObject_Vector& BoxExtent, const struct CoreUObject_Vector& BoxOffset);
	void ApplyDirectDamage(class AActor* SourceActor, class AActor* TargetActor, struct GameplayAbilities_GameplayEffectSpecHandle& DamageSpec);
};

// 0x140 (0x1E0 - 0xA0)
// Class Valhalla.ValThreatComponent
class UValThreatComponent : public UActorComponent
{
public:
	uint8                                        Pad_4DE0[0x10];                                    // Fixing Size After Last Property  
	struct GameplayTags_GameplayTagContainer     BotIgnoreTags;                                     // 0xB0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class AActor>>            BotIgnoreClasses;                                  // 0xD0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                         bRunThreatSystem;                                  // 0xE0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSetTargetActor;                                   // 0xE1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4DE1[0x2];                                     // Fixing Size After Last Property  
	int32                                        MaxThreatCount;                                    // 0xE4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        UpdateThreatsTimer;                                // 0xE8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ForgetThreatTimer;                                 // 0xEC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LostSightDelayTimer;                               // 0xF0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StartOfMatchDelayTiming;                           // 0xF4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCheckForThreatReachability;                       // 0xF8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4DE2[0x3];                                     // Fixing Size After Last Property  
	float                                        NonReachabilityThreatPenalty;                      // 0xFC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCheckForInCover;                                  // 0x100(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4DE3[0x3];                                     // Fixing Size After Last Property  
	float                                        InCoverThreatPenalty;                              // 0x104(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        InCoverTimeout;                                    // 0x108(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4DE4[0x4];                                     // Fixing Size After Last Property  
	TArray<struct Valhalla_Threat>               ThreatList;                                        // 0x110(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                         bLockTarget;                                       // 0x120(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4DE5[0x3];                                     // Fixing Size After Last Property  
	float                                        TetherRadius;                                      // 0x124(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4DE6[0x68];                                    // Fixing Size After Last Property  
	FMulticastInlineDelegateProperty_            OnTargetActorUpdated;                              // 0x190(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnThreatSeenUpdated;                               // 0x1A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnThreatHeardUpdated;                              // 0x1B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnThreatDamagedUpdated;                            // 0x1C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnThreatCoverTagsChanged;                          // 0x1D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValThreatComponent* GetDefaultObj();

	void UpdateThreats();
	void UpdateThreatLevel(int32 ThreatIndex);
	void UpdateBlackboard(struct Valhalla_Threat* ThreatStruct);
	void ToggleSetTargetActor();
	void StopThreatSystem(bool bClearBlackboard);
	void StartThreatSystem();
	void SortThreatList();
	bool ShouldIgnoreThreat(class AActor* ThreatActor);
	void SetTetherRadius(float NewTetherRadius);
	void RemoveThreat(class AActor* ThreatActor);
	void RemoveCurrentInCoverTarget();
	void PrioritizeThreat(class AActor* ThreatActor);
	void OnThreatListEmptied();
	void OnOwnerAttackingUpdated(const struct GameplayTags_GameplayTag& InTag, int32 NewCount);
	void OnMatchStateChanged();
	void OnCurrentThreatTagChanged(const struct GameplayTags_GameplayTag& InTag, int32 NewCount);
	void OnCoverTagChanged(const struct GameplayTags_GameplayTag& Tag, int32 NewCount);
	void OnCharacterThreatDied(float TimeToRespawn, class AValCharacter* Pawn);
	void OnAttributeActorThreatDied(class AValAttributeActorBase* Pawn);
	bool IsThreatValid(struct Valhalla_Threat& ThreatStruct);
	bool IsThreatSeen(class AActor* ThreatActor);
	bool IsThreatReachable(class AActor* ThreatActor);
	bool IsThreatInCover(class AActor* ThreatActor);
	bool IsThreatHeard(class AActor* ThreatActor);
	bool HasThreat(class AActor* ThreatActor);
	bool HasEnemyThreat();
	bool HasAnyThreats();
	int32 GetThreatIndex(class AActor* ThreatActor);
	int32 GetThreatCount();
	int32 GetOrAddThreat(class AActor* ThreatActor);
	class AActor* GetCurrentThreat();
	void ForceUpdateThreats();
	void DebugDump();
	void ClearGameplayTagEvents(class AActor* PreviousTarget);
	void BindGameplayTagEvents(class AActor* NewTarget);
	void AddOrUpdateThreatSeen(class AActor* ThreatActor, bool bIsSeen);
	void AddOrUpdateThreatHeard(class AActor* ThreatActor, bool bIsHeard);
	void AddOrUpdateThreatFlashlighting(class AActor* ThreatActor);
	void AddOrUpdateThreatDamage(class AActor* ThreatActor, float DamageAmount);
};

// 0x30 (0x210 - 0x1E0)
// Class Valhalla.ValBossThreatComponent
class UValBossThreatComponent : public UValThreatComponent
{
public:
	bool                                         bOnlyTargetPlayers;                                // 0x1E0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4DEA[0x7];                                     // Fixing Size After Last Property  
	struct GameplayTags_GameplayTagContainer     EnemyUntargetableTags;                             // 0x1E8(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                        UntargetableThreatCount;                           // 0x208(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4DEB[0x4];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValBossThreatComponent* GetDefaultObj();

	bool HasOnlyUntargetableEnemies();
	void AddThreat(class AActor* ThreatActor);
};

// 0x2D0 (0x300 - 0x30)
// Class Valhalla.ValBotData
class UValBotData : public UPrimaryDataAsset
{
public:
	class FText                                  BotDisplayName;                                    // 0x30(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct GameplayTags_GameplayTag              BotType;                                           // 0x48(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRestrictSpawnType;                                // 0x50(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4DEF[0x7];                                     // Fixing Size After Last Property  
	TSoftClassPtr<class AAIController>           BotController;                                     // 0x58(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class APawn>                   BotPawnClass;                                      // 0x80(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>           DefaultAttributeEffect;                            // 0xA8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        QueueBotDataId;                                    // 0xB0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUsePersonality;                                   // 0xB4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4DF0[0x3];                                     // Fixing Size After Last Property  
	TSoftObjectPtr<class UValBotPersonality>     Personality;                                       // 0xB8(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UBehaviorTree>          BotNonCombatBehaviorTree;                          // 0xE0(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UBehaviorTree>          BotCombatBehaviorTree;                             // 0x108(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanSee;                                           // 0x130(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanHear;                                          // 0x131(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4DF2[0x6];                                     // Fixing Size After Last Property  
	struct GameplayTags_GameplayTagContainer     Flags;                                             // 0x138(0x20)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                        DropLootChance;                                    // 0x158(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BaseAccuracy;                                      // 0x15C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BaseReactionTime;                                  // 0x160(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IdealCombatRangeMin;                               // 0x164(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        IdealCombatRangeMax;                               // 0x168(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCanSnapToTarget;                                  // 0x16C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4DF4[0x3];                                     // Fixing Size After Last Property  
	float                                        TimeBeforeSnapToTarget;                            // 0x170(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENavLinkAgentType                 NavLinkAgentType;                                  // 0x174(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4DF5[0x3];                                     // Fixing Size After Last Property  
	class USkeletalMesh*                         Mesh;                                              // 0x178(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                    MaterialOverride;                                  // 0x180(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UAnimInstance>           CustomABP;                                         // 0x188(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct CoreUObject_Vector                    CustomMeshScale;                                   // 0x1B0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UValLoadoutAsset>       LoadoutAsset;                                      // 0x1C8(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct GameplayTags_GameplayTag, bool>  PredictiveAimingOverride;                          // 0x1F0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<struct GameplayTags_GameplayTag, TSubclassOf<class UGameplayEffect>> SpreadOverride;                                    // 0x240(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                         bAmbushes;                                         // 0x290(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4DF8[0x3];                                     // Fixing Size After Last Property  
	float                                        AmbushPerceptionRange;                             // 0x294(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AmbushMinWaitTime;                                 // 0x298(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AmbushMaxWaitTime;                                 // 0x29C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StalkMinTimeInState;                               // 0x2A0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StalkMaxTimeInState;                               // 0x2A4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StalkTimeInStateVariance;                          // 0x2A8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FleeMinTimeInState;                                // 0x2AC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FleeMaxTimeInState;                                // 0x2B0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FleeTimeInStateVariance;                           // 0x2B4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSpawnAlarmWaveOnDeath;                            // 0x2B8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4DF9[0x7];                                     // Fixing Size After Last Property  
	TSoftObjectPtr<class UEnvQuery>              LocationQueryTemplate;                             // 0x2C0(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct Valhalla_ValBotWaveSet                AlarmWaveSetOverride;                              // 0x2E8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                        RespawnTimerOverride;                              // 0x2F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4DFA[0x4];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValBotData* GetDefaultObj();

	bool ShouldUsePredictiveAimingForSlot(const struct GameplayTags_GameplayTag& EquipSlot, bool* bFoundDefinition);
	bool HasFlag(const struct GameplayTags_GameplayTag& TagToCheck, bool bExactMatch);
	TSubclassOf<class UGameplayEffect> GetSpreadOverrideForSlot(const struct GameplayTags_GameplayTag& EquipSlot);
	float GetIdealCombatRangeMin();
	float GetIdealCombatRangeMax();
	struct GameplayTags_GameplayTagContainer GetFlags();
};

// 0x78 (0xA0 - 0x28)
// Class Valhalla.ValBotTierData
class UValBotTierData : public UObject
{
public:
	TMap<struct GameplayTags_GameplayTag, TSoftObjectPtr<class UValBotData>> BotConfiguration;                                  // 0x28(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UGameplayEffect>> AttributeEffectModifier;                           // 0x78(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                        ApplyAffixPercentChance;                           // 0x88(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4E06[0x4];                                     // Fixing Size After Last Property  
	TArray<TSoftClassPtr<class UGameplayEffect>> Affixes;                                           // 0x90(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValBotTierData* GetDefaultObj();

	TSoftClassPtr<class UGameplayEffect> SelectAffix(struct CoreUObject_RandomStream* Stream);
	TSoftObjectPtr<class UValBotData> GetBotClassData(struct GameplayTags_GameplayTag& Type);
};

// 0x78 (0xA8 - 0x30)
// Class Valhalla.ValBotPersonality
class UValBotPersonality : public UPrimaryDataAsset
{
public:
	struct GameplayTags_GameplayTagContainer     PersonalityFlags;                                  // 0x30(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<struct GameplayTags_GameplayTag, TSoftObjectPtr<class UBehaviorTree>> BehaviorTrees;                                     // 0x50(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                        IdealCombatRangeMinOverride;                       // 0xA0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IdealCombatRangeMaxOverride;                       // 0xA4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UValBotPersonality* GetDefaultObj();

};

// 0x38 (0x2D0 - 0x298)
// Class Valhalla.ValBotSpawner
class AValBotSpawner : public AActor
{
public:
	float                                        MinSpawnDelayTimingInSec;                          // 0x298(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxSpawnDelayTimingInSec;                          // 0x29C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct CoreUObject_Transform>         SpawnPointTransforms;                              // 0x2A0(0x10)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UBotInitData*>                  BotList;                                           // 0x2B0(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            OnBotSpawnedDel;                                   // 0x2C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AValBotSpawner* GetDefaultObj();

	bool Spawn(class UValBotWaveConfig* InBotSpawnData, class AActor* TriggerActor, class AValBotSpawnVolume* OwningVolume);
	void OnBotSpawned(class UBotInitData* BotInitData);
	void HandleSpawnUX(class UBotInitData* BotInitData);
	void HandleActivatedUX();
	void ClientHandleActivatedUX();
};

// 0x0 (0x28 - 0x28)
// Class Valhalla.ValBotSpawnerBlueprintLibrary
class UValBotSpawnerBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UValBotSpawnerBlueprintLibrary* GetDefaultObj();

	bool SpawnAtNearestBotSpawnerWithChance(class UObject* WorldContextObject, const struct CoreUObject_Vector& Location, float Chance, class UValBotWaveConfig* Config, class AActor* TriggerActor, class AValUtopiaConstructor* Constructor, class AValBotSpawnVolume* OwningVolume);
	bool SpawnAtNearestBotSpawner(class UObject* WorldContextObject, const struct CoreUObject_Vector& Location, class UValBotWaveConfig* Config, class AActor* TriggerActor, class AValUtopiaConstructor* Constructor, class AValBotSpawnVolume* OwningVolume);
	class AValBotSpawner* GetNearestBotSpawner(class UObject* WorldContextObject, const struct CoreUObject_Vector& Location, class AValUtopiaConstructor* Constructor, float MaxDistance);
};

// 0x1F8 (0x220 - 0x28)
// Class Valhalla.BotInitData
class UBotInitData : public UObject
{
public:
	class UValBotData*                           BotData;                                           // 0x28(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct CoreUObject_Vector                    Location;                                          // 0x30(0x18)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct CoreUObject_Rotator                   Rotation;                                          // 0x48(0x18)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class AValBotSpawnVolume*                    SpawnVolume;                                       // 0x60(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                TriggerActor;                                      // 0x68(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AValCharacter>          ActiveActor;                                       // 0x70(0x8)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHasSpawned;                                       // 0x78(0x1)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHasDied;                                          // 0x79(0x1)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bFinishedLoading;                                  // 0x7A(0x1)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSpawnAfterLoad;                                   // 0x7B(0x1)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4E34[0x4];                                     // Fixing Size After Last Property  
	class UClass*                                BotController;                                     // 0x80(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                BotPawnClass;                                      // 0x88(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBehaviorTree*                         BotNonCombatBehaviorTree;                          // 0x90(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBehaviorTree*                         BotCombatBehaviorTree;                             // 0x98(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                CustomABP;                                         // 0xA0(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UGameplayEffect>         AttributeModPtr;                                   // 0xA8(0x28)(Edit, Transient, EditConst, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                AttributeMod;                                      // 0xD0(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UGameplayEffect>         RandomAffixPtr;                                    // 0xD8(0x28)(Edit, Transient, EditConst, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                RandomAffix;                                       // 0x100(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UValLoadoutAsset*                      LoadoutAsset;                                      // 0x108(0x8)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4E37[0x110];                                   // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UBotInitData* GetDefaultObj();

	void SpawnBot();
	void OnPrecacheComplete();
	void OnBotDied(float TimeToRespawn, class AValCharacter* Pawn);
	bool IsPendingSpawn();
	bool IsDespawned();
	bool IsAlive();
	bool HasSpawned();
	class AValCharacter* GetCharacter();
	void FinishPrecache();
};

// 0x1E8 (0x480 - 0x298)
// Class Valhalla.ValBotSpawnVolume
class AValBotSpawnVolume : public AActor
{
public:
	class UShapeComponent*                       BotSpawnComponent;                                 // 0x298(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4E49[0x18];                                    // Fixing Size After Last Property  
	enum class EComponentShape                   BotSpawnShape;                                     // 0x2B8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4E4B[0x3];                                     // Fixing Size After Last Property  
	int32                                        NumPlayersInVolume;                                // 0x2BC(0x4)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UValBotTierData*                       BotSpawnData;                                      // 0x2C0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4E4C[0xF0];                                    // Fixing Size After Last Property  
	FMulticastInlineDelegateProperty_            OnBotSpawnVolumeEntered;                           // 0x3B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBotSpawnVolumeThreatEntered;                     // 0x3C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBotSpawnVolumeThreatExited;                      // 0x3D8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBotsTriggered;                                   // 0x3E8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBotsRecalled;                                    // 0x3F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBotsSpawned;                                     // 0x408(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBotKilled;                                       // 0x418(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnAlarmTriggered;                                  // 0x428(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_4E4D[0x8];                                     // Fixing Size After Last Property  
	int32                                        MaxToSpawnAtATime;                                 // 0x440(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        InvalidSpawnPointDistance;                         // 0x444(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UBotInitData*>                  BotsToInitialize;                                  // 0x448(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                         bPOIBotsSpawned;                                   // 0x458(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPendingSpawn;                                     // 0x459(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHasAlarmBeenTriggered;                            // 0x45A(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4E4E[0x5];                                     // Fixing Size After Last Property  
	class AValUtopiaConstructor*                 OwningConstructor;                                 // 0x460(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxPatrolPoints;                                   // 0x468(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinPatrolPointDistance;                            // 0x46C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct CoreUObject_Vector>            PatrolPoints;                                      // 0x470(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AValBotSpawnVolume* GetDefaultObj();

	void TriggerAlarm();
	void SpawnStreamedBots();
	void SetPatrolForOverlappingBot(class AValCharacter* Bot);
	void SetOwningConstructor(class AValUtopiaConstructor* InConstructor);
	void OnShapeComponentOverlapped(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct Engine_HitResult& SweepResult);
	void OnShapeComponentEndOverlapped(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnBotDataAvailable();
	bool HaveBotsSpawned();
	void GetSpawnedBots(TArray<class AValCharacter*>* OutCharacters);
	void GetSafeSpawns(TMap<struct GameplayTags_GameplayTag, struct Valhalla_BotTransformData>& OutMap);
	TArray<struct CoreUObject_Vector> GetPatrolPoints();
	class AValUtopiaConstructor* GetOwningConstructor();
	class UValBotTierData* GetBotSpawnData();
	void FinishDestroyBot(class AValCharacter* Bot);
};

// 0x0 (0x80 - 0x80)
// Class Valhalla.ValBTComposite_ParallelSequence
class UValBTComposite_ParallelSequence : public UBTCompositeNode
{
public:

	static class UClass* StaticClass();
	static class UValBTComposite_ParallelSequence* GetDefaultObj();

};

// 0x10 (0x90 - 0x80)
// Class Valhalla.ValBTComposite_Random
class UValBTComposite_Random : public UBTCompositeNode
{
public:
	TArray<float>                                Probabilities;                                     // 0x80(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UValBTComposite_Random* GetDefaultObj();

};

// 0x0 (0x90 - 0x90)
// Class Valhalla.ValBTComposite_Random_Selector
class UValBTComposite_Random_Selector : public UValBTComposite_Random
{
public:

	static class UClass* StaticClass();
	static class UValBTComposite_Random_Selector* GetDefaultObj();

};

// 0x0 (0x90 - 0x90)
// Class Valhalla.ValBTComposite_Random_Sequence
class UValBTComposite_Random_Sequence : public UValBTComposite_Random
{
public:

	static class UClass* StaticClass();
	static class UValBTComposite_Random_Sequence* GetDefaultObj();

};

// 0x60 (0xC8 - 0x68)
// Class Valhalla.ValBTDecorator_ActorHasTags
class UValBTDecorator_ActorHasTags : public UBTDecorator
{
public:
	struct AIModule_BlackboardKeySelector        ActorToCheck;                                      // 0x68(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	enum class EGameplayContainerMatchType       TagsToMatch;                                       // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4E66[0x7];                                     // Fixing Size After Last Property  
	struct GameplayTags_GameplayTagContainer     GameplayTags;                                      // 0x98(0x20)(Edit, Protected, NativeAccessSpecifierProtected)
	class FString                                CachedDescription;                                 // 0xB8(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UValBTDecorator_ActorHasTags* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Valhalla.ValBTDecorator_IsInShip
class UValBTDecorator_IsInShip : public UBTDecorator
{
public:
	struct AIModule_BlackboardKeySelector        DirectiveKey;                                      // 0x68(0x28)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UValBTDecorator_IsInShip* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Valhalla.ValBTFunctionLibrary
class UValBTFunctionLibrary : public UBTFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UValBTFunctionLibrary* GetDefaultObj();

	struct CoreUObject_Vector GetLocationFromBlackboardValue(class UBTNode* NodeOwner, struct AIModule_BlackboardKeySelector& Key);
};

// 0x8 (0x78 - 0x70)
// Class Valhalla.ValBTService_ApplyTempEffect
class UValBTService_ApplyTempEffect : public UBTService
{
public:
	TSubclassOf<class UGameplayEffect>           EffectToApply;                                     // 0x70(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UValBTService_ApplyTempEffect* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Valhalla.ValBTTask_AlwaysReturn
class UValBTTask_AlwaysReturn : public UBTTaskNode
{
public:
	enum class EBTNodeResult                     AlwaysReturn;                                      // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4E6E[0x7];                                     // Fixing Size Of Struct 

	static class UClass* StaticClass();
	static class UValBTTask_AlwaysReturn* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Valhalla.ValBTTask_ApplyEffect
class UValBTTask_ApplyEffect : public UBTTaskNode
{
public:
	TSubclassOf<class UGameplayEffect>           EffectToApply;                                     // 0x70(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UValBTTask_ApplyEffect* GetDefaultObj();

};

// 0x0 (0x98 - 0x98)
// Class Valhalla.ValBTTask_ClearBlackboardKey
