#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x121 (0x699 - 0x578)
// WidgetBlueprintGeneratedClass WBP_SettingsMenu.WBP_SettingsMenu_C
class UWBP_SettingsMenu_C : public URHSettingsMenu
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x578(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      MobileLayout;                                      // 0x580(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_KeyCallout_C*                     LeftTabCallout;                                    // 0x588(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          MobileNavContainer;                                // 0x590(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        NavTabBox;                                         // 0x598(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              PreviewContainer;                                  // 0x5A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyCallout_C*                     RightTabCallout;                                   // 0x5A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             ScaleBox_1;                                        // 0x5B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            SettingsDescription;                               // 0x5B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SettingsInputBlocker_C*            SettingsInputBlocker;                              // 0x5C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              SettingsNavWrapper;                                // 0x5C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       SettingsPageWidgetSwitcher;                        // 0x5D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            SettingsTitle;                                     // 0x5D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              SubscreenheaderMinusSizeBox;                       // 0x5E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_panel_bevel_C*                    WBP_panel_bevel;                                   // 0x5E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_subscreen_nav_tab_C*>      WBP_subscreen_nav_tabs;                            // 0x5F0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class URHWidget*>                     TopWidgets;                                        // 0x600(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class URHWidget*>                     BottomWidgets;                                     // 0x610(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	enum class ERHLoginState                     Login_State;                                       // 0x620(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_43AB[0x3];                                     // Fixing Size After Last Property  
	class FName                                  TAB_LEFT_NAME;                                     // 0x624(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  TAB_RIGHT_NAME;                                    // 0x62C(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  APPLY_NAME;                                        // 0x634(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  RESTORE_NAME;                                      // 0x63C(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_43AD[0x4];                                     // Fixing Size After Last Property  
	TArray<class URHSettingsPage*>               WBP_SubScreens;                                    // 0x648(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                  ESC_NAME;                                          // 0x658(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                               BackSettingsMenuSFX;                               // 0x660(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                               RevertSettingsMenuSFX;                             // 0x668(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                               ApplySettingsMenuSFX;                              // 0x670(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class URHWidget*>                     PreviewWidgets;                                    // 0x678(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                         bContainsAnyKeyBindings;                           // 0x688(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_43B1[0x7];                                     // Fixing Size After Last Property  
	class UPanelWidget*                          MyNavTabContainer;                                 // 0x690(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         CachedShown;                                       // 0x698(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UWBP_SettingsMenu_C* GetDefaultObj();

	void OnMenuConfigSet(const TArray<class URHSettingsPage*>& CachedSettingsPages, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class URHSettingsPage*>& CallFunc_GetSettingsPages_ReturnValue, class URHSettingsPage* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void Add_Settings_Nav_Tab(class UWBP_subscreen_nav_tab_C* InNavTab, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue, int32 CallFunc_GetChildrenCount_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, double CallFunc_SelectFloat_ReturnValue, const struct SlateCore_Margin& K2Node_MakeStruct_Margin, float K2Node_MakeStruct_Left_ImplicitCast);
	void ResetPreviewWidgets(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class URHWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue);
	void HandlePreviewHovered(class URHWidget* PreviewWidget, bool CallFunc_Array_Contains_ReturnValue);
	void AddPreviewToSettingMenu(class URHWidget* PreviewWidget, int32 CallFunc_Array_AddUnique_ReturnValue, class UOverlaySlot* CallFunc_AddChildToOverlay_ReturnValue);
	void SetupPreviewWidgets(int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, TArray<class URHSettingsPage*>& CallFunc_GetSettingsPages_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class URHSettingsPage* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, TArray<class URHSettingsContainer*>& CallFunc_GetSettingsContainersForPage_SettingsContainers, TArray<class URHWidget*>& CallFunc_GetSettingsContainersForPage_SettingsContainersAsPUMG, class URHSettingsContainer* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, class UWBP_SettingsContainer_C* K2Node_DynamicCast_AsWBP_Settings_Container, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue_1, class URHWidget* CallFunc_GetPreviewWidget_PreviewWidget, bool CallFunc_IsValid_ReturnValue);
	void On_Tab_Clicked(class URHNavTabWidget* Tab_Selected, int32 CallFunc_GetActiveWidgetIndex_ReturnValue, class UWidget* CallFunc_GetChildAt_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue);
	void ResetPageState(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class URHSettingsPage* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class UWBP_SettingsPage_C* K2Node_DynamicCast_AsWBP_Settings_Page, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsVisible_ReturnValue);
	void GetContainerWidgetForPUMGWidgetOnPage(class URHSettingsPage* Page, class URHWidget* PUMG_Widget, class URHSettingsContainer** KSSettingsContainerWidget, TArray<class URHSettingsContainer*>& CallFunc_GetSettingsContainersForPage_SettingsContainers, TArray<class URHWidget*>& CallFunc_GetSettingsContainersForPage_SettingsContainersAsPUMG, int32 CallFunc_Array_Find_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class URHSettingsContainer* CallFunc_Array_Get_Item);
	void On_Widget_Mouse_Entered(class URHWidget* PUMG_Widget, bool bEntered, class URHSettingsPage* CallFunc_Get_Current_Page_KSSettingsPage, class URHSettingsContainer* CallFunc_GetContainerWidgetForPUMGWidgetOnPage_KSSettingsContainerWidget, class FText CallFunc_GetWidgetContainerTitle_ReturnValue, class URHSettingsPreview* CallFunc_GetWidgetContainerPreview_ReturnValue, class FText CallFunc_GetWidgetContainerDescription_ReturnValue);
	void Setup_Hover_Handling(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_2, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 Temp_int_Loop_Counter_Variable_2, TArray<class URHSettingsPage*>& CallFunc_GetSettingsPages_ReturnValue, class URHSettingsPage* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, TArray<class URHSettingsContainer*>& CallFunc_GetSettingsContainersForPage_SettingsContainers, TArray<class URHWidget*>& CallFunc_GetSettingsContainersForPage_SettingsContainersAsPUMG, bool CallFunc_Less_IntInt_ReturnValue, class URHSettingsContainer* CallFunc_Array_Get_Item_1, TArray<class URHSettingsWidget*>& CallFunc_GetSettingsWidgets_ReturnValue, class URHSettingsWidget* CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1);
	void GetSettingsContainersForPage(class URHSettingsPage* SettingsPage, TArray<class URHSettingsContainer*>* SettingsContainers, TArray<class URHWidget*>* SettingsContainersAsPUMG, const TArray<class URHSettingsContainer*>& KSSettingsContainers, TArray<class URHSettingsSection*>& CallFunc_GetSettingsSections_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, class URHSettingsSection* CallFunc_Array_Get_Item, TArray<class URHSettingsGroup*>& CallFunc_GetSettingsGroups_ReturnValue, class URHSettingsGroup* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, TArray<class URHSettingsContainer*>& CallFunc_GetSettingsContainers_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1);
	void GetSettingsWidgetForPUMGWidgetOnPage(class URHSettingsPage* Page, class URHWidget* PUMG_Widget, class URHSettingsWidget** KSSettingsWidget, TArray<class URHSettingsWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgets, TArray<class URHWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgetsAsRH, int32 CallFunc_Array_Find_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class URHSettingsWidget* CallFunc_Array_Get_Item);
	void Get_Current_Page(class URHSettingsPage** KSSettingsPage, int32 CallFunc_GetActiveWidgetIndex_ReturnValue, TArray<class URHSettingsPage*>& CallFunc_GetSettingsPages_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class URHSettingsPage* CallFunc_Array_Get_Item);
	void On_Input_State_Changed(enum class ERH_INPUT_STATE Input_State, enum class ERH_INPUT_STATE Temp_byte_Variable, bool K2Node_SwitchEnum_CmpSuccess, enum class ESlateVisibility Temp_byte_Variable_1, enum class ESlateVisibility Temp_byte_Variable_2, enum class ESlateVisibility Temp_byte_Variable_3, enum class ESlateVisibility Temp_byte_Variable_4, enum class ESlateVisibility K2Node_Select_Default, int32 CallFunc_GetCurrentFocusGroup_OutFocusGroup, bool CallFunc_GetCurrentFocusGroup_ReturnValue, bool CallFunc_IsVisible_ReturnValue, int32 CallFunc_GetActiveWidgetIndex_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void Setup_Input_State_Handling(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, enum class ERH_INPUT_STATE CallFunc_GetCurrentInputState_ReturnValue);
	void Setup_Login_Handling(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class URHLoginDataFactory* CallFunc_GetLoginDataFactory_ReturnValue, enum class ERHLoginState CallFunc_GetCurrentLoginState_ReturnValue);
	void Handle_Login_State(enum class ERHLoginState Login_State, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, bool K2Node_SwitchEnum_CmpSuccess, class URHLoginDataFactory* CallFunc_GetLoginDataFactory_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_IsLoggedIn_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, TArray<class URHSettingsPage*>& CallFunc_GetSettingsPages_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class URHSettingsPage* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, TArray<class URHSettingsContainer*>& CallFunc_GetSettingsContainersForPage_SettingsContainers, TArray<class URHWidget*>& CallFunc_GetSettingsContainersForPage_SettingsContainersAsPUMG, class URHSettingsContainer* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue);
	void Tab_Right(int32 Temp_int_Variable, int32 CallFunc_GetActiveWidgetIndex_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue);
	void Tab_Left(int32 Temp_int_Variable, int32 CallFunc_GetActiveWidgetIndex_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue);
	void Go_To_Active_Tab(bool bInstantSwitch, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool Temp_bool_True_if_break_was_hit_Variable, bool CallFunc_Not_PreBool_ReturnValue, class URHSettingsPage* CallFunc_Get_Current_Page_KSSettingsPage, class UWidget* CallFunc_SetFocusToThis_ReturnValue, TArray<class URHSettingsWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgets, TArray<class URHWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgetsAsRH, class URHSettingsWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_CanGamepadNavigate_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_GetIsEnabled_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, int32 CallFunc_GetActiveWidgetIndex_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class UWBP_subscreen_nav_tab_C* CallFunc_Array_Get_Item_1);
	void Recover_From_Navigate_Failure(class URHWidget* PUMG_Widget, int32 Index_Offset, int32 CallFunc_GetCurrentFocusGroup_OutFocusGroup, bool CallFunc_GetCurrentFocusGroup_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, class URHSettingsPage* CallFunc_Get_Current_Page_KSSettingsPage, class UWidget* CallFunc_SetFocusToThis_ReturnValue, TArray<class URHSettingsWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgets, TArray<class URHWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgetsAsRH, int32 Temp_int_Variable, int32 CallFunc_Array_Find_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class URHSettingsWidget* CallFunc_Array_Get_Item, bool CallFunc_CanGamepadNavigate_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue_1, int32 Temp_int_Variable_1, bool Temp_bool_Variable, int32 K2Node_Select_Default);
	void Widget_Navigate_Down_Failure(int32 Focus_Group, class URHWidget* PUMG_Widget);
	void Widget_Navigate_Up_Failure(int32 Focus_Group, class URHWidget* PUMG_Widget);
	void On_Widget_Gamepad_Hovered(class URHWidget* PUMG_Widget, bool bHovered, class URHSettingsWidget* SettingsWidget, bool CallFunc_IsValid_ReturnValue, class URHSettingsPage* CallFunc_Get_Current_Page_KSSettingsPage, class URHSettingsWidget* CallFunc_GetSettingsWidgetForPUMGWidgetOnPage_KSSettingsWidget, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_Array_Contains_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2);
	void Scroll_Widget_Into_View(class URHWidget* PUMG_Widget, TArray<class URHSettingsPage*>& CallFunc_GetSettingsPages_ReturnValue, int32 CallFunc_GetCurrentFocusGroup_OutFocusGroup, bool CallFunc_GetCurrentFocusGroup_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class URHSettingsPage* CallFunc_Array_Get_Item, bool CallFunc_BooleanAND_ReturnValue, class UScrollBox* CallFunc_GetScrollBox_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void Scroll_To_Start(TArray<class URHSettingsPage*>& CallFunc_GetSettingsPages_ReturnValue, int32 CallFunc_GetCurrentFocusGroup_OutFocusGroup, bool CallFunc_GetCurrentFocusGroup_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class URHSettingsPage* CallFunc_Array_Get_Item, bool CallFunc_BooleanAND_ReturnValue, class UScrollBox* CallFunc_GetScrollBox_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void Scroll_To_End(TArray<class URHSettingsPage*>& CallFunc_GetSettingsPages_ReturnValue, int32 CallFunc_GetCurrentFocusGroup_OutFocusGroup, bool CallFunc_GetCurrentFocusGroup_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class URHSettingsPage* CallFunc_Array_Get_Item, bool CallFunc_BooleanAND_ReturnValue, class UScrollBox* CallFunc_GetScrollBox_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void GoBack(bool CallFunc_RemoveTopViewRoute_ReturnValue);
	void ConfirmExit(bool ShouldSaveSettings);
	void Restore_Settings(const TArray<class URHSettingsPage*>& Pages, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, TArray<class URHSettingsPage*>& CallFunc_GetSettingsPages_ReturnValue, class URHSettingsPage* CallFunc_Array_Get_Item, TArray<class URHSettingsWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgets, TArray<class URHWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgetsAsRH, class URHSettingsWidget* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1);
	void ExitSettingsPage(bool CallFunc_HasAnyUnsavedSetting_AnyUnsaved);
	void HasAnyUnsavedSetting(bool* AnyUnsaved, const TArray<class URHSettingsPage*>& Pages, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, class URHSettingsPage* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, TArray<class URHSettingsWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgets, TArray<class URHWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgetsAsRH, bool CallFunc_Less_IntInt_ReturnValue, class URHSettingsWidget* CallFunc_Array_Get_Item_1, bool CallFunc_IsSaved_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_1, TArray<class URHSettingsPage*>& CallFunc_GetSettingsPages_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1);
	bool NavigateBack();
	void SetupNavigationForPage(class URHSettingsPage* Page, int32 Index, const TArray<class URHSettingsWidget*>& GamepadNavigatableWidgets, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class URHSettingsWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgets, TArray<class URHWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgetsAsRH, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, class URHSettingsWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_LastIndex_ReturnValue, class URHSettingsWidget* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Add_ReturnValue, class URHSettingsWidget* CallFunc_Array_Get_Item_2, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Array_Add_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, int32 Temp_int_Array_Index_Variable_1, class URHSettingsWidget* CallFunc_Array_Get_Item_3, int32 CallFunc_Array_Add_ReturnValue_2, bool CallFunc_CanGamepadNavigate_ReturnValue);
	void On_Tab_Selected(class URHNavTabWidget* Tab_Selected, bool bInstantSwitch, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, class URHSettingsPage* CallFunc_Array_Get_Item, class UWBP_SettingsPage_C* K2Node_DynamicCast_AsWBP_Settings_Page, bool K2Node_DynamicCast_bSuccess, class UWBP_subscreen_nav_tab_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue);
	void Add_Tab_For_Settings_Page(class URHSettingsPage* Settings_Page_Widget, class UClass* Tab_Widget_Class, class FText CallFunc_GetPageName_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UWBP_subscreen_nav_tab_C* CallFunc_Create_ReturnValue, int32 CallFunc_Array_Add_ReturnValue);
	void Add_Settings_Page_Widget(class URHSettingsPage* Settings_Page, int32 CallFunc_Array_Add_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue, class UWidgetSwitcherSlot* K2Node_DynamicCast_AsWidget_Switcher_Slot, bool K2Node_DynamicCast_bSuccess);
	void AddSettingsPageWidget(class URHSettingsPage* SettingsPage);
	void OnShown();
	void OnHide();
	void InitializeWidget();
	void InitializeWidgetNavigation();
	void RebuildNavigation();
	void OnBackButton();
	void OnApplyButton();
	void OnRevertButton();
	void OnConfirmExit(bool ShouldSaveSettings);
	void PreConstruct(bool IsDesignTime);
	void RevertSettings();
	void OnCycleBumpers(bool bNext);
	void Construct();
	void ExecuteUbergraph_WBP_SettingsMenu(int32 EntryPoint, int32 Temp_int_Array_Index_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, class URHSettingsPage* K2Node_Event_SettingsPage, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class UWidget* CallFunc_SetFocusToThis_ReturnValue, TArray<class URHSettingsPage*>& CallFunc_GetSettingsPages_ReturnValue, class URHSettingsPage* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, TArray<class FName>& K2Node_MakeArray_Array, bool K2Node_Event_ShouldSaveSettings, bool K2Node_Event_IsDesignTime, bool CallFunc_GetFontByName_HasFound, const struct SlateCore_SlateFontInfo& CallFunc_GetFontByName_FontInfo, bool CallFunc_GetFontByName_HasFound_1, const struct SlateCore_SlateFontInfo& CallFunc_GetFontByName_FontInfo_1, class URHSettingsPage* CallFunc_Get_Current_Page_KSSettingsPage, int32 Temp_int_Loop_Counter_Variable_1, TArray<class URHSettingsWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgets, TArray<class URHWidget*>& CallFunc_GetSettingsWidgetsForPage_OutSettingsWidgetsAsRH, class URHSettingsWidget* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, enum class ERHSettingType CallFunc_GetSettingType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, bool K2Node_CustomEvent_bNext, bool CallFunc_ShouldUseMobileLayout_ReturnValue, class URHInputManager* CallFunc_GetInputManager_ReturnValue, TArray<class FName>& K2Node_MakeArray_Array_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, class URHSettingsDataFactory* CallFunc_GetSettingsDataFactory_ReturnValue, class URHInputManager* CallFunc_GetInputManager_ReturnValue_1, bool CallFunc_RemoveOverrideRoute_ReturnValue);
};

}


