#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1AC (0x6FC - 0x550)
// WidgetBlueprintGeneratedClass WBP_QueueSelect_QueueButton.WBP_QueueSelect_QueueButton_C
class UWBP_QueueSelect_QueueButton_C : public URHQueueWidgetBase
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x550(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      AnimCascadeIn;                                     // 0x558(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      HoverAnim;                                         // 0x560(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                BottomLight;                                       // 0x568(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                     CircularThrobber_159;                              // 0x570(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              ContentGroup;                                      // 0x578(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                          DesatEffect;                                       // 0x580(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            DescriptionText;                                   // 0x588(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Enabled;                                           // 0x590(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        EntryCostGroup;                                    // 0x598(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            GearRarityText;                                    // 0x5A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               HitTarget;                                         // 0x5A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Icon;                                              // 0x5B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image;                                             // 0x5B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_123;                                         // 0x5C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_151;                                         // 0x5C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              LockGroup;                                         // 0x5D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        MaxGearGroup;                                      // 0x5D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          MissionDetailsGroup;                               // 0x5E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             QueueDescriptionWrapper;                           // 0x5E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                         QueueImage;                                        // 0x5F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               QueueNotActive;                                    // 0x5F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               RequiredLevelGroup;                                // 0x600(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            RequiredLevelText;                                 // 0x608(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            SecurityText;                                      // 0x610(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Selected;                                          // 0x618(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        SquadSizeGroup;                                    // 0x620(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            SquadSizeTExt;                                     // 0x628(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            SubtitleText;                                      // 0x630(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TimerText;                                         // 0x638(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TitleText;                                         // 0x640(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            ValueText;                                         // 0x648(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnQueueBtnClicked;                                 // 0x650(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnQueueBtnHovered;                                 // 0x660(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnQueueBtnUnhovered;                               // 0x670(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class URHPartyManager*                       PartyDataFactory;                                  // 0x680(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class URH_PlayerInfo*                        LocalRHPlayerInfo;                                 // 0x688(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class URH_ConfigSubsystem*                   RHConfigSubsystem;                                 // 0x690(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class URHQueueDataFactory*                   QueueDataFactory;                                  // 0x698(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        CreditsID;                                         // 0x6A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4327[0x4];                                     // Fixing Size After Last Property  
	class UValClientQueueAsset*                  ValQueueData;                                      // 0x6A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         bCachedIsDisabled;                                 // 0x6B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4329[0x7];                                     // Fixing Size After Last Property  
	class AValExperienceManager*                 CachedExperienceManager;                           // 0x6B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         CachedPartyReady;                                  // 0x6C0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bUsesCycleId;                                      // 0x6C1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_432C[0x6];                                     // Fixing Size After Last Property  
	class FString                                CycleId;                                           // 0x6C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UValQueueScheduleManager*              CachedQueueScheduleManager;                        // 0x6D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       TimeUntilCycleUpdate;                              // 0x6E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct Engine_TimerHandle                    CachedCycleTimerHandle;                            // 0x6E8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class URH_MatchmakingQueueInfo*              QueueInfo;                                         // 0x6F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        AccountXPId;                                       // 0x6F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UWBP_QueueSelect_QueueButton_C* GetDefaultObj();

	void OnPlayerInventoryChanged(TArray<int32>& ItemIds);
	void Get_Current_Queue_Id(class FString* QueueId, const class FString& CallFunc_GetQueueId_ReturnValue, TMap<class FString, struct Valhalla_ResolvedBucketSchedule> CallFunc_GetActiveQueues_ResolvedBuckets, TMap<class FString, struct Valhalla_ResolvedNonUniformCycleInfo> CallFunc_GetActiveQueues_ResolvedCycles, bool CallFunc_GetActiveQueues_ReturnValue, const struct Valhalla_ResolvedNonUniformCycleInfo& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);
	void UpdateCycleTimer(const struct Valhalla_ResolvedNonUniformCycleInfo& CycleInfo, const class FString& CallFunc_GetQueueId_ReturnValue, class URH_MatchmakingQueueInfo* CallFunc_GetQueueInfoById_ReturnValue, const struct CoreUObject_DateTime& CallFunc_GetCurrentTime_ReturnValue, bool CallFunc_IsValid_ReturnValue, const class FString& CallFunc_GetQueueId_ReturnValue_1, bool CallFunc_NotEqual_StrStr_ReturnValue, TMap<class FString, struct Valhalla_ResolvedBucketSchedule> CallFunc_GetActiveQueues_ResolvedBuckets, TMap<class FString, struct Valhalla_ResolvedNonUniformCycleInfo> CallFunc_GetActiveQueues_ResolvedCycles, bool CallFunc_GetActiveQueues_ReturnValue, const struct Valhalla_ResolvedNonUniformCycleInfo& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, const struct CoreUObject_Timespan& CallFunc_Subtract_DateTimeDateTime_ReturnValue, int32 CallFunc_BreakTimespan_Days, int32 CallFunc_BreakTimespan_Hours, int32 CallFunc_BreakTimespan_Minutes, int32 CallFunc_BreakTimespan_Seconds, int32 CallFunc_BreakTimespan_Milliseconds, class FText CallFunc_Conv_IntToText_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData, class FText CallFunc_Conv_IntToText_ReturnValue_1, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct Engine_FormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue);
	void OnNonUniformCycleUpdated(const class FString& CycleId, bool CallFunc_IsEmpty_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, const struct Engine_TimerHandle& CallFunc_K2_SetTimer_ReturnValue, TMap<class FString, struct Valhalla_ResolvedBucketSchedule> CallFunc_GetActiveQueues_ResolvedBuckets, TMap<class FString, struct Valhalla_ResolvedNonUniformCycleInfo> CallFunc_GetActiveQueues_ResolvedCycles, bool CallFunc_GetActiveQueues_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue, const struct Valhalla_ResolvedNonUniformCycleInfo& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class URH_MatchmakingQueueInfo* CallFunc_GetQueueInfoById_ReturnValue, int32 CallFunc_Conv_StringToInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, class URH_MatchmakingQueueInfo* CallFunc_GetQueueInfoById_ReturnValue_1);
	void IsBoundToQueue(const class FString& QueueId, bool* IsBound, const class FString& CallFunc_GetQueueId_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue);
	void CheckPartyReady(class ARHLobbyHUD* K2Node_DynamicCast_AsRHLobby_HUD, bool K2Node_DynamicCast_bSuccess, class URHPartyManager* CallFunc_GetPartyManager_ReturnValue, bool CallFunc_IsPartyReady_ReturnValue);
	void OnPartyMemberDataUpdated(const struct RallyHereStart_RH_PartyMemberData& PartyMember);
	void OnPartyMemberReadyUpdated(class UObject* Sender, bool IsReady);
	void BindPartyReadyEvents(class UObject* LocalPartyFactory);
	class FText GetDebugTooltipText(const class FString& CallFunc_GetQueueId_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue_1, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct Engine_FormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue);
	void OnAppSettingsUpdated(class URH_ConfigSubsystem* ConfigSubsystem, bool CallFunc_IsValid_ReturnValue);
	void GetHighestPartyMemberLevel(int32* HighestPartyMemberLevel, int32 LocalHighestLevel, int32 Temp_int_Array_Index_Variable, const struct GameplayTags_GameplayTag& CallFunc_MakeLiteralGameplayTag_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class AValPlayerController* CallFunc_GetPlayer_ReturnValue, class AValExperienceManager* CallFunc_GetExperienceManager_ReturnValue, class URHPartyManager* CallFunc_GetPartyManager_ReturnValue, class UValXpTable* CallFunc_GetXpTable_ReturnValue, TArray<struct RallyHereStart_RH_PartyMemberData>& CallFunc_GetPartyMembers_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct RallyHereStart_RH_PartyMemberData& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class URH_PlayerInventory* CallFunc_GetPlayerInventory_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_GetInventoryItemCount_ItemCount, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, int32 CallFunc_GetLevelAt_ReturnValue);
	void AreQueueRestrictionsEnabled(bool* RestrictionsEnabled, const class FString& Temp_string_Variable, TMap<class FString, class FString> CallFunc_GetAppSettings_ReturnValue, const class FString& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_EqualEqual_StriStri_ReturnValue);
	void OnExperienceManager(class AValExperienceManager* ExperienceManager, bool CallFunc_IsValid_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class AValPlayerController* CallFunc_GetPlayer_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class URH_PlayerInventory* CallFunc_GetPlayerInventory_ReturnValue, bool CallFunc_IsValid_ReturnValue_2);
	void OnPlayerDataChanged();
	void Update_Info_from_Client_Queue_Info(class URH_MatchmakingQueueInfo*& QueueInfo, class UValClientQueueAsset* K2Node_DynamicCast_AsVal_Client_Queue_Asset, bool K2Node_DynamicCast_bSuccess);
	void UpdateInfoFromValQueueAsset(class UValClientQueueAsset* ValClientQueueData, enum class ESecurityLevel Temp_byte_Variable, bool CallFunc_IsValid_ReturnValue, class FText Temp_text_Variable, class FText CallFunc_TextToUpper_ReturnValue, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, class FText Temp_text_Variable_3, class FText Temp_text_Variable_4, class FText Temp_text_Variable_5, int32 CallFunc_GetNumSides_ReturnValue, int32 CallFunc_GetMaxPlayersPerSide_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, int64 CallFunc_Conv_IntToInt64_ReturnValue, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct Engine_FormatArgumentData>& K2Node_MakeArray_Array, bool CallFunc_TextIsEmpty_ReturnValue, class FText CallFunc_Format_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsValidSoftObjectReference_ReturnValue, bool CallFunc_TextIsEmpty_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_1, class FText CallFunc_TextToUpper_ReturnValue_1, bool Temp_bool_Variable, bool CallFunc_Greater_IntInt_ReturnValue, class FName CallFunc_MakeLiteralName_ReturnValue, const struct CoreUObject_LinearColor& CallFunc_GetColorFromRarity_ReturnValue, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor, class FText CallFunc_GetEmptyText_ReturnValue, class FText K2Node_Select_Default, class FText CallFunc_TextToUpper_ReturnValue_2, bool CallFunc_AreQueueRestrictionsEnabled_RestrictionsEnabled, bool CallFunc_TextIsEmpty_ReturnValue_2, bool CallFunc_Not_PreBool_ReturnValue_2, int32 CallFunc_GetMaxRequiredLevel_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_1, int32 CallFunc_GetMinRequiredLevel_ReturnValue, int32 CallFunc_Max_ReturnValue, int32 CallFunc_GetMaxRequiredLevel_ReturnValue_1, int64 CallFunc_Conv_IntToInt64_ReturnValue_1, int64 CallFunc_Conv_IntToInt64_ReturnValue_2, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, TArray<struct Engine_FormatArgumentData>& K2Node_MakeArray_Array_1, TArray<struct Engine_FormatArgumentData>& K2Node_MakeArray_Array_2, class FText CallFunc_Format_ReturnValue_1, class FText CallFunc_Format_ReturnValue_2, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData_4, TArray<struct Engine_FormatArgumentData>& K2Node_MakeArray_Array_3, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData_5, class FText CallFunc_Format_ReturnValue_3, TArray<struct Engine_FormatArgumentData>& K2Node_MakeArray_Array_4, class FText CallFunc_Format_ReturnValue_4, class FText K2Node_Select_Default_1, int32 CallFunc_GetMaxRequiredLevel_ReturnValue_2, int32 CallFunc_GetMinRequiredLevel_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class FText Temp_text_Variable_6, bool Temp_bool_Variable_1, class FText K2Node_Select_Default_2);
	void DetermineQueueEligibility(class UValClientQueueAsset* ValClientQueueAsset, bool bShouldDisable, int32 CurrentPlayerLevel, TMap<class FString, struct Valhalla_ResolvedBucketSchedule> CallFunc_GetActiveQueues_ResolvedBuckets, TMap<class FString, struct Valhalla_ResolvedNonUniformCycleInfo> CallFunc_GetActiveQueues_ResolvedCycles, bool CallFunc_GetActiveQueues_ReturnValue, bool CallFunc_IsEmpty_ReturnValue, const struct Valhalla_ResolvedNonUniformCycleInfo& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_Conv_StringToInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UValClientQueueAsset* K2Node_DynamicCast_AsVal_Client_Queue_Asset, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_GetQueueId_ReturnValue, const struct GameplayTags_GameplayTag& CallFunc_MakeLiteralGameplayTag_ReturnValue, bool CallFunc_AreQueueRestrictionsEnabled_RestrictionsEnabled, int32 CallFunc_Get_Local_Count_for_Item_Id_Count, int32 CallFunc_GetMaxRequiredLevel_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_GetMinRequiredLevel_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_1, bool CallFunc_IsQueueActive_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue_2, bool CallFunc_GreaterEqual_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_2, bool CallFunc_Not_PreBool_ReturnValue_3, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, int32 CallFunc_GetPartyMemberCount_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_3, int32 CallFunc_Get_Local_Count_for_Item_Id_Count_1, bool CallFunc_Greater_IntInt_ReturnValue_4, class UValXpTable* CallFunc_GetXpTable_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_2, int32 CallFunc_GetLevelAt_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_IsValid_ReturnValue_4);
	void Set_Is_Disabled(bool IsDisabled, bool Temp_bool_Variable, double CallFunc_SelectFloat_ReturnValue, double CallFunc_SelectFloat_ReturnValue_1, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor_1, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor_2, const struct SlateCore_SlateColor& K2Node_MakeStruct_SlateColor_3, const struct SlateCore_SlateColor& K2Node_Select_Default, bool Temp_bool_Variable_1, const struct SlateCore_SlateColor& K2Node_Select_Default_1, class UMaterialInstanceDynamic* CallFunc_GetEffectMaterial_ReturnValue, bool CallFunc_IsValid_ReturnValue, float CallFunc_SetRenderOpacity_InOpacity_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast);
	bool NavigateConfirm();
	void Construct();
	void OnButtonHovered();
	void OnButtonUnhovered();
	void GamepadHover();
	void GamepadUnhover();
	void GamepadConfirm();
	void SetButtonActive(bool bIsActive);
	void BndEvt__WBP_QueueSelect_QueueButton_HitTarget_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_QueueSelect_QueueButton_HitTarget_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_QueueSelect_QueueButton_HitTarget_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void PlayShowAnimationWithDelay(float Delay);
	void UninitializeWidget();
	void InitializeWidget();
	void ExecuteUbergraph_WBP_QueueSelect_QueueButton(int32 EntryPoint, bool K2Node_CustomEvent_bIsActive, float CallFunc_GetAnimationCurrentTime_ReturnValue, float CallFunc_GetAnimationCurrentTime_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, float K2Node_CustomEvent_Delay, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_2, bool CallFunc_IsValid_ReturnValue, class AValPlayerController* CallFunc_GetPlayer_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class AValExperienceManager* CallFunc_GetExperienceManager_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class AValPlayerController* CallFunc_GetPlayer_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, bool CallFunc_IsValid_ReturnValue_5, bool CallFunc_IsValid_ReturnValue_6, class URH_PlayerInventory* CallFunc_GetPlayerInventory_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, const class FString& CallFunc_Get_Current_Queue_Id_QueueId, class ABP_BrightLobbyHUD_C* K2Node_DynamicCast_AsBP_Bright_Lobby_HUD, bool K2Node_DynamicCast_bSuccess, class URHQueueDataFactory* CallFunc_GetQueueDataFactory_ReturnValue, class URHPartyManager* CallFunc_GetPartyManager_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, class URH_PlayerInfo* CallFunc_GetLocalPlayerInfo_ReturnValue, class URH_GameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, class URH_ConfigSubsystem* CallFunc_GetConfigSubsystem_ReturnValue, bool CallFunc_IsValid_ReturnValue_7, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5);
	void OnQueueBtnUnhovered__DelegateSignature(class UWidget* UnhoverWidget);
	void OnQueueBtnHovered__DelegateSignature(class UWidget* HoveredWidget);
	void OnQueueBtnClicked__DelegateSignature(const class FString& QueueId, class UWBP_QueueSelect_QueueButton_C* QueueButton);
};

}


