#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x130 (0x680 - 0x550)
// WidgetBlueprintGeneratedClass WBP_HomeScreen_v2.WBP_HomeScreen_v2_C
class UWBP_HomeScreen_v2_C : public URHHomeScreenWidget
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x550(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      AnimOnShow;                                        // 0x558(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      FadeOut;                                           // 0x560(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                          Content;                                           // 0x568(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerContextMenu_C*              ContextMenu;                                       // 0x570(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            CrossplayLabel;                                    // 0x578(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        CrossplaySettingWrapper;                           // 0x580(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            CrossplayValue;                                    // 0x588(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                FocusBlocker;                                      // 0x590(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AsyncIcon_C*                      InputTypeIcon;                                     // 0x598(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            InputTypeLabel;                                    // 0x5A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        InputTypeSettingWrapper;                           // 0x5A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            InputTypeValue;                                    // 0x5B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LocalPlayerNameplate_C*           Nameplate_Local;                                   // 0x5B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LocalPlayerNameplate_C*           Nameplate_Party_0;                                 // 0x5C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LocalPlayerNameplate_C*           Nameplate_Party_1;                                 // 0x5C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NewsRotatorWidget_C*              NewsRotator;                                       // 0x5D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          NewsSection;                                       // 0x5D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       PlayButtonSwitcher;                                // 0x5E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                               RemoteLobbyButton;                                 // 0x5E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Shared_Preview_Rotator_C*          Rotator;                                           // 0x5F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_0;                                       // 0x5F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyModule_C*                    WBP_PartyModule;                                   // 0x600(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelection_RegionSelectButton_C* WBP_QueueSelection_RegionSelectButton;             // 0x608(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QuickPlay_ButtonWrapper_C*        WBP_QuickPlay_ButtonWrapper;                       // 0x610(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                XboxIcon;                                          // 0x618(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                         ShowEMOL;                                          // 0x620(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B42[0x7];                                     // Fixing Size After Last Property  
	class UObject*                               ViewManagerWidget;                                 // 0x628(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                          LoadoutRoutes;                                     // 0x630(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                  CameraTag;                                         // 0x640(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                RemoteLobbyButtonMessage;                          // 0x648(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class ACameraActor*                          CachedCamera;                                      // 0x658(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        PartyMemberCounter;                                // 0x660(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  PartyTag;                                          // 0x664(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B47[0x4];                                     // Fixing Size After Last Property  
	TArray<struct RallyHereStart_RH_PartyMemberData> CachedPartyMembers;                                // 0x670(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UWBP_HomeScreen_v2_C* GetDefaultObj();

	void CREATEDELEGATE_PROXYFUNCTION_0(struct CoreUObject_Guid& PartyMemberId);
	void On_Queue_Left();
	void OnQueueJoined(const class FString& QueueId, class FText CallFunc_Conv_StringToText_ReturnValue, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct Engine_FormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue);
	void OnPlayButtonNavInit();
	void InitializeWidgetNavigation(const TArray<class URHWidget*>& LocalWidgets, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate);
	void OnHide(class AValPlayerController* CallFunc_GetPlayer_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate);
	void OnShown(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class AValPlayerController* CallFunc_GetPlayer_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, bool CallFunc_IsAnimationPlaying_ReturnValue);
	void OnMatchmakingCacheRegionsUpdated(class URH_MatchmakingBrowserCache* Result);
	void ShowFirstTimeVoiceSettings(bool CallFunc_AddViewRoute_ReturnValue, class URHViewManager* CallFunc_GetViewManager_ReturnValue, class FName CallFunc_MakeLiteralName_ReturnValue, bool CallFunc_IsValid_ReturnValue, class URHWidget* CallFunc_GetTopViewRouteWidget_ReturnValue, class URHHomeScreenWidget* K2Node_DynamicCast_AsRHHome_Screen_Widget, bool K2Node_DynamicCast_bSuccess, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, class UValGameUserSettings* K2Node_DynamicCast_AsVal_Game_User_Settings, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsLocalActionSaved_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void BindPartyEvents(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, class ARHLobbyHUD* K2Node_DynamicCast_AsRHLobby_HUD, bool K2Node_DynamicCast_bSuccess, class URHPartyManager* CallFunc_GetPartyManager_ReturnValue);
	void UpdatePartyNameplates(bool LocalInParty, const TArray<struct RallyHereStart_RH_PartyMemberData>& LocalPartyMembers, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, class ARHLobbyHUD* K2Node_DynamicCast_AsRHLobby_HUD, bool K2Node_DynamicCast_bSuccess, class URHPartyManager* CallFunc_GetPartyManager_ReturnValue, TArray<struct RallyHereStart_RH_PartyMemberData>& CallFunc_GetPartyMembers_ReturnValue, int32 Temp_int_Array_Index_Variable_1, bool K2Node_SwitchInteger_CmpSuccess, const struct RallyHereStart_RH_PartyMemberData& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, const struct CoreUObject_Guid& CallFunc_GetRHPlayerUuid_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, const struct RallyHereStart_RH_PartyMemberData& CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, class AValPlayerController* CallFunc_GetPlayer_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, const struct CoreUObject_Guid& CallFunc_GetRHPlayerUuid_ReturnValue_1, bool CallFunc_NotEqual_GuidGuid_ReturnValue);
	void UpdateContextPrompts(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, TArray<class FName>& K2Node_MakeArray_Array, class ABP_BrightLobbyHUD_C* K2Node_DynamicCast_AsBP_Bright_Lobby_HUD, bool K2Node_DynamicCast_bSuccess);
	void UpdateCamera(bool CallFunc_IsVisible_ReturnValue, class AValPlayerController* CallFunc_GetPlayer_ReturnValue, const struct Engine_TimerHandle& CallFunc_K2_SetTimer_ReturnValue, class ACameraActor* CallFunc_GetHomeCamera_Camera, bool CallFunc_IsValid_ReturnValue);
	void OnInitialized();
	struct UMG_EventReply OnFocusReceived(const struct SlateCore_Geometry& MyGeometry, const struct SlateCore_FocusEvent& InFocusEvent, const struct UMG_EventReply& K2Node_MakeStruct_EventReply);
	void HandleOnLobbyConnected(class AValRHLobbyHUD* K2Node_DynamicCast_AsVal_RHLobby_HUD, bool K2Node_DynamicCast_bSuccess, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class ABP_ValPlayerController_City_C* K2Node_DynamicCast_AsBP_Val_Player_Controller_City, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsLocalLobbyConnected_ReturnValue);
	void OnPartyMemberRemoved(const struct CoreUObject_Guid& PartyMemberId);
	void OnViewTargetChanged(class AActor* ViewTarget, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue);
	void OnPartyUpdate(const struct RallyHereStart_RH_PartyMemberData& PartyMember);
	void OnReadyUp(class UObject* Sender, bool IsReady);
	struct UMG_EventReply OnMouseButtonDown(const struct SlateCore_Geometry& MyGeometry, struct SlateCore_PointerEvent& MouseEvent, const struct UMG_EventReply& CallFunc_Handled_ReturnValue);
	struct UMG_EventReply OnKeyUp(const struct SlateCore_Geometry& MyGeometry, const struct SlateCore_KeyEvent& InKeyEvent, const struct InputCore_Key& CallFunc_GetKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue, enum class EQuickPlayQueueState CallFunc_GetCurrentQuickPlayState_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, const struct UMG_EventReply& CallFunc_Unhandled_ReturnValue);
	void EnableRemoteLobbyButton();
	void StopConflictingAnimation(class FName AnimName, const struct RallyHereStart_TickAnimationParams& CallFunc_GetTickAnimationInfo_OutAnimParams, bool CallFunc_GetTickAnimationInfo_ReturnValue);
	void InitializeContentWidgets(int32 Temp_int_Variable, class UWidget* CallFunc_GetChildAt_ReturnValue, int32 CallFunc_GetChildrenCount_ReturnValue, class URHWidget* K2Node_DynamicCast_AsRHWidget, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void ShowEndOfMatch(class UGameInstance* CallFunc_GetGameInstance_ReturnValue, class UValGameInstance* K2Node_DynamicCast_AsVal_Game_Instance, bool K2Node_DynamicCast_bSuccess);
	void GetHomeCamera(class ACameraActor** Camera, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue, TArray<class ACameraActor*>& CallFunc_GetAllActorsOfClassWithTag_OutActors, class ACameraActor* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void CanFocus(bool* bAllowFous, class ABP_BrightLobbyHUD_C* K2Node_DynamicCast_AsBP_Bright_Lobby_HUD, bool K2Node_DynamicCast_bSuccess, class URHPopupManager* CallFunc_GetPopupManager_ReturnValue, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	bool NavigateBack(bool CallFunc_AddViewRoute_ReturnValue, enum class ERH_INPUT_STATE CallFunc_GetCurrentInputState_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, int32 CallFunc_GetCurrentFocusGroup_OutFocusGroup, bool CallFunc_GetCurrentFocusGroup_ReturnValue, bool K2Node_SwitchInteger_CmpSuccess, bool CallFunc_IsValid_ReturnValue);
	void HandleQueueStatusChange(enum class ERH_MatchStatus NewStatus, bool K2Node_SwitchEnum_CmpSuccess, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, const struct Engine_FormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct Engine_FormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, bool CallFunc_IsAnimationPlaying_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue);
	void UnbindLobbyAnimationHandling(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class ARHLobbyHUD* K2Node_DynamicCast_AsRHLobby_HUD, bool K2Node_DynamicCast_bSuccess, class URHQueueDataFactory* CallFunc_GetQueueDataFactory_ReturnValue);
	void BindLobbyAnimationHandling(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class ARHLobbyHUD* K2Node_DynamicCast_AsRHLobby_HUD, bool K2Node_DynamicCast_bSuccess, class URHQueueDataFactory* CallFunc_GetQueueDataFactory_ReturnValue);
	void HandleContextMenuShown(class UWidget* FocusWidget);
	void FocusGroupNavigateRightFailure(int32 FocusGroup);
	void FocusGroupNavigateLeftFailure(int32 FocusGroup);
	void NewsPanelVisibilityChanged(bool IsVisible);
	void HandleViewSocial();
	void FocusGroupNavigateDownFailure(int32 FocusGroup);
	void Update_Region();
	void FocusGroupNavigateUpFailure(int32 FocusGroup);
	void LoginState(enum class ERHLoginState LoginState);
	void Handle_Context_Menu_Hidden();
	void Handle_Player_Card_Back_Button();
	void OnSetQueueInputState(enum class ERH_INPUT_STATE InputState);
	void UpdateCrossplay();
	void Handle_Context_Menu_Navigation(TArray<class UWidget*>& NavWidgets, class UWidget* Default_Widget);
	void Handle_Party_Player_Card_Selected(class UWBP_player_card_module_C* Selected_Player_Card);
	void OnPartyLeaveVisibilityChange(bool Visible);
	void UninitializeWidget();
	void HandleOnPartyMemberLeft(const struct RallyHereStart_RH_PartyMemberData& PartyMember);
	void InitializeWidget();
	void BndEvt__WBP_HomeScreen_v2_RemoteLobbyButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_HomeScreen_v2_WBP_QueueSelection_RegionSelectButton_K2Node_ComponentBoundEvent_1_RegionSelectRequested__DelegateSignature();
	void HandleOpenRegionSelect();
	void HandleLobbyMenu();
	void ExecuteUbergraph_WBP_HomeScreen_v2(int32 EntryPoint, bool CallFunc_AddViewRoute_ReturnValue, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, enum class ESlateVisibility Temp_byte_Variable_2, enum class ESlateVisibility Temp_byte_Variable_3, class URH_GameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class URH_MatchmakingBrowserCache* CallFunc_GetMatchmakingCache_ReturnValue, bool Temp_bool_Variable_1, bool CallFunc_IsValid_ReturnValue, class URH_GameInstanceSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_1, class URH_MatchmakingBrowserCache* CallFunc_GetMatchmakingCache_ReturnValue_1, class FText Temp_text_Variable, bool CallFunc_IsValid_ReturnValue_1, TArray<struct RallyHereAPI_RHAPI_SiteSettings>& CallFunc_GetAllRegions_ReturnValue, class UWidget* K2Node_CustomEvent_FocusWidget, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 K2Node_Event_FocusGroup_3, int32 K2Node_Event_FocusGroup_2, bool CallFunc_IsPlatform_ReturnValue, enum class ESlateVisibility K2Node_Select_Default, bool K2Node_CustomEvent_IsVisible, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, TArray<enum class ERHLoginState>& K2Node_MakeArray_Array, class ABP_BrightLobbyHUD_C* K2Node_DynamicCast_AsBP_Bright_Lobby_HUD, bool K2Node_DynamicCast_bSuccess, int32 K2Node_Event_FocusGroup_1, class URHLoginDataFactory* CallFunc_GetLoginDataFactory_ReturnValue, enum class ERHLoginState CallFunc_GetCurrentLoginState_ReturnValue, int32 K2Node_Event_FocusGroup, bool CallFunc_Array_Contains_ReturnValue, enum class ERHLoginState K2Node_CustomEvent_LoginState, bool K2Node_SwitchEnum_CmpSuccess, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, class FText Temp_text_Variable_3, enum class ERH_INPUT_STATE Temp_byte_Variable_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, enum class ERH_INPUT_STATE K2Node_CustomEvent_InputState, class ARHLobbyHUD* K2Node_DynamicCast_AsRHLobby_HUD, bool K2Node_DynamicCast_bSuccess_1, class FText K2Node_Select_Default_1, bool CallFunc_IsCrossplayEnabled_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, class FText Temp_text_Variable_4, TArray<class UWidget*>& K2Node_CustomEvent_NavWidgets, class UWidget* K2Node_CustomEvent_Default_Widget, bool CallFunc_IsPlatform_ReturnValue_1, class UWBP_player_card_module_C* K2Node_CustomEvent_Selected_Player_Card, enum class ESlateVisibility K2Node_Select_Default_2, bool K2Node_CustomEvent_Visible, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, class UWidget* CallFunc_GetCurrentFocusForGroup_ReturnValue, int32 CallFunc_GetCurrentFocusGroup_OutFocusGroup, bool CallFunc_GetCurrentFocusGroup_ReturnValue, class FText Temp_text_Variable_5, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, TArray<class URHWidget*>& CallFunc_Get_Navigation_Widgets_Return_Value, bool Temp_bool_Variable_2, class URHWidget* CallFunc_Array_Get_Item, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class FText K2Node_Select_Default_3, class UWBP_Social_Snapshot_C* CallFunc_GetPrimaryFocus_Primary_Focus, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, class ARHLobbyHUD* K2Node_DynamicCast_AsRHLobby_HUD_1, bool K2Node_DynamicCast_bSuccess_2, enum class ERH_INPUT_STATE CallFunc_GetCurrentInputState_ReturnValue, class URHLoginDataFactory* CallFunc_GetLoginDataFactory_ReturnValue_1, class ARHLobbyHUD* K2Node_DynamicCast_AsRHLobby_HUD_2, bool K2Node_DynamicCast_bSuccess_3, class URHPartyManager* CallFunc_GetPartyManager_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, bool CallFunc_IsContextMenuOpen_IsOpen, const struct RallyHereStart_RH_PartyMemberData& K2Node_CustomEvent_PartyMember, class APlayerController* CallFunc_GetPlayerController_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, class ABP_ValPlayerController_City_C* K2Node_DynamicCast_AsBP_Val_Player_Controller_City, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_AddViewRoute_ReturnValue_1, bool CallFunc_AddViewRoute_ReturnValue_2, enum class ESlateVisibility Temp_byte_Variable_5, enum class ESlateVisibility Temp_byte_Variable_6, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_10, bool Temp_bool_Variable_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_11, enum class ESlateVisibility K2Node_Select_Default_4, class ABP_BrightLobbyHUD_C* K2Node_DynamicCast_AsBP_Bright_Lobby_HUD_1, bool K2Node_DynamicCast_bSuccess_5);
};

}


