#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1E9 (0x769 - 0x580)
// WidgetBlueprintGeneratedClass WBP_QueueSelect_Explicit.WBP_QueueSelect_Explicit_C
class UWBP_QueueSelect_Explicit_C : public URHQuickPlay
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x580(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      ShowOptions;                                       // 0x588(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUniformGridPanel*                     CTFGrid;                                           // 0x590(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                     DevQueueGrid;                                      // 0x598(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_105;                                         // 0x5A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_224;                                         // 0x5A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                     OneFlagGrid;                                       // 0x5B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               PartyNotReadyWarning;                              // 0x5B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       QueueDataSwitcher;                                 // 0x5C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       QueueGroupSwitcher;                                // 0x5C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          QueueLoadingBox;                                   // 0x5D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        QueueSelectContainer;                              // 0x5D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              QueueSelectionView;                                // 0x5E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              QueueSelectPanel;                                  // 0x5E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Menu_C*                     TabCTF;                                            // 0x5F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Menu_C*                     TabDevQueues;                                      // 0x5F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                     TabGroup;                                          // 0x600(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_Menu_C*                     TabOneFlag;                                        // 0x608(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelect_QueueButton_C*        WBP_QueueSelect_QueueButton;                       // 0x610(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelect_QueueButton_C*        WBP_QueueSelect_QueueButton_2;                     // 0x618(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelect_QueueButton_C*        WBP_QueueSelect_QueueButton_3;                     // 0x620(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelect_QueueButton_C*        WBP_QueueSelect_QueueButton_4;                     // 0x628(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelect_QueueButton_C*        WBP_QueueSelect_QueueButton_5;                     // 0x630(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelect_QueueButton_C*        WBP_QueueSelect_QueueButton_6;                     // 0x638(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelect_QueueButton_C*        WBP_QueueSelect_QueueButton_7;                     // 0x640(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelect_QueueButton_C*        WBP_QueueSelect_QueueButton_8;                     // 0x648(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelect_QueueButton_C*        WBP_QueueSelect_QueueButton_9;                     // 0x650(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelect_QueueButton_C*        WBP_QueueSelect_QueueButton_10;                    // 0x658(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelect_QueueButton_C*        WBP_QueueSelect_QueueButton_11;                    // 0x660(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_QueueSelect_QueueButton_C*        WBP_QueueSelect_QueueButton_12;                    // 0x668(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SubscreenHeader_C*                WBP_SubscreenHeader;                               // 0x670(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ThrobberHorizontal_C*             WBP_ThrobberHorizontal;                            // 0x678(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_QueueSelect_QueueButton_C*> AllQueueButtons;                                   // 0x680(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                        MaxColumn;                                         // 0x690(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_43BB[0x4];                                     // Fixing Size After Last Property  
	class URHQueueDataFactory*                   QueueDataFactory;                                  // 0x698(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWidget*                               CurrentScreen;                                     // 0x6A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                       MapScrollSpeed;                                    // 0x6A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                               ShowQuickPlaySFX;                                  // 0x6B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class URHWidget*                             CustomMatchButton;                                 // 0x6B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                               TopQueueButton;                                    // 0x6C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                        GRID_WIDTH;                                        // 0x6C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_43C3[0x4];                                     // Fixing Size After Last Property  
	class UUniformGridPanel*                     ActiveQueueGrid;                                   // 0x6D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUI_Button_Menu_C*>             NavTabs;                                           // 0x6D8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class FString, class UWBP_QueueSelect_QueueButton_C*> QueueWidgetMap;                                    // 0x6E8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWBP_QueueSelect_QueueButton_C*> UnidentifiedQueueButtons;                          // 0x738(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class URHPartyManager*                       LocalPartyFactory;                                 // 0x748(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                        DesiredQueueSortOrder;                             // 0x750(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class URH_MatchmakingQueueInfo*              SelectedQueueInfo;                                 // 0x760(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         QueueUponSelection;                                // 0x768(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UWBP_QueueSelect_Explicit_C* GetDefaultObj();

	void OnPartyStateChanged();
	void OnPartyMemberStateChanged(const struct RallyHereStart_RH_PartyMemberData& PartyMember);
	void Update_Ready_Status(enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, bool CallFunc_CheckPartyReady_ReturnValue, double CallFunc_SelectFloat_ReturnValue, enum class ESlateVisibility K2Node_Select_Default, bool CallFunc_Not_PreBool_ReturnValue, float CallFunc_SetRenderOpacity_InOpacity_ImplicitCast);
	void OnPartyReadyStatusChanged(class URH_PlayerInfo* Sender, bool IsReady);
	void BindPartyEvents(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, class ARHLobbyHUD* K2Node_DynamicCast_AsRHLobby_HUD, bool K2Node_DynamicCast_bSuccess, class URHPartyManager* CallFunc_GetPartyManager_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5);
	bool CheckPartyReady(class URHPartyManager* CallFunc_GetPartyManager_ReturnValue, bool CallFunc_IsPartyReady_ReturnValue);
	void GetHighestPlayerLevel(int32* HighestPartyMemberLevel, int32 LocalHighestCount, const struct GameplayTags_GameplayTag& CallFunc_MakeLiteralGameplayTag_ReturnValue, int32 CallFunc_GetAccountXPId_ItemId, int32 CallFunc_GetAccountXPId_ItemId_1, int32 CallFunc_Get_Local_Count_for_Item_Id_Count, int32 Temp_int_Array_Index_Variable, class URHPartyManager* CallFunc_GetPartyManager_ReturnValue, TArray<struct RallyHereStart_RH_PartyMemberData>& CallFunc_GetPartyMembers_ReturnValue, int32 Temp_int_Loop_Counter_Variable, const struct RallyHereStart_RH_PartyMemberData& CallFunc_Array_Get_Item, int32 CallFunc_Add_IntInt_ReturnValue, class URH_PlayerInventory* CallFunc_GetPlayerInventory_ReturnValue, int32 CallFunc_GetInventoryItemCount_ItemCount, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class AValPlayerController* CallFunc_GetPlayer_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class AValExperienceManager* CallFunc_GetExperienceManager_ReturnValue, class UValXpTable* CallFunc_GetXpTable_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_GetLevelAt_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);
	void Calculate_Matchmaking_Attributes(struct RallyHereStart_RHMatchmakingAttributes* Attributes, TMap<class FString, double> Matchmaking_Double_Attributes, int32 Skill, TSet<class FString> Matchmaking_Tag_Attributes, const class FString& Temp_string_Variable, int32 CallFunc_GetAccountRankId_ItemId, int32 CallFunc_Get_Local_Count_for_Item_Id_Count, double CallFunc_Conv_IntToDouble_ReturnValue, const struct RallyHereStart_RHMatchmakingAttributes& K2Node_MakeStruct_RHMatchmakingAttributes, TMap<class FString, float> K2Node_MakeStruct_DoubleAttributes_ImplicitCast);
	void Set_Best_Queue_Tab();
	void InitializeStaticWidgets(const TArray<class UWidget*>& LocalWidgets, const TArray<class UWidget*>& LocalPanelWidgets, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 Temp_int_Array_Index_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UWidget* CallFunc_Array_Get_Item, class UWidget* CallFunc_Array_Get_Item_1, class UPanelWidget* K2Node_DynamicCast_AsPanel_Widget, bool K2Node_DynamicCast_bSuccess, class UWBP_QueueSelect_QueueButton_C* K2Node_DynamicCast_AsWBP_Queue_Select_Queue_Button, bool K2Node_DynamicCast_bSuccess_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1);
	void BindNavTabs(const TArray<class UWidget*>& LocalTabWidgets, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UUI_Button_Menu_C* K2Node_DynamicCast_AsUI_Button_Menu, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, const class FString& CallFunc_GetBuildConfiguration_ReturnValue, bool CallFunc_NotEqual_StriStri_ReturnValue);
	void HandleTabButtonClicked(int32 Value, bool bPlayAnim, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, class UUI_Button_Menu_C* CallFunc_Array_Get_Item, class UValGameUserSettings* K2Node_DynamicCast_AsVal_Game_User_Settings, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class UWidget* CallFunc_GetActiveWidget_ReturnValue, class UUniformGridPanel* K2Node_DynamicCast_AsUniform_Grid_Panel, bool K2Node_DynamicCast_bSuccess_1, int32 CallFunc_GetActiveWidgetIndex_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, class UUI_Button_Menu_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue);
	void Play_Cascade_Anim(const TArray<class UWidget*>& LocalQueueWidgets, float CurrentDelay, float DELAY_INTERVAL, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	struct UMG_EventReply OnKeyDown(const struct SlateCore_Geometry& MyGeometry, const struct SlateCore_KeyEvent& InKeyEvent, const struct UMG_EventReply& CallFunc_Handled_ReturnValue, const struct InputCore_Key& CallFunc_GetKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, const struct UMG_EventReply& CallFunc_OnKeyDown_ReturnValue);
	struct UMG_EventReply OnKeyUp(const struct SlateCore_Geometry& MyGeometry, const struct SlateCore_KeyEvent& InKeyEvent, const struct UMG_EventReply& CallFunc_Handled_ReturnValue, const struct InputCore_Key& CallFunc_GetKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, const struct UMG_EventReply& CallFunc_OnKeyUp_ReturnValue);
	void SetTouchActiveState(class URH_MatchmakingQueueInfo* QueueInfo, const class FString& CallFunc_GetQueueId_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UWBP_QueueSelect_QueueButton_C* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, const class FString& CallFunc_GetQueueId_ReturnValue_1, bool CallFunc_EqualEqual_StriStri_ReturnValue);
	void GoToQueueScreen(class UWidget* CallFunc_GetActiveWidget_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue);
	void ReconcileGameModeButtonEnabling(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class UWBP_QueueSelect_QueueButton_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	bool NavigateBack();
	void Reset_Queue_Selection(int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, TArray<class FString>& CallFunc_Map_Keys_Keys, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class UWBP_QueueSelect_QueueButton_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, bool CallFunc_Array_RemoveItem_ReturnValue, const class FString& CallFunc_Array_Get_Item_1, class UWBP_QueueSelect_QueueButton_C* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void SetupQueueButtons(bool LocalDevQueue, int32 QueueId, int32 CurrentIndex, class UUniformGridPanel* PreferredGrid, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UWBP_QueueSelect_QueueButton_C* CallFunc_Create_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 CallFunc_Array_Add_ReturnValue_1, TArray<class URH_MatchmakingQueueInfo*>& CallFunc_GetQueues_ReturnValue, class URH_MatchmakingQueueInfo* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, class UValClientQueueAsset* K2Node_DynamicCast_AsVal_Client_Queue_Asset, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_GetQueueId_ReturnValue, class UWBP_QueueSelect_QueueButton_C* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, int32 CallFunc_GetChildrenCount_ReturnValue, int32 CallFunc_Divide_IntInt_ReturnValue, int32 CallFunc_Percent_IntInt_ReturnValue, bool Temp_bool_Variable, class UUniformGridSlot* CallFunc_AddChildToUniformGrid_ReturnValue, class UUniformGridPanel* K2Node_Select_Default);
	void GoToLastScreen();
	void OnControlQueuePermissionChanged(bool CanControl);
	void OnQueuePermissionChanged(bool CanQueue);
	void OnShown();
	void OnHide();
	void OnBackButtonClicked();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void CreateCustomMatch();
	void HandleGameModeSelected(const class FString& QueueId, class UWBP_QueueSelect_QueueButton_C* QueueButton);
	void InitializeWidget();
	void ExecuteUbergraph_WBP_QueueSelect_Explicit(int32 EntryPoint, bool K2Node_Event_CanControl, bool K2Node_Event_CanQueue, class ABP_BrightLobbyHUD_C* K2Node_DynamicCast_AsBP_Bright_Lobby_HUD, bool K2Node_DynamicCast_bSuccess, bool CallFunc_NavigateBack_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class ABP_BrightLobbyHUD_C* K2Node_DynamicCast_AsBP_Bright_Lobby_HUD_1, bool K2Node_DynamicCast_bSuccess_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, bool K2Node_Event_IsDesignTime, bool CallFunc_AddViewRoute_ReturnValue, class ABP_BrightLobbyHUD_C* K2Node_DynamicCast_AsBP_Bright_Lobby_HUD_2, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_Remove_Top_View_Route_ViewChanged, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const class FString& K2Node_CustomEvent_QueueId, class UWBP_QueueSelect_QueueButton_C* K2Node_CustomEvent_QueueButton, class ABP_BrightLobbyHUD_C* K2Node_DynamicCast_AsBP_Bright_Lobby_HUD_3, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_SetSelectedQueueId_ReturnValue, bool CallFunc_Remove_Top_View_Route_ViewChanged_1, const struct RallyHereStart_RHMatchmakingAttributes& CallFunc_Calculate_Matchmaking_Attributes_Attributes, bool CallFunc_SetSelectedMatchmakingAttributes_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, int32 Temp_int_Array_Index_Variable, class UWBP_QueueSelect_QueueButton_C* CallFunc_Array_Get_Item, class UGameUserSettings* CallFunc_GetGameUserSettings_ReturnValue, class ARHLobbyHUD* K2Node_DynamicCast_AsRHLobby_HUD, bool K2Node_DynamicCast_bSuccess_4, class UValGameUserSettings* K2Node_DynamicCast_AsVal_Game_User_Settings, bool K2Node_DynamicCast_bSuccess_5, class URHQueueDataFactory* CallFunc_GetQueueDataFactory_ReturnValue, bool CallFunc_JoinQueue_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, bool CallFunc_CanQueue_ReturnValue, TArray<class FName>& K2Node_MakeArray_Array);
};

}


