#pragma once




namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x110 (0x6C0 - 0x5B0)
// WidgetBlueprintGeneratedClass WBP_PlayerContextMenu.WBP_PlayerContextMenu_C
class UWBP_PlayerContextMenu_C : public URHContextMenu
{
public:
	struct Engine_PointerToUberGraphFrame        UberGraphFrame;                                    // 0x5B0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      ShowAnim;                                          // 0x5B8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                              AliasContainer;                                    // 0x5C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_159;                                         // 0x5C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          MenuContainer;                                     // 0x5D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                OptionsBgA;                                        // 0x5D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                OptionsBgB;                                        // 0x5E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          OptionsContainerA;                                 // 0x5E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          OptionsContainerB;                                 // 0x5F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              OuterMenuContainer;                                // 0x5F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_player_card_module_C*             PlayerCard;                                        // 0x600(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          ScreenCanvas;                                      // 0x608(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          VerticalBox_0;                                     // 0x610(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Social_Platform_ID_C*             WBP_Social_Platform_ID;                            // 0x618(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Social_Platform_ID_C*             WBP_Social_Platform_ID_1;                          // 0x620(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Social_Platform_ID_C*             WBP_Social_Platform_ID_2;                          // 0x628(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Social_Platform_ID_C*             WBP_Social_Platform_ID_3;                          // 0x630(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Social_Platform_ID_C*             WBP_Social_Platform_ID_4;                          // 0x638(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Social_Platform_ID_C*             WBP_Social_Platform_ID_5;                          // 0x640(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VoiceActivityContainer_C*         WBP_VoiceActivityContainer;                        // 0x648(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnReadyForNavigation;                              // 0x650(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnMenuHidden;                                      // 0x660(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnMenuStart;                                       // 0x670(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct InputCore_Key>                 KeysToAllow;                                       // 0x680(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TScriptInterface<class IIKSContextMenuTarget_C> Last_Interacted_Target;                            // 0x690(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnReportPlayer_0;                                  // 0x6A0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWidget*>                       LocalWidgets;                                      // 0x6B0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

	static class UClass* StaticClass();
	static class UWBP_PlayerContextMenu_C* GetDefaultObj();

	void GetOptionWidgets(TArray<class UWBP_PlayerContextMenuOption_C*>* Option_Widgets, const TArray<class UWidget*>& LocalIterationWidgets, const TArray<class UWBP_PlayerContextMenuOption_C*>& ComboArray, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, class UWidget* CallFunc_Array_Get_Item, class UWidget* CallFunc_Array_Get_Item_1, class UWBP_PlayerContextMenuOption_C* K2Node_DynamicCast_AsWBP_Player_Context_Menu_Option, bool K2Node_DynamicCast_bSuccess, class UWBP_PlayerContextMenuOption_C* K2Node_DynamicCast_AsWBP_Player_Context_Menu_Option_1, bool K2Node_DynamicCast_bSuccess_1, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue_1);
	void OnUpdateContextButtons(TArray<class UWidget*>& CallFunc_GetAllActiveButtons_Buttons, class UWidget* CallFunc_GetFirstActiveButton_FocusWidget);
	void HandleOptionSelected(enum class EPlayerContextOptions ContextOption, bool CallFunc_OnOptionSelected_ReturnValue);
	void IsShowingPlayer(class URH_RHFriendAndPlatformFriend* Friend, bool* Showing, bool CallFunc_IsContextMenuOpen_IsOpen, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void IsContextMenuOpen(bool* IsOpen, bool CallFunc_IsVisible_ReturnValue);
	void ShowForPlayerCard(class UWBP_player_card_module_C* PlayerCard, TScriptInterface<class IIKSContextMenuTarget_C> CallFunc_ShowForPlayer_TargetWidget_CastInput);
	void MoveToWidgetSide(class UWidget* Widget, enum class EViewSide Side, const struct SlateCore_Margin& Padding, class URHWidget* K2Node_DynamicCast_AsRHWidget, bool K2Node_DynamicCast_bSuccess);
	void MoveToWidget(class UWidget* Widget, double Pad, class URHWidget* K2Node_DynamicCast_AsRHWidget, bool K2Node_DynamicCast_bSuccess, const struct SlateCore_Margin& K2Node_MakeStruct_Margin);
	void IsCurrentAccountId(const class FString& AccountId, bool* IsAccountId, bool CallFunc_IsValid_ReturnValue, const struct CoreUObject_Guid& CallFunc_GetRHPlayerUuid_ReturnValue, const class FString& CallFunc_GetVoiceIdByPlayerUuid_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue);
	void RefreshOptionsPadding(bool Found_First_Visible, const struct SlateCore_Margin& K2Node_MakeStruct_Margin, bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, const struct SlateCore_Margin& K2Node_MakeStruct_Margin_1, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Loop_Counter_Variable, const struct SlateCore_Margin& K2Node_MakeStruct_Margin_2, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, class UWidget* CallFunc_Array_Get_Item, class UWidget* CallFunc_Array_Get_Item_1, class UVerticalBoxSlot* CallFunc_SlotAsVerticalBoxSlot_ReturnValue, class UVerticalBoxSlot* CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_IsVisible_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, const struct SlateCore_Margin& K2Node_MakeStruct_Margin_3, enum class ESlateVisibility Temp_byte_Variable_2, bool Temp_bool_Is_Past_First_Visible_Child_Variable, enum class ESlateVisibility Temp_byte_Variable_3, bool Temp_bool_Is_Past_First_Visible_Child_Variable_1, bool Temp_bool_Variable_1, enum class ESlateVisibility K2Node_Select_Default, enum class ESlateVisibility K2Node_Select_Default_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue_1);
	void HideContextMenu(bool CallFunc_IsContextMenuOpen_IsOpen, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void Move_To_Player_Card_And_Show(class UWBP_player_card_module_C* Selected_Player_Card);
	void Is_Any_Option_Visible(bool* Return_Value, const TArray<class UWidget*>& FoundButtons, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class URHContextMenuButton* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UWBP_PlayerContextMenuOption_C* K2Node_DynamicCast_AsWBP_Player_Context_Menu_Option, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsVisible_ReturnValue);
	struct UMG_EventReply OnKeyUp(const struct SlateCore_Geometry& MyGeometry, const struct SlateCore_KeyEvent& InKeyEvent, const struct UMG_EventReply& CallFunc_Handled_ReturnValue, const struct InputCore_Key& CallFunc_GetKey_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, const struct UMG_EventReply& CallFunc_OnKeyUp_ReturnValue);
	struct UMG_EventReply OnKeyDown(const struct SlateCore_Geometry& MyGeometry, const struct SlateCore_KeyEvent& InKeyEvent, const struct InputCore_Key& CallFunc_GetKey_ReturnValue, const struct UMG_EventReply& CallFunc_Handled_ReturnValue, const struct UMG_EventReply& CallFunc_OnKeyUp_ReturnValue, bool CallFunc_Array_Contains_ReturnValue);
	void GetAllActiveButtons(TArray<class UWidget*>* Buttons, const TArray<class UWidget*>& FocusableButtons, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UWBP_PlayerContextMenuOption_C*>& CallFunc_GetOptionWidgets_Option_Widgets, class URHContextMenuButton* CallFunc_Array_Get_Item, class UWBP_PlayerContextMenuOption_C* K2Node_DynamicCast_AsWBP_Player_Context_Menu_Option, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_IsActiveForNavigation_Return_Value, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue);
	void GetFirstActiveButton(class UWidget** FocusWidget, const TArray<class UWidget*>& LocalOptionsB, const TArray<class UWidget*>& LocalOptionsA, class UWidget* FocusableWidget, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, class UWidget* CallFunc_Array_Get_Item, class UWidget* CallFunc_Array_Get_Item_1, class UWBP_PlayerContextMenuOption_C* K2Node_DynamicCast_AsWBP_Player_Context_Menu_Option, bool K2Node_DynamicCast_bSuccess, class UWBP_PlayerContextMenuOption_C* K2Node_DynamicCast_AsWBP_Player_Context_Menu_Option_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsActiveForNavigation_Return_Value, bool CallFunc_IsActiveForNavigation_Return_Value_1, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue_1);
	void ShowForPlayer(class URH_RHFriendAndPlatformFriend* Friend_Info, TScriptInterface<class IIKSContextMenuTarget_C> TargetWidget, bool IsPendingFriend, bool IsRequestingFriend, bool IsFriend, bool IsCrossplayEnabled, bool InParty, bool CallFunc_IsVisible_ReturnValue, class UWBP_player_card_module_C* K2Node_DynamicCast_AsWBP_Player_Card_Module, bool K2Node_DynamicCast_bSuccess, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UObject* CallFunc_Conv_InterfaceToObject_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UWidget* CallFunc_GetFirstActiveButton_FocusWidget, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_Is_Any_Option_Visible_Return_Value, TArray<class UWidget*>& CallFunc_GetAllActiveButtons_Buttons, class UWidget* CallFunc_GetFirstActiveButton_FocusWidget_1);
	void PreConstruct(bool IsDesignTime);
	void Handle_Input_State_Changed(enum class ERH_INPUT_STATE InputState);
	void Handle_View_State_Changed(class FName CurrentRoute, class FName PreviousRoute, enum class EViewManagerLayer Layer);
	void BndEvt__WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_0_OnVoiceParticipantUpdated__DelegateSignature(const class FString& AccountId, bool bIsTalking, bool bIsMuted, const class FString& ChannelName);
	void BndEvt__WBP_VoiceActivityContainer_K2Node_ComponentBoundEvent_1_OnVoiceAudioStateChange__DelegateSignature(enum class ERHVoiceActivityAudioState AudioState);
	void DelayMoveMenu(class URHWidget* Widget, const struct SlateCore_Margin& Padding, enum class EViewSide Side);
	void On_Player_Card_Update(class UWBP_player_card_module_C* Player_Card);
	void OnHudInitComplete();
	void ExecuteUbergraph_WBP_PlayerContextMenu(int32 EntryPoint, int32 CallFunc_MakeLiteralInt_ReturnValue, int32 Temp_int_Variable, int32 Temp_int_Variable_1, uint8 CallFunc_Conv_IntToByte_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, uint8 CallFunc_GetValidValue_ReturnValue, uint8 CallFunc_Conv_IntToByte_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, uint8 CallFunc_GetEnumeratorValueFromIndex_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue, bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, int32 Temp_int_Array_Index_Variable, bool K2Node_Event_IsDesignTime, enum class ESlateVisibility K2Node_Select_Default, int32 Temp_int_Loop_Counter_Variable, enum class ERH_INPUT_STATE CallFunc_GetCurrentInputState_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, enum class ERH_INPUT_STATE K2Node_CustomEvent_InputState, class FName K2Node_CustomEvent_CurrentRoute, class FName K2Node_CustomEvent_PreviousRoute, enum class EViewManagerLayer K2Node_CustomEvent_Layer, class UWidget* CallFunc_GetFirstActiveButton_FocusWidget, bool Temp_bool_Variable_2, const class FString& K2Node_ComponentBoundEvent_AccountId, bool K2Node_ComponentBoundEvent_bIsTalking, bool K2Node_ComponentBoundEvent_bIsMuted, const class FString& K2Node_ComponentBoundEvent_ChannelName, bool CallFunc_IsCurrentAccountId_IsAccountId, enum class ERHVoiceActivityAudioState K2Node_ComponentBoundEvent_AudioState, TArray<enum class EPlayerContextOptions>& K2Node_MakeArray_Array, TArray<enum class EPlayerContextOptions>& K2Node_MakeArray_Array_1, bool CallFunc_Array_Contains_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, TArray<class UWidget*>& CallFunc_GetAllActiveButtons_Buttons, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class URHWidget* K2Node_CustomEvent_Widget, const struct SlateCore_Margin& K2Node_CustomEvent_Padding, enum class EViewSide K2Node_CustomEvent_Side, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue, const struct CoreUObject_Vector2D& CallFunc_GetDesiredSize_ReturnValue, double CallFunc_BreakVector2D_X, double CallFunc_BreakVector2D_Y, bool Temp_bool_Variable_3, const struct CoreUObject_Vector2D& CallFunc_SetMenuPosition_ReturnValue, bool Temp_bool_Variable_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class UWBP_player_card_module_C* K2Node_CustomEvent_Player_Card, bool CallFunc_IsShowingPlayer_Showing, bool Temp_bool_Variable_5, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UWBP_PlayerContextMenuOption_C* CallFunc_Create_ReturnValue, enum class ERHVoiceActivityAudioState Temp_byte_Variable_2, bool K2Node_Select_Default_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, class UVerticalBox* K2Node_Select_Default_2, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue, float CallFunc_SetMenuPosition_menuHeight_ImplicitCast);
	void OnReportPlayer_0__DelegateSignature(class UObject* PlayerInfo);
	void OnMenuStart__DelegateSignature(class UWidget* FocusWidget);
	void OnMenuHidden__DelegateSignature();
	void OnReadyForNavigation__DelegateSignature(TArray<class UWidget*>& NavWidgets, class UWidget* Default_Widget);
};

}


